{
    "189050": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=189050&showMyProfs=true", 
        "score": "3.5", 
        "name": "Claudette Gardel", 
        "comments": [
            "She cannot teach at all!! Uses only slides and doesn explain anything clearly.POOR!", 
            "She was very excited about biology. She even got me interested.", 
            "She sucks. She talks too softly and incomprehensibly, goes too fast, and does not explain things thoroughly. If you defined what a good teacher is, she would be the exact opposite of that definition.", 
            "No Comments", 
            "she was pretty cool, in all sense of the word. not great, but definitely cool."
        ], 
        "tags": {}
    }, 
    "121212": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121212&showMyProfs=true", 
        "score": "4.7", 
        "name": "L. Rafael Reif", 
        "comments": [
            "Professor L. Rafael Reif Is passionate about education. Its clases Is very interesting, She show you the worth of Hardwork at Massachussetts Institute of Technology. Is a microeengineering electrical systems genius", 
            "Was an Electives i receive a C in Its Class but he is Excelent Professor. Is very though The Class he explain extremely well but is a though grader. He has and Excelent Personality . I take the course as an Electives because im not from the School of Engineering. You have to Work very Hard but remember Engineering is The Proud of MIT.", 
            "No Comments"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Gives good feedback ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "423126": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=423126&showMyProfs=true", 
        "score": "2.9", 
        "name": "Kenneth Oye", 
        "comments": [
            "His class on political economy taught me wisdom that I still use even years after graduation.", 
            "No Comments", 
            "Very disorganized, not clear exactly what he's lecturing about or why, little discussion, doesn't respond well to student input"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Get ready to read ": "1"
        }
    }, 
    "275416": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=275416&showMyProfs=true", 
        "score": "4.0", 
        "name": "David Benney", 
        "comments": [
            "Hilarious and enthusiastic.", 
            "Benney's the man.", 
            "really good", 
            "A hilarious guy. He'll make you laugh really hard, but if you don't like his approach you're stuck because he's the lecturer, the textbook author and he leads all the recitations.", 
            "Benney is pretty easy, but it's really hard to manage everything if you don't have someone else explain some of the concepts to you, because he most certainly won't. But how can you turn down a math class with only 4 P-Sets and no final???", 
            "This Animal... Benney has got to be the funniest professor at MIT. And his class is really good.", 
            "he says the funniest things. his class is also the easiest of the 18.02 options. (but the book isn't always clear, nor is he...)", 
            "hilarious guy. he will say a series of very notable, funny quotes.", 
            "Benney's Multivariable Calculus class is the best MV Calc class at MIT. I'd recommend it to any incoming freshman.", 
            "DJ Benney rocks the house yo.", 
            "Awesome Professor, hillarious and clear about his topic (He wrote the book too)"
        ], 
        "tags": {}
    }, 
    "1506177": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1506177&showMyProfs=true", 
        "score": "5.0", 
        "name": "Noam Chomsky", 
        "comments": [
            "Phenomenal", 
            "Wow I can't believe I actually found him on here. I've never taken a class with him but I appreciate all the talks he gives on Democracy now and I think his heart is in the right place after all.", 
            "When he coughed I thought he might die, so that was quite frightening. He was otherwise really inspirational, but I guess I'm biased with my preference for the elderly. If you have the chance, take this course quick (and if you want to get a good grade, bring some menthol oil, to clear his airways)", 
            "All-around great guy."
        ], 
        "tags": {
            "Respected ": "2", 
            "Amazing lectures ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "877827": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=877827&showMyProfs=true", 
        "score": "4.5", 
        "name": "Miyuki Hatano Cohen", 
        "comments": [
            "I took introduction to Japanese with her at BU. She is a very nice and highly energetic lady. You can truly she her passion for teaching. The only things wrong with her is the odd energy she has early in the morning and she teaches at a very fast pace.", 
            "Great teacher. A little weird and hyper at times but then don't take her at 8 AM. Office hours are a little early, but worth going to. Chapter tests can be difficult, so try to bone up on all the kanji, vocabulary, oral exams, and projects you can. No idea about how the final will be. This year. Moderate-difficult. Next year? Who knows? STUDY!", 
            "Great professor. Very fun, a little hyper, and keeps her students engaged by constantly incorporating each student into the class with questions. Superb professor and teaching style.", 
            "She's a very nice and approachable professor. She'll make you actually enjoy class. Highly recommended.", 
            "Fantastic teacher. Very enthusiastic, easy to approach. On par with Shingu sensei. You will enjoy class when she teaches because she is very kind."
        ], 
        "tags": {}
    }, 
    "141310": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=141310&showMyProfs=true", 
        "score": "3.8", 
        "name": "Ikue Shingu", 
        "comments": [
            "Had not consulted with the department head after starting their first academic year at NC State. Students were tested on the understanding of culture which counted between 25 and 30 percent of their test grades - never explicitly stated. Worked hard to best in this class by getting a tutor half way", 
            "Students in the class vary in fluency and comprehension. Students consistently have had trouble with the work load. The professor didn't decrease the work load. The grading of all written assignments were far more strict than all except one faculty member. through the semester.", 
            "One of the greatest teachers ever! She's really energetic and funny every class, and really cares about all of her students. Great explanations and her lessons always hone in and make the grammatical patterns very clear.", 
            "No Comments", 
            "She's definitely the nicest teacher of the three. Easiest to approach, most understanding.", 
            "Shingu Sensei is amazing. Amazing teacher, and amazing looking. ONe day we will run away together to Osaka, and get married by a Emperor Hirohito impersonater."
        ], 
        "tags": {}
    }, 
    "842574": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=842574&showMyProfs=true", 
        "score": "4.8", 
        "name": "Jay Scheib", 
        "comments": [
            "Professor Scheib's intro to acting was probably the best class I took at MIT.", 
            "gorgeous. I learned more in this class than I did in four years of course 6.", 
            "intro to acting was the best class I had at MIT, which is pretty embarrassing actually, since it is MIT afterall and this was an arts class, and depressing since I took it the last semester senior year. management '05...... (I heard composition class with prof scheib is also good. i heard it is a lot of work but a cool class."
        ], 
        "tags": {}
    }, 
    "784578": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=784578&showMyProfs=true", 
        "score": "1.0", 
        "name": "Craig Watkins", 
        "comments": [
            "The worst", 
            "UMassBoston hired him as a part-time physics teacher w/MIT students . He is terrible, a nightmare. Incredibly condescending and unclear. Has no social skills. Ask him why gravity is a negative force and he starts talking about his high blood pressure. I've worked on a 3.96 gpa for a couple years now and ended up failing his class. Students beware.", 
            "No Comments", 
            "Meanest professor ever."
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Lecture heavy ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "121107": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121107&showMyProfs=true", 
        "score": "4.1", 
        "name": "Rodney Brooks", 
        "comments": [
            "Cool guy", 
            "Unbelievably innovative!", 
            "really smart and weird", 
            "Totally self-absorbed. No interest in undergrad exeriences whatsoever.", 
            "No Comments"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Participation matters ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "1823114": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1823114&showMyProfs=true", 
        "score": "2.9", 
        "name": "Daron Acemoglu", 
        "comments": [
            "Econ 14.32 Econometrics with this Professor is a smart choice. You learn a lot. He is one of The Biggest Names and very respected for The Economics Department. I recomend instead taking Econ 14.30 Statistical Methods in Economics take better Math 18.440 Probability and Random Variables and Math 18.443 Statistics both are more strong Courses .", 
            "Professor Daron Acemoglu is one of The most cited Economics on The world. He is a great Professor but is very challenging. If you love Statistics dont have very Big Problems to Pass. The Exams are though but If you Study and have passion for one of The most important Courses in Economics Take it with him . This course depends so much from 14.30", 
            "Econ 14.32 Econometrics is one of The Best Courses that i took at Massachussetts Institute of Technology. Professor Daron Acemoglu madres The Econometrics understandable but you need a great Foundations in Econ 14.30 Statistical Methods in Economics. The Class is interesting and is not The worst If you compare it with Econ 14.126 Game Theory.", 
            "Econ 14.32 Econometrics with The Professor Daron Acemoglu Is not The Worst Experience but he Is Better than Joshua Angrist . Is difficult to understand Its language . The explanations of The material Is confusing. Econometrics Is not Mathematical Economics Is Based more in Statistics. I Like The Course but was so difficult The Language barrier.", 
            "great teacher and academic"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Respected ": "2", 
            "Tough grader ": "3", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "547286": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=547286&showMyProfs=true", 
        "score": "4.0", 
        "name": "Gordon Freeman", 
        "comments": [
            "I absolutely loved Dr. Freeman. He presented some fascinating ideas on theoretical physics and was a joy to talk to if you could manage to get him talking. There was this shifty looking suit always poking his head in the class which made me a bit uneasy, but it was an excellent experience regardless. Such a shame he left for some job in New Mexico.", 
            "Loved every class.", 
            "I took Dr. Freeman for advanced spatial void tessellation theory and quantum finite element analysis and I really enjoyed his lectures. It's refreshing to have a professor that is so experienced with field work. I'm considering taking his advanced crowbar manufacturing techniques lab as well, I've heard nothing but good things about that class.", 
            "Great class, but he didn't show up for the third semester for some reason. Otherwise, a great teacher and by far my favorite part of the MIT experience.", 
            "Freeman was a bit on the quiet side. Dosent talk much. Showed us his pictures from Xen and his HEV. 33", 
            "By far the greatest mind of our lifetime. This Professor is a man of few words but an incredible understanding of physics and trans-solar crustaceans. Free crowbars are passed out to everyone as well. The only gripe with him that I have is his lack of understanding of time; he never quite finishes anything.", 
            "I wish that i could learn from him but he doesn't talk much... if at all, all of his demonstrations involve the physics of crowbars, particularly on any nearby windows or vents.He gave me an A so i don't mind. I was under the impression his benefactors would have him teach the 3rd part of the course, sometime in the future, but he hasn't yet.......", 
            "Dr. Freeman's teaching style is an art. I have not heard him speak once, but as long as one keeps up his demonstrations do not need to be spoken for. His labs are an exercise in learning physics via immersion. It saddens me that has not been able to find time to start teaching his planned 300 level courses; I wish I could continue with him.", 
            "One of the best classes I have ever taken.", 
            "I really enjoyed this class! The only thing that I took issue with was the fact that some sort of nicely dressed auditor was there every day and would just come and go with no regard to the class.", 
            "He bashed a headcrab that was in the process of devouring my medulla oblongata. Highly recommended!", 
            "Completely failed to teach Standard Insertion Procedures but otherwise a great professor.", 
            "His lectures were interesting. I think he has throat cancer, because he can't talk at all now. Class is like a game of charades, it's kind of fun. His life has been kinda sad, he got a degree in theoretical physics from here and all his job used to require was pushing stuff and testing monorails. He's a natural at teaching though.", 
            "Mr. Freeman was a good professor overall, but he rarely had time for class. He only came in twice to administer the exams, and both times, some evil zombies broke in and tried to kill him. Of course, he saved us all from certain death, so I would have to give him a 5 for \"helpfulness.\" DON'T get on his bad side. He carries around a rocket launcher.", 
            "I will agree that Gordon does make class very hard, because he NEVER talks. He only teaches by example. It was a very fun and helpful class, I really enjoyed throwing boxes and playing catch with Dog. Probably the most important thing I learned is to not shoot your buggy off a cliff with the gravity gun...or else you'll be walking a LONG way.", 
            "Gordon is a genius. He shows you how to swing your crowbar such that it will kill a head crab in one shot! He has a sexy beard / gotee. The ladies can't get enough of him. Of course the G-man very rudely interrupts the class to take him away on those \"jobs\" he's always doing."
        ], 
        "tags": {
            "Respected ": "3", 
            "Skip class? You won't pass. ": "1", 
            "Hilarious ": "2", 
            "Inspirational ": "3", 
            "Get ready to read ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "1134541": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1134541&showMyProfs=true", 
        "score": "3.2", 
        "name": "Timothy Jamison", 
        "comments": [
            "Tim Jamison is the man. His career options were: professional racquetball, ice cream maker, or MIT professor. His tests were ridiculous, but he did a great job explaining material during office hours/lecture. He really does care about students doing well, and is willing to do just about anything to help them. A great Prof.", 
            "I thought Jamison was a pretty decent prof. His lecture handouts are basically useless, but the lectures themselves are quite good.", 
            "Prof. Jamison wrote insanely difficult exams that did not accurately represent the material covered in class. Clearly a \"noob\" teacher..."
        ], 
        "tags": {}
    }, 
    "1134540": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1134540&showMyProfs=true", 
        "score": "3.3", 
        "name": "Rick L Danheiser", 
        "comments": [
            "He clearly knows his stuff, but he's very unapproachable. If a student asks a question in class he basically just brushes them off and tells them to go look it up cause he doesn't have time to cover it...and then spends the next fifteen minutes talking about the exploits of some random chemist from long ago--interesting but not very useful.", 
            "Wonderful professor who kept orgo lecture as light-hearted as possible. Even his exams had fun little anecdotes on them.", 
            "the man is a walking legend."
        ], 
        "tags": {}
    }, 
    "103718": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=103718&showMyProfs=true", 
        "score": "3.8", 
        "name": "David Jerison", 
        "comments": [
            "Great lecturer who gives grand overviews of different concepts and connects them beautifully. Sometimes lacking in covering the minutiae, e.g. methods, calculations, but can be made up by recitation.", 
            "Best Prof. Of Maths Ever. You will understand everything in second,like instantaneous learning. He is Very inspirational and will make you a master of maths in just a few hours", 
            "I am Independent learner from Puerto Rico I took Math 18.01 with David Jerison, he explains everything excellent. I hope to meet you in person", 
            "Best ever I met in my life.I hope to meet him in the future;he's also very inspirational.", 
            "Great Professor, he makes everything easy and clear.", 
            "great lecturer", 
            "I have been taking his MIT online courses in China for quite a bit of time already. He is the best teacher I have ever had. He has great lectures and makes everything easy to understand. He gives great examples of problems to make sure everyone understands. If you're looking for a strong basis in math, go take his courses!", 
            "I took the online course on single variable calculus and was so impressed with his teaching. All my life I've hated math but he made me fall in love with calculus, he made it appear so easy and intuitive. He is an exceptional professor.", 
            "Math 18.03 Differential Equations is a very beautiful class . The course use a lot of examples from Engineering, Physics, and other Sciences. The Professor is great , he teach you to see beyond Differential Equations. The class is the most hard math requirement for an Engineering student, but is very interesting.", 
            "Math 18.01 is the first Calculus course at Massachusetts Institute of Technology. Covers All topics in Differentiation and Integration . The Professor explains well and Calculus is hard for so much people. Great Professor", 
            "Professor David Jerison at Massachussetts Institute of Technology is not the kind of Professor that you want to take Calculus. Math 18.01 Calculus I is pretty heavy , because covers Differentiation and Integration in one semester. You have to read Simmons Book and lecture notes are more worth it that going to class.", 
            "MIT Professor David Jerison for Math 18.01 is a bad choice. He explains very confusing with silly examples and very hard problems on the exam . You learn very few , the lectures notes and the book are better than the class . My friend Stacy take this class with other Professor and She learn so much that me in Fall 2006 .", 
            "Makes everything more complicated than it should be.", 
            "good", 
            "Very good explanations and an obvious passion about Mathematics.", 
            "He is awesome", 
            "First time that i Take Math 18.03 Differential Equations was with Professor David Jerison. He explain The material but are enough simple in comparison of Its exams . You have to use The Book to understand.", 
            "His explanations aren't as clear as I expect them to be", 
            "He is a nice Proffessor very Clever but difficult to understand sometimes . Differential Equations ( Math 18.03 is difficult for much people. He Give difficult Exams , but explain a too Easy in the Class and that dont help", 
            "perfect prof for calculus helped me so much :)"
        ], 
        "tags": {
            "Respected ": "8", 
            "Gives good feedback ": "3", 
            "Tough grader ": "7", 
            "Test heavy ": "4", 
            "Skip class? You won't pass. ": "1", 
            "Lecture heavy ": "4", 
            "Participation matters ": "2", 
            "Hilarious ": "3", 
            "Lots of homework ": "3", 
            "Caring ": "3", 
            "Inspirational ": "10", 
            "Amazing lectures ": "9"
        }
    }, 
    "858785": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=858785&showMyProfs=true", 
        "score": "5.0", 
        "name": "William Reyes Cubides", 
        "comments": [
            "Last two postings do not belong to MIT class system. The professor is unfortunately not teaching here any more. He was one of the best I have had!", 
            "Best prof. ever. No one I have had has ever cared the way this guy does.", 
            "One word: awesome!", 
            "Absolutely awesome! His classes are NEVER boring! He is always up-to-date with what's going on in the Spanish speaking countries and brings \"fresh\" activities/info to the class."
        ], 
        "tags": {}
    }, 
    "144641": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=144641&showMyProfs=true", 
        "score": "3.6", 
        "name": "Hartley Jr. Rogers", 
        "comments": [
            "He was my recitation 18.034 (diff equations) instructor in 1967. Rather than throwing a blizzard of theory at us, he taught us how to do the work. Novel concept! He passed in 2015 but deserves mention here I believe.", 
            "Great voice!", 
            "The class was very easy. Hartley Rogers was very entertaining. It was the last time that he taught 18.022.", 
            "\"orgies of cancellation!\"", 
            "funny", 
            "I had a good laugh at this class when I went. I think Hartley Rogers might be just a little past his prime. Halloween was priceless, though when he stopped mid-lecture and just said \"booooooooooooooooooooo.\" Maybe you had to be there, but an 80 year old man whose voice goes that low is hilarious.", 
            "Hillarious classes, but you can't really learn much, and the textbook isn't very useful either.", 
            "Hartley is wonderful. Class is entertaining, so sit back and enjoy the show. Many find his class helpful for catching up on sleep, but why would one wish to miss the humor. Hartley for President '04!", 
            "\"My advisor (Alonzo Church) told me I should do computers, but I didn't believe him, so I did math. Boy was I wrong. I should've done computers!\" -Hartley Rogers. Old, but hilarious as hell.", 
            "Took 18.02 from him 42 years ago, was great then.", 
            "Hartley Rogers is old and slow, but he is hilarious.", 
            "No Comments", 
            "Not a very good class....didn't learn much", 
            "It's worth taking the class just to joke later about him."
        ], 
        "tags": {}
    }, 
    "622889": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=622889&showMyProfs=true", 
        "score": "5.0", 
        "name": "Norvin Richards", 
        "comments": [
            "He's great and I love every moment in his class.", 
            "Amazing experience to listen to him. Intelligent, caring, helpful, funny. One of the best teachers I've ever had!", 
            "Not only is he an outstanding linguist, he is a gifted teacher, in the deepest sense of this word. His lessons are a real experience. One of the best teachers I have ever had the pleasure to have.", 
            "One of the best classes I had. Unbelievably smart and witty. extremely hepful. Very amusing lectures", 
            "Best Professor Ever!!! 24.900 with norvin rocks!!! This was one of the few courses I have ever had where I looked forward to lecture!", 
            "Best professor at MIT!! Great beard!!"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "352233": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=352233&showMyProfs=true", 
        "score": "3.0", 
        "name": "Daniel G. Nocera", 
        "comments": [
            "Notes are overly terse and contain mistakes.", 
            "No Comments", 
            "GOod teacher but I've definitely heard that he's a super-sleeze on the lay-days.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "352232": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=352232&showMyProfs=true", 
        "score": "3.2", 
        "name": "Christopher Cummins", 
        "comments": [
            "Chem 5.03 with him is pretty hard but any Organic Chemistry course is a difficult. The exams are difficult, but is a great Lecturer.", 
            "Course is good", 
            "I took Chem 5.111 Principles of Chemical Science that have Calculus and the Chemistry concepts by Prof. Cummings are not presented very clear. He is very smart but the level of difficulty if you don't study well can be hard. If you're not Major in Chemistry take this in next semester", 
            "He was wonderful. I loved the lecture he taught 'Principles of Chemical Science' a lot, and it's very inspiring.", 
            "Mr. Cummins is very knowledgeable of what he is teaching, and he has a very crystal clear and attrative voice. Love it!", 
            "Terrible, terrible teacher. Do NOT take 5.03 from this man. The confusion and lack of learning will never stop.", 
            "Puts little effort into teaching. What is covered in lecture has little to do with what is covered on exams.", 
            "Somewhat convoluted lectures, hard to follow his train of thought. Probably too smart to teach an intro level class. WAY too much focus on WHO did what and when vs. the actual chemistry. Has a very monotonous voice. You will want a good TA to explain the more abstract concepts.", 
            "Very unclear about the subject in itself. Knowing about Nobel Prizes don't help you learn what you ought to know.", 
            "He is good at conveying the material to those who pay attention in class", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Test heavy ": "1", 
            "Respected ": "1", 
            "Tough grader ": "2"
        }
    }, 
    "1083753": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1083753&showMyProfs=true", 
        "score": "2.9", 
        "name": "Paul Schechter", 
        "comments": [
            "He's awesome", 
            "Although I failed the class, he spent so much time helping me when possible and answering my questions! He never looked down on me; he was encouraging. What a fabulous professor!", 
            "If you pay attention/come to lecture he's actually pretty clear. Is definitely obsessed with physics which makes him excited about the class. Super approachable and friendly", 
            "Jumps around points during lecture. Not very clear. My high school AP physics B teacher was better than him and I thought my high school teacher sucked. I would recommend you watch the OCW on 8.01's professor instead.", 
            "Not a very good prof... very inarticulate. But friendly, which counts for something.", 
            "what a cute little nerdy MIT prof", 
            "this prof obviously dislikes teaching since he never does any...when you go to him for help, he rolls his eyes and has you do problems without indicating what you are doing wrong. HE IS THE WORST TEACHER I HAVE EVER HAD! Totally waste of time and my parent's money. Major disappointment."
        ], 
        "tags": {}
    }, 
    "955581": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=955581&showMyProfs=true", 
        "score": "4.0", 
        "name": "Enectali Feliciano", 
        "comments": [
            "Enectali Figueroa Feliciano was a great teacher In physics. He looks like Marc Anthony teaching Physics. He is from Puerto Rico . He studied at Stanford University. He is an expert in Dark Matter and Astrophysics in General. He challenges you . But is not the greatest at Massachusetts Institute of Technology.", 
            "Physics at Massachusetts Institute of Technology with Professor Enectali Feliciano was a great Professor . He is an expert of Astrophysics and comes from Puerto Rico. He is an excellent lecturer the exams are a little tricky. He is at Norwestern University now.", 
            "He is a nice professor but he is also a TOUGH one."
        ], 
        "tags": {
            "Test heavy ": "1", 
            "Lecture heavy ": "2", 
            "Tough grader ": "2", 
            "Inspirational ": "1"
        }
    }, 
    "1003625": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1003625&showMyProfs=true", 
        "score": "2.5", 
        "name": "Ian Hunter", 
        "comments": [
            "His lectures are a bit confusing, but cram a huge amount of signals/systems/instrumentation into your head in an impressively short amount of time.", 
            "Frankly, lectures were all over the place. Much of the class was sitting around in a circle discussing our opinions about the reading material. I use these terms lightly, because it wasn't a very scholarly discussion - lots of stories. I understand Japanese Popular Culture is in itself not super scholarly, but I was hoping for more structure.", 
            ""
        ], 
        "tags": {
            "Respected ": "1", 
            "Caring ": "1"
        }
    }, 
    "287926": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=287926&showMyProfs=true", 
        "score": "1.8", 
        "name": "Stanley Kowalski", 
        "comments": [
            "Physy 8.01 at Massachusetts Institute of Technology with this hateful person is a disaster . Writes bad on blackboard. Don't teach nothing new better was high school physics. He involved so much Multivariable Calculus before you take that course. Nuclear Science and Engineering and Physics majors avoid this Professor.", 
            "At The Freshman Year at Massachussetts Institute of Technology i took Physics 8.01 with this Professor Stanley Kowalsky. The Professor is Brilliant but he dont explain well and dont help The students. Three hours are an eternity and you dont learn so Much physics because he dont care about The students .", 
            "Unable to contribute anything to my learning in this course.", 
            "doesn't explain anything, extremely rude over email, condescending to anyone with a question", 
            "bad", 
            "Fast blackboard", 
            "really boring, doesn't really teach anything just reads off the blackboards, no real reason to go to class.", 
            "Found Prof. Kowalski to be a good lecturer, but that's it. When I met with him to express some concerns I had, his eyes were closed at least half the time I was speaking. His final was insanely difficult and he laughed while looking over some students exams after they had been handed in.", 
            "Boring lectures, too many derivations, not enough focus on the conceptual", 
            "Boring lectures! Luckily, the lecture notes are good and more legible than his chalkboard pictures. Sadistic e-mails, including asking us if we enjoyed his \"challenging final\". Perhaps Kowalski is the Physics department's answer to getting student excited about TEAL.", 
            "His blackboards are pretty. But his personality isn't very nice.", 
            "No Comments", 
            "He sent out threatening emails to our class (no joke: THREATENING). He had no sympathy for student athletes or anything else who had to miss an exam for whatever reason. The man has negative compassion.", 
            "also, he's really really fresh and sarcastic with students.", 
            "he speeds through nine blackboards like there is no tomorrow in 50 minutes, it is impossible to listen to him and copy notes.. then he posts the boards online and they're blurry, he assigns mastering physics, problem sets, AND exams all in the same week:(", 
            "No Comments"
        ], 
        "tags": {
            "Lots of homework ": "2", 
            "Tough grader ": "2", 
            "Lecture heavy ": "1"
        }
    }, 
    "162394": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=162394&showMyProfs=true", 
        "score": "4.7", 
        "name": "Eric Lander", 
        "comments": [
            "He is such a professor. He's so intelligent, yet so humble! I love Eric Lnader", 
            "He's just such a great, humble,amazing (Don't forget Extreme sense of humor). He's the best teacher I have ever met!", 
            "hard", 
            "Here's the deal - I hate biology. I've tried to enjoy it, it's just my least favorite subject. HOWEVER, Eric Lander somehow made dragging myself out of bed to go to a lecture on my least favorite subject worth it. God bless you, Professor Lander", 
            "Excellent Professor of Biology so fun. I studied NSE biology is very useful and easy", 
            "If i have The opportunity take Bio 7.012 First Semester Biology at MIT . He is The Best Professor a genius really. He Explain genetics, Microbiology, Biochemistry and other Topics like different Ecosystems all in one Class . Massachussetts Institute of Technology is The best University and Its shown by The Quality of Its Professors", 
            "Bio 7.012 is Fundamentals of Biology at Massachussetts Institute of Technology. Its lectures are amazing. If you read and Study you Pass with an A. He is The Best Professor of Biology and explain Genetics like no One can. Definitely Take you learn so much and he is very intelectual. Biology was The Best course at The First year.", 
            "Clear, exciting, inspiring, thought provoking and riveting lectures. Difficult concepts for many. The software employed is helpful for understanding the concepts. Eric introduces concepts as things to be worked out. You think along with scientific development. Genomics - emphasized.", 
            "Great course for catching up with what's been happening in molecular genetics over the 45 years since I first studied it.", 
            "The best Biology professor!", 
            "My favorite teacher so far! His ability to draw you in the world of biology, the way he teaches, his dedication are second to none!", 
            "Prof. Lander is an expert in his field and a gifted lecturer. He makes very complex material not only comprehensible but enjoyable to learn. His enthusiasm in the subject matter is contagious. Lastly, he has a terrific sense of humor.", 
            "The most inspiring. Lecturer I have ever had. A real treat to have him lecture.", 
            "He's by far the best professor I have ever studied under. I was quite skeptical about biology at first, but it's now become one of the subjects I'm most interested in, thanks to his class.", 
            "BEST of the Best", 
            "A truly exceptional professor. His lectures are thorough, enthralling and thought provoking.", 
            "MOST AMAZING PROF EVER", 
            "You'll be satisfied ... believe me ...", 
            "Eric Lander is a world renowned biologist who worked on the human genome projects. He alternates lectures with Weinberg, who is very smart but is a terrible lecturer.", 
            "He's an amazing professor. He's very engaging and obviously passionate about what he does. I'm sad that the semester is already halfway over!"
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Tough grader ": "2", 
            "Beware of pop quizzes ": "1", 
            "Lots of homework ": "1", 
            "Hilarious ": "4", 
            "Clear grading criteria ": "1", 
            "Amazing lectures ": "5", 
            "Inspirational ": "4"
        }
    }, 
    "774737": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=774737&showMyProfs=true", 
        "score": "4.0", 
        "name": "Kimberly Berkowski", 
        "comments": [
            "CHem 5.13 Organic Chemistry was a extraordinary experience with Prof. Berkowski. She is extremely excellent teacher . You must have to do the work but she explains extremely well .", 
            "BEST PROF AT THE INSTITUTE EVER", 
            "She explains things clearly and gives great reviews. very enthusiastic!", 
            "Totally unfair grader - not helpful or understandind at all", 
            "Dr Berkowski is WONDERFUL. She has the cutest \"When I was in grad school...\" stories :)", 
            "She is Amazing!!!", 
            "She's smokin'. And I guess she's good as a prof too.", 
            "She is down to earth and very enthusiastic.", 
            "No Comments", 
            "best class i ever took at the tute....", 
            "Lied to me. Was unfair in final course grade. I feel cheated."
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "1867667": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1867667&showMyProfs=true", 
        "score": "3.9", 
        "name": "William Minicozzi", 
        "comments": [
            "He was a good and clear lecturer, sometimes a bit fast. Makes jokes sometimes, seems like a friendly guy. It was possible to miss lecture and still get by in the class but not ideal.", 
            "Minicozzi is the best. He's hilarious and his lectures are pretty clear. 18.02 was great with him.", 
            "His lectures are hilarious. Yes the material is all posted online, but I show up to classes to listen to his sassiness :) Tests aren't incredibly difficult; they are (like he says in lecture) very similar to the practice exams posted online.", 
            "He is not the most fantastic lecturer ever, but he covered the content without too many hitches (considering it was his first time teaching the class, it was good. I'm expecting he'll get better.) He is also HILARIOUS. He has a great personality and sense of humor. If you go to office hours, he is also quite helpful there. Highly recommended!"
        ], 
        "tags": {
            "Hilarious ": "3", 
            "Respected ": "2", 
            "Lecture heavy ": "1", 
            "Clear grading criteria ": "2", 
            "Caring ": "1"
        }
    }, 
    "99389": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=99389&showMyProfs=true", 
        "score": "5.0", 
        "name": "Michael Sipser", 
        "comments": [
            "Excelent Profesor of Mathematics and For Theory of Computation . Very nice Professor gives you chocolate for any correct answer. Also encouraging you to do your best .", 
            "amazing", 
            "Sipser is awesome!!! He gave out Snickers bars for correct answers in lecture, and did an overall awesome job of explaining multi-variable calculus. Lots of sweet quotes from him, too. Sips is the man!", 
            "A really great guy that tries to keep his classes interesting and amusing while delivering the material in a lucid and straightfoward manner.", 
            "No Comments", 
            "No Comments", 
            "Does a great job teaching a hard course"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Amazing lectures ": "2", 
            "Caring ": "2", 
            "Tough grader ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "798501": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=798501&showMyProfs=true", 
        "score": "3.5", 
        "name": "Elena Ruehr", 
        "comments": [
            "A wonderful, caring professor.", 
            "A really superb teacher who really knows how to compose and how to impart the info to her students. One of the best I've had in my 3 years at MIT.", 
            "She knows her stuff, but always seems so ditzy when trying to impart it; not an admirable quality when instructing some of the brightest minds in the world. A composer, she tends to refer to her own work a lot; frankly I would prefer that she use \"real\" composers such as Mozart and Bach for reference until her influence reaches beyond Cambridge."
        ], 
        "tags": {}
    }, 
    "312515": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=312515&showMyProfs=true", 
        "score": "1.8", 
        "name": "Richard Shrock", 
        "comments": [
            "I'm sure he's a nice guy, but he's a horrible teacher. I (and more than half our class) stopped going to lecture because it was useless. All he cares about is his particular interests, aka the stuff he won his noble prize in", 
            "Lectures sometimes a bit disorganized, but the demos were fun, and he seems very enthusiastic about them. Willing to explain points following lecture. Significant discussion of his research interests toward the end of the course, which was interesting. Last lecture discussed how to win a Nobel prize, and he brought in a copy of his medal.", 
            "He's a genuinely nice and funny guy, but I felt like I could really follow his lectures. He means well though, and he likes to keep class lighthearted, which I appreciated. I just don't think teaching is his talent...", 
            "He's a nice guy, good demos, just his lectures are incomprehensible, and I don't even think he knows it.", 
            "shrock sucks", 
            "No Comments"
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Lecture heavy ": "1"
        }
    }, 
    "667161": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=667161&showMyProfs=true", 
        "score": "4.2", 
        "name": "Zoltan Spakovsky", 
        "comments": [
            "Very challenging class, but an extremely knowledgeable professor", 
            "Hands down the best professor I've had here. His enthusiasm for the subject material is infectious - Thermodynamics was one of the few classes I legitimately enjoyed, because he made me want to learn. He demands a lot, but if you accept the challenge, you'll learn a lot.", 
            "Hot only because of the ponytail..."
        ], 
        "tags": {}
    }, 
    "87635": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=87635&showMyProfs=true", 
        "score": "4.3", 
        "name": "Wolfie Ketterle", 
        "comments": [
            "Professor Wolfgang Ketterle Nobel Prize Winner in 2001 is an excellent lecturer. He makes you thing a lot on the exams . He covered all the material for the class and make an excellent use of Massachusetts Institute of Technology High End Technology", 
            "The best professor of physics super smart and enjoyable lectures", 
            "So brilliant it's fun just to watch him think :)", 
            "Amazing guy. Inspiring.", 
            "He has an accent that's hard to tell. It's not really his fault though-TEAL sucks.", 
            "ITS WOLFGANG", 
            "He knows his stuff. Really likes this stuff. Kind and helpful. :)", 
            "No Comments", 
            "No Comments", 
            "trust my ekvations..."
        ], 
        "tags": {
            "Respected ": "2", 
            "Inspirational ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "667163": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=667163&showMyProfs=true", 
        "score": "5.0", 
        "name": "Mark Drela", 
        "comments": [
            "literally the best", 
            "Great Prof! Great notes, teaches clearly, fairest grading, and the most interesting part of Unified!", 
            "Great Prof! Great notes, teaches clearly, fairest grading, and the most interesting part of Unified!", 
            "Drela is the man. He's the only part of Unified that I liked."
        ], 
        "tags": {}
    }, 
    "121181": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121181&showMyProfs=true", 
        "score": "5.0", 
        "name": "Steven Leeb", 
        "comments": [
            "Wasn't sure which lab to take - within 2 lectures I was sold. Absolutely the best class I've taken at MIT. I totally agree with the class description - This class is the reason you came to MIT.", 
            "Clear, organized lectures and very approachable. One of my favorite professors at MIT.", 
            "I had a lot of fun in this class! Leeb got me interested in digital electronics, which I previously did not care much for. He's always enthusiastic and definitely knows how to teach."
        ], 
        "tags": {}
    }, 
    "893325": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=893325&showMyProfs=true", 
        "score": "3.3", 
        "name": "Donca Steriade", 
        "comments": [
            "Linguistics courses at Massachusetts Institute of Technology are not piece of cake . She is a great Professor but is very challenging and demanding. You have to read so much . But I recommend it if you like to read . I took the course a couple of years ago .", 
            "Amazing", 
            "Yes, she teaches with a take-no-prisoners attitude, but the class (if you attended and paid attention) was fantastic and inspiring. Everything I learned was new to me. Linguistics is a science and Steriade is its God!", 
            "This was single handedly the worst class I have ever taken. Everyone said linguistics was fun but after this class I never ever want to see nor heard linguistics mentioned ever again. Please do not let any of your friends take this class.", 
            "No Comments", 
            "So boring. I was legit interested in linguistics before. Now I would rather swim in the charles than sit through another linguistics lecture."
        ], 
        "tags": {
            "Lecture heavy ": "1", 
            "Get ready to read ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "144636": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=144636&showMyProfs=true", 
        "score": "3.0", 
        "name": "Haynes R. Miller", 
        "comments": [
            "Prof. Miller taught me to do elegant proofs in 18.014 Calculus with Theory. He is a great professor you learn so much but have to put efforts . He do proofs very natural and is a brilliant Mathematician . Sofía", 
            "In Spring 2007 I repeat the wonderful experience that I had in 18.014 . I took 18.024 Multivariable Calculus with Theory that is Calculus II proof emphasize. The course is extremely gorgeous but challenging. Professor Miller explains everything clear . Multivariable Calculus, Differential Equations Ordinary and Partial Differential Equations.", 
            "In 2006 I took Math 18.014 Calculus with Theory with Professor Haynes R Miller . Is an excellent Professor he explained extremely well but the class is extremely beautiful and difficult. We used Tom Apostol Book that has two Volume This Course cover a lot of material From Single Variable Calculus, Multivariable Calculus, Linear Algebra and ODES", 
            "Professor Haynes R Miller is an excellent Professor especially in Topology. He explains fast but is a critical thinker . The exams are superb challenging. Algebraic Topology and Geometrical Topology is not and easy class requires a lot of practice.", 
            "I took Math 18.03 Differential Equations with Professor Haynes Miller . The personality is not the best but he teach you Mathematics well. Is not so accessible and the exams are harder . I like the course because he integrated so many of Linear Algebra topics. The applications are in Engineering and Science mostly .", 
            "Prof. Haynes R Miller is inspirational and a Genius in Mathematics. I love Math 18.900 Intro to Topology The course is very difficult but not is by The Professor. If you read and do your Work dont have Problems to Pass . Is one of The Biggest Names at Massachussetts Institute of Technology. He explains pretty clear You learn a lot", 
            "This Professor Haynes R Miller explains very confusing , have a bad personality and dont like to Answer questions . He is The only genius in Its Class . I drop out Math 18.03 Differential Equations The Exams are extremely difficult and he do so many mistakes on black board", 
            "Phenomenal professor.", 
            "A lot of people are giving Prof. Miller low ratings. I took his class (18.03) three years ago, and thought he was one of the better math professors. His use of the Java applets to visualize harmonic motion was extremely helpful, as were the concept questions asked randomly during the lectures.", 
            "Realy bad", 
            "This guy was mean and bitter. Steer clear if at all possible", 
            "He has good intentions, but he is unclear and makes everything far harder than it needs to be.", 
            "What an awful teacher--his problem sets and exams are full of typos, and he can't explain his way out of a paper bag. A complete waste of a semester.", 
            "18.03 was ridiculously boring. Sometimes we juggled during lecture to amuse ourselves.", 
            "18.03 has proven itself to be so useful in future studies in course 8, 18, and 6. Prof. Miller is inspirational.", 
            "Nice guy...too nice.", 
            "boo", 
            "Haynes Millah is wicked ahwesome!", 
            "Did not learn much from this class", 
            "I only went to two of his lectures and never did the homework and I still passed"
        ], 
        "tags": {
            "Respected ": "5", 
            "Tough grader ": "6", 
            "Test heavy ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Inspirational ": "5", 
            "Amazing lectures ": "1"
        }
    }, 
    "613976": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=613976&showMyProfs=true", 
        "score": "5.0", 
        "name": "Wit Buzca", 
        "comments": [
            "Profesor Witz Busza is an Excellent Teacher and have so much experience. I took a Graduate course in physics long time ago and I learn so much . He is very caring with its students and humble", 
            "Terrific professor who makes things extremely clear and teaches problem solving skills that actually work.", 
            "Best. TA. Ever.", 
            "AWESOME!!!!"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "855629": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=855629&showMyProfs=true", 
        "score": "2.4", 
        "name": "Linda Griffith", 
        "comments": [
            "I didn't like the class, but I passed. the name of the game.", 
            "lectures are unclear.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "791556": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=791556&showMyProfs=true", 
        "score": "5.0", 
        "name": "Esther Duflo", 
        "comments": [
            "Esther Duflo is the best professor of Economics at Massachusetts Institute of Technology. She is very caring about its students . She do amazing lectures and help the students to grasps concepts. She use the Technology and the Challenge of World Poverty is a wonderful topic . Inequality economics is a problem.", 
            "Esther Duflo is a real gem for the Department of Economics at MIT. She cares a lot about students explain well and you understand everything. She makes a great effort to made me conscious about economics inequality. I wish that She gives other courses like Econometrics and Game Theory but she don't taugh those courses", 
            "Amazing Professor", 
            "Amazing class with incredibly amazing profs."
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Gives good feedback ": "1", 
            "Amazing lectures ": "1", 
            "Caring ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "121239": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121239&showMyProfs=true", 
        "score": "4.2", 
        "name": "Peter Szolovits", 
        "comments": [
            "I like his sense of humor. Always available for questions. Very knowledgeable. Explains material very clearly, often with interesting stories - possibly because he's been living for many years.", 
            "High Maintenance", 
            "haughty, arrogant and hard-to-get.", 
            "Seems to be a nice guy, but a hard taskmaster", 
            "funny guy"
        ], 
        "tags": {}
    }, 
    "121120": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121120&showMyProfs=true", 
        "score": "3.7", 
        "name": "Jesus Alamo", 
        "comments": [
            "clear and organized, but sometimes speaks too fast and in a low voice", 
            "too hard about attending class", 
            "One of the most memorable teachers to ever teach me! He is crystal clear, very well prepared, and very precise. His was the ONLY 9am class I ever took! :)", 
            "Eh; pretty boring.", 
            "No Comments", 
            "Very clear, precise", 
            "just hated the class. very boring.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Lecture heavy ": "1"
        }
    }, 
    "21107": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=21107&showMyProfs=true", 
        "score": "1.9", 
        "name": "Clark Colton", 
        "comments": [
            "He doesn't care about students or teaching at all. Thus, he fails one of his primary duties as a professor.", 
            "Cares little about students. Too stuck in his own research.", 
            "No Comments", 
            "i ta'ed for this class. he was a harsh professor, both to the students and TA's, but in the grading session, he was actually quite generous.", 
            "Learned a lot from him!"
        ], 
        "tags": {}
    }, 
    "21108": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=21108&showMyProfs=true", 
        "score": "3.8", 
        "name": "Herbert Sawin", 
        "comments": [
            "funny,very helpful and interesting", 
            "Professor Sawin is the most ill-mannered person in the Department of Chemical Engineering, and possibly in the whole Institute. He is extremely unhelpful and it can take him months to return an email if he doesn't like you for whatever reason he may have.", 
            "not a bad lecturer...not a bad guy...engaging lectures....", 
            "very helpful and accessible outside of class", 
            "No Comments", 
            "Very nice,tried to engage the students, good sense of humor, and totally HOT.", 
            "Very engaging and helpful. Really great notes! He is the BEST!", 
            "makes fun of students.", 
            "funny guy, is very clear and helpful, seems nice and loves to tell stories"
        ], 
        "tags": {}
    }, 
    "121231": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121231&showMyProfs=true", 
        "score": "2.0", 
        "name": "Charles Sodini", 
        "comments": [
            "Easily the worst lecturer in EECS. Thinks that crunching numbers on calculators is learning. Shies away from math. Has a temper.", 
            "Simply horrible! He has a bad temper. When you ask him questions, he does get angry. Yes, if you do have questions you can make an appointment with him in his office, but do not ask too many questions just to save your day from getting depressed.", 
            "He rarely used the board to explain the materials. He always used the powerpoint to explain things. To me, this is not a way of explaining semiconductor physics. One time I went to ask him few questions, and at the end he got very angry for not understanding him. He has a bad temper. All I can say is that, his teaching is horrible!", 
            "the best", 
            "No Comments", 
            "horrible!"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Test heavy ": "1"
        }
    }, 
    "231197": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=231197&showMyProfs=true", 
        "score": "4.3", 
        "name": "Simona Socrate", 
        "comments": [
            "Very Clear lectures with good lecture notes for the on-line class", 
            "She is by far one of the best professors I've ever had. I was stuck on a few concepts in the class and she was very accessible and helpful outside of class.", 
            "Conceptos muy claros, con la agilidad imprescindible. Especialmente útil para consolidar conocimientos básicos: criterios de signos, tensores, etc.", 
            "excellent course", 
            "Best thing about her lectures are that anyone can easily understand as they all start from scratch.", 
            "Excellent professor! Very clear and informative lectures. She seems to really enjoy the course (elements of structures) and discipline (mechanical engineering) which compels me to be more interested and committed!", 
            "The presentations were interesting. The pdf board notes and summary notes were the most useful.", 
            "Very good", 
            "Simona is awesome! Great lecturer.", 
            "Simona makes no sense...and her drawings on the board are mumbo jumbo. Worst BE class I took at MIT.", 
            "Very good lecturer, although few did find her to go a little fast. But you will definately grow to love \"THE POTATO!!!\"", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Accessible outside class ": "1", 
            "Hilarious ": "1", 
            "Caring ": "2", 
            "Clear grading criteria ": "1", 
            "Amazing lectures ": "2", 
            "Inspirational ": "1"
        }
    }, 
    "1419469": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1419469&showMyProfs=true", 
        "score": "4.8", 
        "name": "Christopher Weaver", 
        "comments": [
            "Although not technically a programming class, learning Agile variants and how to apply McConnell metrics while team coding in Unity made it one of the most useful coding classes I have taken. Professor is always there for students and committed to our learning. This was an awesome class--just sorry it had to end.", 
            "Amazing class. Professor is famous but never shows it. Many other game luminaries who are his friends did guest lectures. Learned more in this one course than almost all others. Take it.", 
            "This course should be a core requirement for two terms. Loved the ride. Loved the burn. Loved the course.", 
            "Great class, but be prepared to work for every one of those twelve credits. Professor said it was a \"Boot Camp\". He wasn't kidding. But I would take it again because there was so much stuff that I couldn't absorb it all the first time. One of my best classes in four years. Should be required for programmers.", 
            "Simply a fantastic experience. Never worked so hard! But really loved the way the class evolved and the things we learned. Will never forget the lessons.", 
            "One of the best lecturers I have had in four years at MIT. I appreciate the environment the Professor establishes with the students where each one is individually responsible for his or her own progress. It conveys a great deal of trust in his students and simulates real world expectations. A masterful teacher and a unique classroom experience.", 
            "As a female engineering major, I cannot think of a more genuinely supportive teacher. The Prof made sure I knew the theory and then told me to take chances and understand my own power to change the team's destiny. I learned so much I want to take the class again. My top class at MIT.", 
            "A previous student recommended I take the class. The Professor said that he hoped each student would remember at least one thing from the class long after we graduated. Well, I am graduating next month and have a list of things I will remember. The class is a standout and should be a Course 6 requirement. Weaver rocks!", 
            "Came in not knowing what to expect. Came out knowing more about development techniques and thought process than any other class! Worked hard but in the end it was well worth the effort. Recommend without hesitation--so long as you are prepared to do the work.", 
            "Learned more about team development here than any other class. Professor is no nonsense. Lectures sometimes got long, but the information was there. Sometimes almost too much information to digest at one time. But it all came together toward the end. All the info tied into what we would need to complete assignments. Tough but very rewarding class.", 
            "This was hands down the best class I have taken in four years at MIT. If you get a chance, take it, do it. You will be amazed at how much the Prof. knows about every facet of the industry and how good he is at teaching his \"craft\". I wish I had taken it as a freshman! Learned a ton!", 
            "Will update but am enjoying the class. The Prof's stories and depth of experience are amazing. The lab is a bit daunting, but he says he won't let us crash and burn...but he is definitely one to let you explore how far you can get on your own. I am working my ass off but having a good time. This is definitely a \"Master Class\".", 
            "Surprisingly witty dude. Really tells it like it is. Knows his stuff on every level but really good about taking questions and giving thoughtful answers. I came away with an amazing amount of information, and some practical experience because of the lab component. You'll do a lot of work. But the guys a rock star so what do you want?", 
            "Weaver founded Bethesda Softworks. Great depth of industry and technical knowledge. Loves teaching and it shows. Makes himself available and is a wonderful mentor. One of my most memorable classes at MIT.", 
            "Knows his stuff! Excellent lectures. Have to do a lot of work but well worth it. Learned a ton."
        ], 
        "tags": {
            "Respected ": "4", 
            "Gives good feedback ": "1", 
            "Group projects ": "1", 
            "Participation matters ": "4", 
            "Inspirational ": "6", 
            "Amazing lectures ": "6"
        }
    }, 
    "95058": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=95058&showMyProfs=true", 
        "score": "3.1", 
        "name": "Muriel Medard", 
        "comments": [
            "Professor Medard is awesome. Not easy, makes your work for it.", 
            "Outstanding Prof!", 
            "Never got confused in this class", 
            "Medard is rather hard to understand. I wish I had taken 6.041 from someone else.", 
            "Nice, but lectures didn't help at all. The material and examples covered in letcure were way easier than what was on the p-sets and tests.", 
            "No Comments", 
            "A nightmare of a class. Medard has enthusiasm, but lacks teaching skills.", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "95059": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=95059&showMyProfs=true", 
        "score": "3.7", 
        "name": "Patrick Winston", 
        "comments": [
            "Arrogant, and seems to have a propensity for making poor predictions about the future of AI. He also shows demonstrations before they've been fully discussed in his lectures, effectively putting the cart before the horse. You need to make a leap of faith that you'll learn what you need to know in the recitations.", 
            "Watched the complete 6.034 course online. Excellent lecturer.", 
            "You may not learn AI so much with Winston, rather you'll learn more about how to think and how to be more clear. Winston's lectures are as much about AI as they are about life. Who cares though, learning the AI stuff is easy, getting the life lessons is well worth it.", 
            "y", 
            "HIE was an interesting class with not alot of work. Professor Winston has a style all his own that you either love or hate, but you have to give it to him, he gives it to you straight, and is funny at times", 
            "Very smart guy", 
            "An outstanding professor.", 
            "The best professor I have had at MIT.", 
            "Very funny guy. Great lecturer. Who else brings donuts to class?", 
            "Winston does not mention any of the material on tests or homework in his lectures- he leaves that to recitation and tutorial instructors. His problem sets were insanely long at first, but he later corrected that.", 
            "he's a boring and arrogant professor", 
            "No Comments", 
            "he's an arrogant guy who isn't that smart", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "667174": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=667174&showMyProfs=true", 
        "score": "2.5", 
        "name": "Paul Lagace", 
        "comments": [
            "", 
            "um, yeah :/", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "761785": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=761785&showMyProfs=true", 
        "score": "4.5", 
        "name": "Max Tegmark", 
        "comments": [
            "noooo", 
            "Great professor. Keeps class fun and interesting while displaying subject matter well. Plus he knows almost every language.", 
            "Tegmark is great! He really cares.", 
            "Physy 8033 with Professor Max Tegmark is incredible. He is truly a genius and a wonderful lecturer . I took this course for a Double Major in Physics. I studied Nuclear Science and Engineering also . For me is five stars .", 
            "Tegmark is adorable. He's the adorable dad that makes nerdy dad jokes. Also one of the better 8.02 professors.", 
            "This guy knows his stuff. Explains difficult subject matter in an easily digestible format. And if all that fails, he's extremely helpful during office hours Read his book Our Mathematical Universe, it's great", 
            "I'd hit it.", 
            "His boardwork was pretty messy, but that is my only complaint. And he found it funny when we mocked him."
        ], 
        "tags": {
            "Respected ": "2", 
            "Participation matters ": "1", 
            "Accessible outside class ": "1", 
            "Caring ": "1", 
            "Inspirational ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "619518": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=619518&showMyProfs=true", 
        "score": "4.4", 
        "name": "Caspar Hare", 
        "comments": [
            "Really good teaching style, so the lectures were always super interesting", 
            "He has a way of keeping the interest of the class, even if the material is rather boring. Very funny.", 
            "he loved what he was teaching, but it's difficult to stir any interest in listening when there are no tests or finals. papers dont require attention in lecture...or attendance for that matter. but yeah. he's hot.", 
            "Saw him teach at campus preview weekend. Seems knowledgable and seems to love his subject. Students seem to love looking at him more than learning the subject, however. For good reason!"
        ], 
        "tags": {}
    }, 
    "255193": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=255193&showMyProfs=true", 
        "score": "4.7", 
        "name": "Michael Artin", 
        "comments": [
            "An excellent teacher and very accessible outside class. He really knows his subject. His homework problems are hard, but quiz problems are easy. Would definitely recommend him.", 
            "Math 18.701 Algebra at MIT is Abstract Algebra For other courses. The course is The most difficult that i ever face it in my Life . I love Math but is Better to STudy in Advanced The semester before. Prof. Michael Artin is a Mathematical Genius this course covers so much Math Proofs and Topics . The Texbook is more easy to understand than The Class", 
            "Math 18.701-18.702 Algebra I and II is one of The most toughest course in Theorethical Mathematics at Massachussetts Institute of Technology. Is a nice course If you want to attend graduate School . I found this course difficult but Prof. Michael Artin is a genius and very humble. This course is difficult as Real Analysis is.", 
            "THE best math professor I've had here. I'm not very interested in pure math, but I loved this class and looked forward to every homework assignment. ;)", 
            "Michael Artin is one of the best professors I've had at MIT.", 
            "Artin's Algebra I and II classes were the best classes I have ever taken in my entire life! I definitely recommend him as a teacher, and the subject material is awesome as well.", 
            "Artin is awesome! He really gets into his subject.", 
            "Michael Artin is an amazing math professor - one of the rare breed who is both an outstanding research mathematician and a dedicated and talented teacher. His Algebra classes are difficult, but well worth taking.", 
            "Artin is GOD!", 
            "One of the most AMAZING teachers I've had the pleasure of encountering on my educational journey. I love you, A ;)", 
            "Definition of a great teacher. Also, a nice person and well-known for his math research. Humble too.", 
            "No Comments", 
            "Predominantly the most comprensive educator they have to offer in the math section. Perhaps the most polite and enthusiastic professor there is. A must have.", 
            "One of the best professors I have ever had. Brilliant. Enthusiastic about teaching and students' learning.", 
            "One of the best professors I've ever had.", 
            "No Comments"
        ], 
        "tags": {
            "Accessible outside class ": "2", 
            "Respected ": "3", 
            "Get ready to read ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "398125": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=398125&showMyProfs=true", 
        "score": "3.0", 
        "name": "John Belcher", 
        "comments": [
            "Prof. John Belcher is one of the Professors from Physics that Challenge you . He is a genius physicist but you need to spend to many hours in their class . Sofía", 
            "I don't know why there's so much hate, but Prof. Belcher is PHENOMENAL. I wasn't in his class, but I did go to Office Hours and asked him questions outside of class. He's a VERY KIND, CARING professor who actually DO want you to do well and is willing to accommodate any extenuating circumstances. A terrific human being and teacher.", 
            "John Belcher is one of the Greatest Professor of Physics at Massachusetts Institute of Technology. You come to MIT to be challenge . So many students cry because he failed me . He don't failed you. You failed yourself. If you're not ready for MIT go to University of Puerto Rico Mayagüez.", 
            "If you love Physics he will challenge you . So many students don't like him because no extra credit. He is a very brilliant professor and if you study superb hard you can earn a good grade. For Physics and Nuclear Science and Engineering majors he provided a very strong background in Physics. I like its class", 
            "I was .4 points from passing, and he failed me.", 
            "His lectures could be better but he's really helpful if you go to him for help outside of class. He'll spend a lot of his time figuring out what you don't understand and clarifying.", 
            "I thought he was great. Helpful, nice, really cares about teaching and helping you to learn. If people complain it's because they didn't want to take physics in the first place. Given that it's a requirement, you should do your best to get him.", 
            "ugh...teal", 
            "A nice guy! Liked his voice. The class is just so easy that I taught at times that he is just making it so easy.", 
            "Belcher rambles and is totally unhelpful. He's nice, but that doesn't mean much when you don't know jack about E&M.", 
            "Really old. He kind of wanders through his points and his speech. The class is two hours a day of bad."
        ], 
        "tags": {
            "Respected ": "2", 
            "Tough grader ": "3", 
            "Graded by few things ": "1", 
            "Test heavy ": "1", 
            "Lecture heavy ": "1", 
            "Caring ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "1698694": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1698694&showMyProfs=true", 
        "score": "4.8", 
        "name": "Ralph Selig", 
        "comments": [
            "He is a very solid Mathematician, he really has the highest regards for his students and the subject matter at Hand. You must take this guy.", 
            "Amazing Lectures and caring.", 
            "great professor. interesting and told great stories", 
            "Dr Selig is very clear and well organized. I would recommend him in a moment"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "121248": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121248&showMyProfs=true", 
        "score": "2.9", 
        "name": "Stephen Ward", 
        "comments": [
            "Obviously, like any MIT professor, he 'knows his stuff', he teaches at the top technical institute in the world. Here's a more helpful comment: don't expect to understand what he talks about in lecture unless you've had ample prior exposure to computation systems (i.e., not just building a computer and being a 1337 h4ck3r). You'll have work a lot.", 
            "Fun class! Take it. Do it!", 
            "Very intelligent. Sort of arrogant, but he knows his material very well.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "134587": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=134587&showMyProfs=true", 
        "score": "3.7", 
        "name": "Woodie Flowers", 
        "comments": [
            "Prof. Flowers exudes a wealth of experience and knowledge, but he is too condescending and full of himself to inspire in my opinion. Rather than provide constructive feedback his approach is one of criticism.", 
            "Woodie is supportive and helpful, and also inspires brilliance. He shows how much he enjoys product design and passes this enthusiasm to his students. One of the best classes in MIT, and a must for all course 2 students- this class rocked my world.", 
            "Flowers is a very experienced and talented lecturer. Take his class!"
        ], 
        "tags": {}
    }, 
    "812622": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=812622&showMyProfs=true", 
        "score": "4.1", 
        "name": "Rebecca Faery", 
        "comments": [
            "She is an incredible teacher. She can remember exactly what you wrote in your essays for years to come. Her suggestions are always kind yet critical.", 
            "Very Good.", 
            "No Comments", 
            "Ms. Faery was always sweet and helpful in class. She said hello when she passed me outside of class and made sure to follow up on everyone.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "2218090": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2218090&showMyProfs=true", 
        "score": "5.0", 
        "name": "Debayan Gupta", 
        "comments": [
            "Really good. Best CS professor", 
            "Best lectures I've had in a while. Really makes things interesting - eg., Learned about the Sator Square in Herculaneum during a dynamic programming lecture and how the wikipedia article on palindromes is wrong about Johnson coining the word. Very careful about grading, though he generally gives good grades. (You'd better get your math right!)", 
            "He's a cool prof, explains ideas well. The lectures always have fun stories and lots of historical background which I really liked (like he explained depth first search using the legend of the minotaur and Ariadne's thread and the etymology of the word \"clue\")", 
            "I literally cannot describe how cool this guy is. From granting a last-minute extension on an exam so I could take it another day to meeting with me to discuss test taking strategy... absolutely phenomenal help to me this semester. I did really badly on quiz 1 and almost dropped the class and he really gave me the confidence to keep going.", 
            "Just had our exams. I would nooot have passed without Prof. Gupta. CS is not my main area and most of the other people in class had a lot more coding experience so I was playing catch-up a lot of the time. He took a lot of time out and went over all the material with me in the weeks before the second quiz and final and really boosted my confidence."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Gives good feedback ": "4", 
            "Lots of homework ": "1", 
            "Accessible outside class ": "2", 
            "Caring ": "2", 
            "Amazing lectures ": "4", 
            "Inspirational ": "1"
        }
    }, 
    "565297": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=565297&showMyProfs=true", 
        "score": "2.0", 
        "name": "Keith Nelson", 
        "comments": [
            "His explanation for material is really bad. He copies from his notes (which isn't inherently bad) though he cannot justify certain statements at all. It makes things incredibly frustrating when he can't explain why what he's teaching is ture.", 
            "This guy trips over his own word. Writing sloppy and hard to read on the board. Just takes his notes and copies them on the board while he stutters and stammers.", 
            "Dry and boring", 
            "very good professor, difficult but helpful when needed. Difficult tests, but very good teacher and fair grader.", 
            "Can this guy really be a professor? He talks a mile a minute, but he doesn't seem to really know what he is talking about. Asks insanely hard test questions, gives very little partial credit, but if you ask him a comparable question during office hours, he has to refer to a book to find the answer."
        ], 
        "tags": {}
    }, 
    "334553": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=334553&showMyProfs=true", 
        "score": "4.9", 
        "name": "Denis Auroux", 
        "comments": [
            "He's great!", 
            "Easy voice to listen to. Usually take notes in his class because he goes out a easy pace .", 
            "Math 18.02 Multivariable Calculus (Calculus II ) at Massachusetts Institute of Technology is excellent with this Professor. Sadly he is at UC Berkeley. Explains extremely well, and Master the Material I love the physics applications in the Maxwell Equations. He covers Partial Differential Equations, the Laplacian , Fast Fourier transform.", 
            "Excellent Professor for Multivariable Calculus", 
            "This teacher taught me Calculus 3 via MIT OpenCourseware because my actual teacher can't teach.", 
            "The first time Math 18.02 L01 Multivariable Calculus is very difficult, but this professor explains good. It's class covers a lot Topological Questions, Maxwell Equations . Be aware Is a very tough grader. The exams are hard and is difficult to get an A .", 
            "I used the courseware to study ahead in multivariate calc to get ahead in class and he explains the concepts very clearly and concisely, without going off on tangents. If I could take him for this class, I would.", 
            "I took Math 18.02 Multivariable Calculus ( Calculus II) with this Professor. He explain everything clear and is very accesible outside of the Class . Is very Sad that he is in UC Berkeley. You learn so much with him. The Exams are though but you always interested in Mathematics with his Class .", 
            "He is just awesome!", 
            "Great lecturer!", 
            "He is too good.....I am seriously lucky to get his lectures on Multivariable Calculus.", 
            "The best teacher!", 
            "This dude is bloody amazing. My professor for this course was so bad, thankfully Prof Auroux was there to save my ass. Way better lectures.", 
            "Denis is an ENIGMA! His MIT OCW lectures are crystal clear and easy to follow, even here in a Maine high school. His explanation is thorough and understandable, and a HUGE plus is his weirdly great handwriting on his quite fancy chalkboard -- Everything is easily readable and his drawings and graphs are spot on. Too bad he's at UC Berkeley now.", 
            "BEST PROFESSOR", 
            "Fantastic professor. Explains things with great clarity and intuitiveness.", 
            "Really great professor!", 
            "Awesome! Learned a lot. Clear Lectures.", 
            "Best Multi-Var teacher in the world. Period.", 
            "Great prof. I watched the entire 18.02 Multivariable Calculus lecture series on MIT 's OCW, and Denis is definitely my favorite prof of all time. His level of understanding is apparent in his teaching delivery, and has transcended itself in such away to further facilitate my own level of understanding of this particular subject."
        ], 
        "tags": {
            "Respected ": "10", 
            "Gives good feedback ": "1", 
            "Tough grader ": "1", 
            "Beware of pop quizzes ": "1", 
            "Accessible outside class ": "1", 
            "Caring ": "2", 
            "Amazing lectures ": "10", 
            "Inspirational ": "8"
        }
    }, 
    "562630": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=562630&showMyProfs=true", 
        "score": "5.0", 
        "name": "Barton Zwiebach", 
        "comments": [
            "He inspired me to take physics again!", 
            "The perfect physics professor. A rather unique blend of knowledge with occasional jokes making the session worth its while. His lectures are lucid and should be suffice if you really pay attention. Heck he makes Quantum Mechanics look easy.", 
            "Barton has raised the pedagogy bar to levels I never knew existed in academia. He is by far the best professor I have ever had.", 
            "You can revamp 8.05 ten more times, but I WILL STILL LOVE YOU BARTY! Super clear and organized explanations that will make you believe physics is easy (although the tests may change your mind :) )", 
            "I LOVE YOU ZWIE-BIZZLE!!!", 
            "best physics prof ever!", 
            "i love barty!", 
            "best physics teacher ever, best accent ever."
        ], 
        "tags": {
            "Hilarious ": "2", 
            "Respected ": "1", 
            "Amazing lectures ": "2", 
            "Inspirational ": "3"
        }
    }, 
    "712903": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=712903&showMyProfs=true", 
        "score": "4.3", 
        "name": "Eric Von Hippel", 
        "comments": [
            "I think he did not personally like me, but I know he is a great prof. You should seek him out if you are at Sloan.", 
            "Took an innovation course with him a few years ago. His manner and appearance are a little unortodox, but he's extremely interesting and fun, and useful if the course is of interest to you.", 
            "Teaches many innovation classes, a fantastic professor."
        ], 
        "tags": {}
    }, 
    "144618": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=144618&showMyProfs=true", 
        "score": "3.2", 
        "name": "Cathy Drennan", 
        "comments": [
            "I really enjoy Chemistry lectures with her at Massachusetts Institute of Technology. Any Chemistry course with her is a blast", 
            "amazing and beautiful i love her", 
            "Dr. Drennan is an exquisite orator of incomparable beauty, who provides much insight into the chemical sciences.", 
            "People who have her for 5.111 in the spring, don't like her compared to Taylor. But after having Nelson, she is a baller. Her tests are straight-forward and simple. Thumbs up!", 
            "Not a good teacher. Thinks she is the bees knees and let's kids know it. Tries to be fun but fails. Not great at explaining key concepts or how to solve problems.", 
            "She is not a good lecturer, though she is energetic and tries to keep lectures interesting. Too many unnecessary/unhelpful tangents.", 
            "Not a very good lecturer. Spends too much of class on unrelated tangents and then expects you to have learned what she should have been talking about. Granted, the tangents are interesting, but will not help me pass chem.", 
            "No Comments", 
            "She gives very unclear explanations and has a poor understanding of the subject (practical protein crystallography). I didn't learn anything at all from her that I couldn't get by reading user manuals simple texts.", 
            "she's a really cool, fun professor..animated, interesting, plus her tests werent too bad", 
            "i found her to be really hard to talk to and unapproachable.", 
            "Very nice lady. Teaches well and keeps things organized.", 
            "No Comments", 
            "No Comments", 
            "If I ever have insomnia one night, I should invite Prof. Drennan over to give me a lecture. I'll be asleep in one minute. Drennan talks in a monotone, and did a horrible job of keeping my attention.", 
            "No Comments", 
            "Chemical Logic!!!!"
        ], 
        "tags": {
            "Lecture heavy ": "1", 
            "Inspirational ": "2", 
            "Caring ": "1", 
            "Amazing lectures ": "2"
        }
    }, 
    "141723": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=141723&showMyProfs=true", 
        "score": "4.0", 
        "name": "Thomas Allen", 
        "comments": [
            "None", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "655707": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=655707&showMyProfs=true", 
        "score": "4.5", 
        "name": "David Autor", 
        "comments": [
            "Econ 14.01 Principles of Microeconomics at Massachusetts Institute of Technology . The course is easy in compare with Engineering courses . Mathematical concepts are clear and understandable . David H Autors covers Game Theory in Microeconomics. You have to use Calculus, Statistics and Probability", 
            "Professor David H Autor from Economics at Massachusetts Institute of Technology excellent professor. Economics is a highly Quantitative Social Sciences. Is the Best for Intermediate Economics. If you can't handle go to University of Puerto Rico Río Piedras and Mayagüez mediocre economics courses .", 
            "Economics I thought that will be very boring, but was a truly nice experience. I took Intermediate Applied Microeconomics 14.03 and was a wonderful experience. But I major in Nuclear Science and Engineering and Physics. Economics is Quantitative Social Science. Massachusetts Institute of Technology is well known in Economics", 
            "Professor David H. Autor Department of Economics at Massachusetts Institute of Technology is a great professor . 14.01 Principles of Microeconomics is not an easy class . Involves a lot of Calculus, Statistics, even though game theory and behavioral economics are discussed. The class is very interesting.", 
            "Professor David Autor is truly inspirational. I studied Economics at Massachussetts Institute of Technology (MIT ) and i love The course and Its amazing lectures. The course is a little bit Hard but is very interesting have a lot of Mathematics and beautiful graphs. If you have The chance to take and Economics course with him . Take it", 
            "Is a Excelent professors in Economics . I like Econ 14.03 he explain extremely well The Microeconomic Theory and Public Policy. Study The course have a lot of Mathematics but is very interesting", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "2", 
            "Tough grader ": "2", 
            "Participation matters ": "2", 
            "Inspirational ": "6", 
            "Amazing lectures ": "4"
        }
    }, 
    "473441": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=473441&showMyProfs=true", 
        "score": "3.6", 
        "name": "Andrew Whittle", 
        "comments": [
            "Professor Whittle is the best I have ever met. His courses are just enjoyable. The logic and organization are clear, and the story engaging. This course provides generous amount of reading that directly pushes you to confront the original data where all the theories are based. Your understanding about soil will be brought to a whole new level.", 
            "Extremely intelligent with great knowledge of the material. Tough grader though..", 
            "", 
            "No Comments"
        ], 
        "tags": {
            "Gives good feedback ": "2", 
            "Tough grader ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "121150": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121150&showMyProfs=true", 
        "score": "4.3", 
        "name": "Alan Grodzinsky", 
        "comments": [
            "Professor Alan Grodzinsky is an excellent Professor of Biological Engineering and Mechanical Engineering at Massachusetts Institute of Technology. He put a lot of works but the course is very interesting. Cellular, Mechanics and Thermodynamics put your best efforts if you want to learn . The human body is Biochemical Reactor . Thermo means Heat.", 
            "Alan Grodzinsky the wonder Professor for Biological Engineering Courses . He explains extremely well especially Thermodynamics in Biological Engineering.", 
            "Amazing professor", 
            "Lively professor :) Fully loaded course though :(", 
            "Terrible. Has a pure hatred for all students.", 
            "Very good in class", 
            "quintessential nice guy, but the material is a bit too much for one course", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Test heavy ": "1", 
            "Respected ": "2", 
            "Tough grader ": "2", 
            "Lots of homework ": "1"
        }
    }, 
    "2065253": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2065253&showMyProfs=true", 
        "score": "4.0", 
        "name": "Jesse Thaler", 
        "comments": [
            "Thaler is a bit of a jerk. Sometimes he's nice, but it doesn't make up for the times he was insulting and disrespectful to students asking questions. He talked about attending Exeter Academy for high school, and his conduct indicates he has no understanding of students coming from different backgrounds.", 
            "8.033 was by far my most difficult class - took recitation with thaler, did well partly due to that.", 
            "He's extremely helpful!", 
            "Wonderful!"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Amazing lectures ": "1", 
            "Participation matters ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "121145": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121145&showMyProfs=true", 
        "score": "3.3", 
        "name": "Shafrira Goldwasser", 
        "comments": [
            "Great Prof!", 
            "competent and enthusiastic", 
            "BEST PROFESSOR I EVER HAD", 
            "No Comments", 
            "Dr. Shafi is a great teacher. She knows cryptography hands down. Would highly recommed taking her class. She was willing to assist on any questions I had for her. A++ teacher.", 
            "She was always very excited about what she was doing. She did tend to get lost sometimes, but there's something insanely hot about this gorgeous woman doing hard math barefoot while covered in chalk dust.", 
            "Is it just me, or does she remind you of that girl who talks really really fast in \"Real Genius\" (the one with Val Kilmer.) One time, Prof. Goldwasser was lecturing from the notes from some other professor and finished in half the time because she talks so fast.", 
            "TOTALLY HOT", 
            "Be very very scared. She's the one coming up with the encryption algorithms that protect your data, yet in her class, she gives the sense that she doesn't even know basic math. She was so confused that she helped people \"unlearn\" the material.", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "121246": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121246&showMyProfs=true", 
        "score": "3.3", 
        "name": "Joel Voldman", 
        "comments": [
            "Professor Voldman does not do a good job actually teaching material. He relies on gimmicks and random useless demos but does not actually teach anything. The labs for the class are not helpful for learning material. I did not feel like I have learned anything from the class. Tests are ridiculously hard and basically impossible.", 
            "Eloquent, good at what he does", 
            "Smart guy. Expect a lot of work. Generally friendly. Sometimes tries to make things seem simpler than they really are."
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Caring ": "1"
        }
    }, 
    "1025727": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1025727&showMyProfs=true", 
        "score": "4.0", 
        "name": "Bernd Surrow", 
        "comments": [
            "Prof. Surrow is extremely good teacher. Not only is he very kind and cares for his students, but is very clear and thorough in his presentations. He wrote up lecture notes for each class which were very helpful and always welcomed students to come by his office to ask questions. I would definitely recommend taking a class with him,especially 8.09!", 
            "Wonderful teacher!", 
            "Wonderful teacher! He cares! He is very thorough. He is very sincere.", 
            "he's nice, but he's boring, he gives the answers without explaining, and he rambles. he interrupts everything, group problems, experiments."
        ], 
        "tags": {}
    }, 
    "260763": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=260763&showMyProfs=true", 
        "score": "3.6", 
        "name": "Joseph Sadighi", 
        "comments": [
            "Terrible teacher. Confused himself and me during his lectures. Gets off topic all the time. Puts on the nice guy act but takes small things super personally. Favorite part of this class was seeing his little episodes of frustration when things weren't going the way he planned. Terrible teacher. Do NOT take, EVER! Ruined Chemistry for me.", 
            "A great professor. Truly cares about his students. His course is challenging but you will learn a lot from him. Does require outside work to get an A, but Sadighi will do everything in his power to help you get a grade that you are satisfied with.", 
            "He is so nice and truly cares about his students, but he is all over the place. If you are good at teaching yourself and just going to the teacher with extra questions then you will like his class, but if you need someone to completely teach you the concepts he is not your guy. He really does want students to succeed.", 
            "Dr Sadighi is a truly amazing professor. I had him for Organic Chemistry I. He truly believes in making his students succeed, so he is very accessible through office hours and online forums such as Piazza. However, his lectures may be difficult to follow (as he's an MIT grad), but if you ask questions, then you should be fine and learn a lot along", 
            "He's so patient and incredibly sweet! Also, he tells great jokes.", 
            "Really good about office hours & extra help. Lectures often seem disorganized, even with handouts.", 
            "poor guy NEVER sleeps, which doesn't help with the clarity of his lectures", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "1", 
            "Graded by few things ": "1", 
            "Lots of homework ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Lecture heavy ": "1", 
            "Accessible outside class ": "2", 
            "Caring ": "2", 
            "Get ready to read ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "121148": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121148&showMyProfs=true", 
        "score": "4.4", 
        "name": "Paul Gray", 
        "comments": [
            "His lectures were very clear. He was a very nice guy. I took his class a long time ago.", 
            "Great teacher. Very nice guy. MIT needs more profs like Paul Gray. Took his class (6.002) a long time ago.", 
            "When he lectured 6.002, we got sloppy handwritten lecture notes every day which were difficult to decipher. Then we'd get a full sheet of corrections from the previous lecture. He just stumbles and makes mistakes on a regular basis.", 
            "When I had him as a TA, I felt sorry for him that he was old but still a TA. Didn't realize that he'd founded the class, been president of MIT, had a building named after him. A really nice guy.", 
            "No Comments", 
            "mit needs more professors like professor gray. he's devoted, passionate, caring, and he knows what he's doing.", 
            "he's old but still good"
        ], 
        "tags": {
            "Respected ": "1"
        }
    }, 
    "562629": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=562629&showMyProfs=true", 
        "score": "5.0", 
        "name": "Robert Jaffe", 
        "comments": [
            "Awesome lecturer, sometimes goes into more detail than needed for questions but I liked that.", 
            "Best lecturer ever. Quantum Mechanics III.", 
            "Excellent instructor- lectures are interesting, well-presented, and informative. He takes his time to answer questions and to relate the subject matter to the bigger picture. Generally a really nice guy who clearly loves his subject.", 
            "Bob Jaffe is an excellent professor. His lectures are very clear -- very rigorous also. Sometimes the exams did not cover what was covered on HM's -- this I find a serious minus.", 
            "I left many lectures needing a cigarette. Not that I smoke - they were just that good! In addition, he almost threw the chalk at someone who asked a stupid question.", 
            "excellent lectures, clear explanations, genuine care for students, chiseled, manly looks."
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Gives good feedback ": "1", 
            "Caring ": "1"
        }
    }, 
    "81483": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=81483&showMyProfs=true", 
        "score": "4.0", 
        "name": "Donald Sadoway", 
        "comments": [
            "This professor really is a fun . Solid state Chemistry is very fun with him . If you will study chemical engineering as me . Definitely you love his lectures", 
            "For State Solid Chemistry he is The Best . I dont like The comparison with Harvard that he say thats The Unique place to learn that kind of Chemistry. I think he is a great Professor , but he is arrogant , but is funny . He Master The Material of the course that Its teaching .", 
            "I'm not an MIT graduate. Took the OCW recordings on YOUTUBE. Mr Sadoway could be Feynman's recincarnation. Inspirational, cool, relevant, respectable... he's got everything right ! Whoever aspires to teach, watch this dude & see how it's done !", 
            "He's incredibly egotistical and completely obsessed with Nobel prizes. He's an all right teacher but he seems to take pride in having low test averages.", 
            "I have only done the MIT OpenCourseware, but this class is fantastic. Sadoway is informative and interesting. If you like chemistry or physics, you'll love this class.", 
            "Not a bad class, but it can be hard and fast paced.", 
            "Sadoway is an MIT legend.", 
            "Great Professor, very helpful, always willing to listen and help students. Quite approachable for a man of his caliber.", 
            "it is the time for the next one he is so basic, it seems he is able to say nothing new, all the time he is repeating the same stuff, although the book is changed", 
            "My rating is purely based on his recorded (Fall 2004) lectures made available as part of MIT Open Course. I am amazed at how engaging these lectures were even when separated by time and space!", 
            "He's a little full of himself, but perhaps rightfully so. His notes are good, and I felt like i learned a good deal.", 
            "Just go to his last lecture...", 
            "Lame class.", 
            "No Comments", 
            "Sadoway is a ****, plain and simple. He's by far one of (if not the most) entertaining lecturers of the freshman core classes. Sadoway rules!", 
            "No Comments", 
            "Hot damn!", 
            "Sadoway is the best professor at this school, hands down. and he's hot.", 
            "slightly overrated class, a lot of slides are just for show, great teacher, interesting class for the most part. His grading is completely fair and had one of the best policies regarding partial credit", 
            "sadoway is funny, the material is very interesting (give him credit for choosing cool examples). however, there's no interaction in his class (no asking questions or anything..) and that's sad coz the pace of this class is really fast and some things remain cloudy."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Tough grader ": "1", 
            "Amazing lectures ": "1", 
            "Beware of pop quizzes ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "1084038": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1084038&showMyProfs=true", 
        "score": "2.6", 
        "name": "Steven Johnson", 
        "comments": [
            "Took 18.06 with him. This is the only class at MIT where I have felt that I have gained a deep intuitive understanding of the topic, and this is fully thanks to his lecturing style and problem sets.", 
            "I really enjoyed 18.06 with Professor Johnson. I thought his teaching style was very intuitive and deep. It is a difficult class but well worth it.", 
            "I took Math 18.06 Linear Algebra at Massachussetts Institute of Technology . This Professor covers topics extremely fast and don't teach you nothing . I have to Study hard to get a B- and I don't learn nothing of Linear Algebra. I only write my notes as fas as I can study from Gilbert Strang Book and Pass. Is better to take this course With other", 
            "Class goes too fast and covers too many topics.", 
            "Do yourself a huge favor and take 18.06 with someone else, this guy is awful"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Tough grader ": "3", 
            "Amazing lectures ": "1", 
            "Clear grading criteria ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "342455": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=342455&showMyProfs=true", 
        "score": "3.8", 
        "name": "John Bush", 
        "comments": [
            "Excellent Professor for Mathematics courses . He is a great lecturer. I like the courses.", 
            "A math teacher that will walk through the steps of problem solving, but not demonstrate significance of the mathematics at hand. Lots of equations with not much meaning. He is a really funny guy who can engage the audience.", 
            "He is a great and hilarious person, but as a teacher, one of the worst I've ever had in my life. He comes to class, writes down his notes on the board, he barely explains anything and then leaves. His midterms are ridiculously hard. Also, the class is accelerated which makes everything even worse.", 
            "Great notes.", 
            "Amazing professor. Cool guy.", 
            "No Comments", 
            "ONLY from his name u can understand his stupidity! bravo!!! CHANGE UR NAME MAN! PLEASE! ghs babis cosmmin", 
            "No Comments", 
            "This guy rocks!! Very laid back...."
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "2", 
            "Lots of homework ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "121092": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121092&showMyProfs=true", 
        "score": "4.3", 
        "name": "Anant Agarwal", 
        "comments": [
            "Incredible professor! Easy to follow, inspiring lectures.", 
            "The Best.", 
            "He is a great teacher. Very good to see his lectures.", 
            "He is gr8... Luv Him", 
            "one of the best teachers i have ever seen !!", 
            "excellant", 
            "Excellent Professor, Very clear and very practical, he does well at showing things in their nature state", 
            "He is my guru. The best teacher I have ever seen in my lyf. Love him.", 
            "Excellent understanding of the fundamental concepts.", 
            "Showed the way of life", 
            "pretty hard class. quite fast paced. nedd sound knowledge of physics and fundamental electrical circuits to get ahead.", 
            "need fist and second order DE to solve electronic components(RCL) and circuits", 
            "great.", 
            "great", 
            "Awesum methodology of teaching...", 
            "good motivational methods used. also not too emphasis on semiconductor physics , which is good given the course intended. one gets a good view of analysing circuits without getting into details of what is inside.", 
            "simple and clear", 
            "I view his lectures through MIT open course ware . I really like watching his lectures.", 
            "Really awesome. He gives us meaning and motivation to keep going, and keep learning. He gave me opportunities...", 
            "demo: dance with chain saw to add noise and eliminate it digital ckt o/p. simply gr8.... :)"
        ], 
        "tags": {
            "Hilarious ": "2", 
            "Accessible outside class ": "1", 
            "Inspirational ": "4", 
            "Respected ": "1", 
            "Amazing lectures ": "4"
        }
    }, 
    "669311": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=669311&showMyProfs=true", 
        "score": "1.0", 
        "name": "Bruno Coppi", 
        "comments": [
            "Profesor Bruno Coppi is the Worst Professor of the Physics Department at Massachusetts Institute of Technology. He focus so much on Abstract concepts not understand . The Exams are insane difficult.", 
            "Dreadful-auto correlation time of lecture is so short,the course really is diffusive.It would really help if Coppi actually prepared class.The tiresome old war stories dont help,either.It would also be good if Coppi got beyond regurgitating ancient linear theory.All told-it was a boring,mind-numbing course.", 
            "None"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Lecture heavy ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "247713": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=247713&showMyProfs=true", 
        "score": "4.0", 
        "name": "Steve Van Evera", 
        "comments": [
            "If you are interested in foreign policy, his lectures are fantastic. If not, you may want to find another CI-H. He is always willing to stick around after class for discussion and has the most fascinating stories. He is one of the most knowledgable and well-read people I have ever met.", 
            "Not the best. Class was pretty boring. Give 17.40 a miss.", 
            "He is really boring. He focuses on the most mundane details. The articles he assigns could put an insomniac to sleep. He makes me never want to take political science again, and I was extremely interested in it before. Don't take it.", 
            "LOVED his classes, interesting, and so clear.", 
            "Awesome", 
            "class was semi-boring. he has high respect for students and does a good job teaching, interesting topics, pretty good class, graded fairly", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Caring ": "1", 
            "Get ready to read ": "1"
        }
    }, 
    "121194": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121194&showMyProfs=true", 
        "score": "5.0", 
        "name": "Robert Miller", 
        "comments": [
            "This guy is AWESOME! Helpful, encouraging, and easy to talk to.", 
            "Tough grader, but fair. Very nice person.", 
            "Great teacher and great advisor"
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1", 
            "Group projects ": "1", 
            "Caring ": "1"
        }
    }, 
    "44544": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=44544&showMyProfs=true", 
        "score": "3.1", 
        "name": "Timothy Swager", 
        "comments": [
            "Lectures are clear and entertaining :)", 
            "I thought he was hilarious...even if he didn't throw bananas like Berkowski.", 
            "I hated the class (okay it's hard but I liked it when the other prof taught) however Swager is one of the nicest profs.", 
            "No Comments", 
            "The worst professor I've had here. He tries way too hard to make material confusing. Compared to most of the other organic chemistry faculty, he is worthless.", 
            "Very well taught class", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "121172": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121172&showMyProfs=true", 
        "score": "4.2", 
        "name": "Dina Katabi", 
        "comments": [
            "SHE IS MAJIC TOUCH", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "417691": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=417691&showMyProfs=true", 
        "score": "3.7", 
        "name": "Fred Harris", 
        "comments": [
            "Dr. Harris guest conducted a music festival, wherein I played jazz drums for his band. Knowing and respecting that Fred is a percussionist, he and I had creative differences, and his mistrust for my interpretations created some issues. He chopped my parts into overly simple, cheesy playing, and approached the free language of jazz restrictively.", 
            "No Comments", 
            "Fred rocks... just. rocks. He really cares about music and his students... he wants everyone to be the best they can be, but also respects life at MIT, and encourages music to be a good outlet for stress. Great guy! Great teacher!"
        ], 
        "tags": {}
    }, 
    "831180": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=831180&showMyProfs=true", 
        "score": "4.6", 
        "name": "Pablo Parrilo", 
        "comments": [
            "Pablo is a great teacher: very clear and continuously checks that everyone in the class is tracking. Fair warning though: Pablo's classes are great to take if you are interested in the material, but don't take them as \"easy\" classes, because you are going to be doing A LOT of learning.", 
            "OK prof, clear, but often runs overtime.", 
            "Not too easy, but a good prof.", 
            "great", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "677626": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=677626&showMyProfs=true", 
        "score": "4.5", 
        "name": "Pawan Sinha", 
        "comments": [
            "No Comments", 
            "Ajeet, you are a great professor. I never thought you would become such an accomplished professor. Ajeet man, you are Ajeet.", 
            "Sinha is one of the most amazing profs in AI and recognition. He's so helpful, the classes are pretty easy and he's always available. Plus he writes a nice recommendation letter. You just have to show you put effort into his class."
        ], 
        "tags": {}
    }, 
    "649764": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=649764&showMyProfs=true", 
        "score": "3.6", 
        "name": "Gigliola Staffilani", 
        "comments": [
            "I took Math 18.02 Multivariable Calculus with Prof. Giggiola Staffilani. Is awesome that she respect its students. The class is hard but if you do a great effort She motivates you. She include so much in the Syllabus and She knowns Math very well . Is a good experience. Math 18.02 Is the background for upcoming courses like 18.06 and 18.03 .", 
            "There's just something about her that really makes me respect her and admire her. 18.03 isn't the easiest, but I like her so going to lecture isn't too bad.", 
            "Her Italian accent kept me enthralled the whole time. Yes, also her class was quite interesting. But actually, great teacher", 
            "Generally straightforward class. Notes/lectures are sometimes a little jumbled and hard to read/understand. Easy-going though and very responsive to student's needs/complaints.", 
            "I have been to her office hours before and I felt belittled. I know I am not the only one to think so. Elizabeth Mann for 18.02 professor!", 
            "She is an amazing professor. Her lectures have everything written out nicely and her tests are incredibly straightforward, a rarity at MIT. She's very very helpful and actually has a sense of humor. I give her my highest recommendations."
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "1", 
            "Caring ": "2", 
            "Inspirational ": "2"
        }
    }, 
    "1834017": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1834017&showMyProfs=true", 
        "score": "4.9", 
        "name": "Christian Catalini", 
        "comments": [
            "great startups to work with", 
            "good startups in the class", 
            "Useful class", 
            "Wonderful class!"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Participation matters ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "799921": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=799921&showMyProfs=true", 
        "score": "4.8", 
        "name": "Graham Walker", 
        "comments": [
            "Bio 7.06 with Prof. Walker C Graham was a great experience. Biology is simple reading Well and do the Special Products. This Professor goces you a Solid preparation If you decide to STudy Chemistry (Course 5) or Biological Engineering (Course 20) I have a Major in Economics, Minor in Biology (Course 7) and other Minor in Course 18 (Mathematics)", 
            "Bio 7.212 Fundamentals of Biology is great but not Excelent. He gives a lot of material especially BioChemistry is covered in Freshman Biology . The course is vastly Theorethical but have some Quantitative in certain lectures. If you plan to Study Biology take it with Eric Lander .", 
            "Best prof ever!", 
            "Explains everything crystal clear!! Shares a lot of interesting facts and expts!! And brilliant anecdotes!! Overall, THE BEST!!", 
            "Awesome anecdotes, examples!! Best prof EVER!", 
            "Very good teacher! I Understand every single thing clearly! Explanation is very good. Overall, one of the best profs!", 
            "Best Prof! Very clear explanation! Helpful anecdotes and interesting facts! Teaching style is very good.", 
            "Great Professor, able to understand that the students are not graduate Students. Got an A in his class. Read the chapters!", 
            "very clear descriptions, infectious enthusiasm for the material"
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Group projects ": "2", 
            "Get ready to read ": "2", 
            "Amazing lectures ": "1"
        }
    }, 
    "345798": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=345798&showMyProfs=true", 
        "score": "4.5", 
        "name": "Saul Rappaport", 
        "comments": [
            "Profesor Saúl Rapaport is an excellent physics teacher have a nice teaching skills . The exams are not difficult and he is extremely well organized that is more easy to understand the material SN", 
            "Very clear with his examples and explanations really gives you the intuition of the subject matter. Also very available during office hours and will dedicate the time to making sure you understand the material.", 
            "Excellent blackboard technique, very well organized lectures, and great presentation skill. I'm glad I took special relativity with him!", 
            "Great guy, fun to learn from."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "186507": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=186507&showMyProfs=true", 
        "score": "4.8", 
        "name": "Eric Hudson", 
        "comments": [
            "Physy 8.02 Electricity and Magnetism is The most difficult Freshman course that you will take . If you will be a Mechanical Engineer, Physics or Nuclear Engineering he provides and Excelent Foundations to learn Physics . You have to Apply very Hard The Class is very conceptual and Mathematical.", 
            "he was a chill dude", 
            "pretty amazing teacher", 
            "Such an inspiring professor! I knew nothing in the subject before, but he taught so well. It was really sad when he left us. He would stay for extended office hours if needed and I learned a great amount. He was truly passionate about Physics and helping the students.", 
            "Amazing teacher. Made class and physics fun. Will miss him dearly next semester.", 
            "Amazing!", 
            "Absolutely brilliant professor. I have never met somebody more knowledgeable of physics, excepting perhaps professor Lewin.", 
            "great professor. one of the best.", 
            "Eric Hudson is the best teacher I've ever had. I'm so sad to not have him as an instructor anymore :(", 
            "Hudson is absolutely wonderful. Easily the best Professor I've had so far. Him teaching you E&M makes it so clear.", 
            "Eric is so sweet, and honestly excited about physics.", 
            "Very fun and enjoyable teacher", 
            "No Comments", 
            "No Comments", 
            "8.02T is easy."
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "2", 
            "Tough grader ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "362706": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=362706&showMyProfs=true", 
        "score": "4.7", 
        "name": "Jonathan Byrnes", 
        "comments": [
            "Supply chain case study class. The cases were well selected. Although requring some math (minimal compared to MIT norms), but by far this is one of the more real world applicable classes at MIT.", 
            "No Comments", 
            "byrnes runs the class very well. his class is one of the best that i took at MIT."
        ], 
        "tags": {}
    }, 
    "134389": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=134389&showMyProfs=true", 
        "score": "2.3", 
        "name": "Alar Toomre", 
        "comments": [
            "ok teacher", 
            "I took this class years ago. Toomre made it an interesting class and he is an enthusiastic lecturer. But there is some truth to the comments others have made about arrogance and hostility. I would advise students who take his classes to watch out.", 
            "Prof. Alar Toomre is one of the most brilliants minds at MIT. I took 18.03 Differential Equations and 18.04 Complex Variables. He focused on example from Physics. He really admired Srinivasa Ramanujan both are genius . He expand your horizons and how to understand Mathematics Sofía", 
            "I took math 18.03 Differential Equations with Prof. Alar Toomre the class is so vague and the Professor don't explain so well. I learn more in other Math Courses . I decided to majored in Finance and Mathematical Economics but this course was not helpful lack of Financial and Econ applications", 
            "I took 18.02 exactly 20 years ago from Prof. Toomre. I was just randomly browsing this site and searched for his name. Why did I search for his name? Because he is the single best teacher I ever had, anywhere. He is an inspiration. If you go to his class and open your mind he will make you smarter. You went to MIT to challenge yourself, didn't you?", 
            "Very easy professor! I absolutely loved this class! Very helpful, and final is optional if he likes you.", 
            "a self-righteous, pretentious, arrogant prof who thinks hes too good to teach you", 
            "Why does he use that cocky young janitor as his TA? And how come he didn't recognize the name Ted Kaczynski? Has he been kept incommunicado in an isolation chamber for the last two decades? And I, for one, am getting pretty sick of hearing about his bloody Fields Medal.", 
            "He acts exactly like he did in the documentary, \"Good Will Hunting\", a PBS paean to this tough but inspiring teacher. He just wants you to become the next Ramanujan even if he has to grind you into dust, for which you'll thank him later. He can't help it if he comes off like an insufferable toff by constantly waving that Fields Medal in your face.", 
            "The very best mathematics teacher I have ever encountered. Great examples, unending openess to students, friendly, thoughtful and well prepared", 
            "AT is certainly on the eccentric side, but I actually enjoyed his 18.03 lectures. Certainly the high energy was a plus when I showed up for lecture after an all-nigher for some other problem set.", 
            "HORRIBLE teacher.", 
            "At first I thought I didn't know what was going on because I was too stupid. Then I talked to someone who took a class with him 20 years ago and thought he was horrible and I knew it wasn't me.", 
            "No Comments", 
            "No Comments", 
            "everything has been said: toomre is a math wiz and thinks everyone's like him. he neglects the basis and jumps to (very) complex applications. he looks nice and cheerful, but becomes quite hostile when contradicted. pretty unhelpful in general.", 
            "his lectures are extremely esoteric..its overwhelming and hes not a good professor", 
            "Toomre is quite a character. If you really enjoy mathematics you will probably get more out of the lectures. For those of you who are just trying to pass the class (me), the lectures do not teach you the material. It is assumed you already know it. Nonetheless, he is still cheerful and entertaining.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "2", 
            "Tough grader ": "2", 
            "Amazing lectures ": "2", 
            "Inspirational ": "4"
        }
    }, 
    "433652": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=433652&showMyProfs=true", 
        "score": "4.3", 
        "name": "Jeremy Wolfe", 
        "comments": [
            "Psych 9.00 Fundamentals of Psychology at Massachussetts Institute of Technology with Prof. Jeremy Wolfe is a Good experience. You have to prepared to read and The Exams are not so Hard. He is Well Know in Course 9 Brain and Cognitive Sciences Department.", 
            "Psych 101 Intro to Psychology at Massachussetts Institute of Technology is amazing with Prof. Jeremy Wolfe really understand The Biology of The Brain. he is a great teacher you learn a lot.", 
            "MIT Open Courseware - superbly engaging and fun even on headphone!", 
            "Took his course through iTunesU- very, very good lecturer! Though I cannot say anything about the ease of his exams, he made lectures supremely interesting and easy to follow/ understand.", 
            "No Comments", 
            "Funny Jewish guy. He got me a job at a Harvard sleep research lab...can't complain much.", 
            "Wonderful lecturer!", 
            "very boring class if u already know a decent bit about psychology...in addition, he rambles on about stuff he likes and his lectures are not very focused...", 
            "No Comments", 
            "Good professor. Very entertaining and knowledgable", 
            "professor wolfe is awesome. his midterm and final are a story that you need to psychoanalyze using whatever you learned with the class. i definitely recommend taking intro psych with him if you are interested in the material. he's a great professor.", 
            "Awesome teacher. Cracks funny jokes in class, and teaches as if he's having a conversation instead of lecturing."
        ], 
        "tags": {
            "Hilarious ": "2", 
            "Amazing lectures ": "1", 
            "Get ready to read ": "2", 
            "Inspirational ": "1"
        }
    }, 
    "144653": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=144653&showMyProfs=true", 
        "score": "4.0", 
        "name": "Peter Fisher", 
        "comments": [
            "Peter FISHER is one of the best professor of physics at Massachusetts Institute of Technology. He is an excellent lecturer. Enjoyable and nice person . Teach you so much physics", 
            "He makes fun of us for respecting horrible professors. And makes fun of millenials. And most people in general. And is the only physicist I have ever met to like his family, and that is cute.", 
            "He made recetations really fun as he is really funny... He was also quite helpful in office hours, and was easily available to contact.", 
            "My god, when I took this class, I could barely stay awake. Lectures were absolutely horrible.. plus they had that german guy who knew three words of english.. Godd job MIT!!", 
            "Nice guy. Very Helpful."
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Lecture heavy ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "245687": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=245687&showMyProfs=true", 
        "score": "2.1", 
        "name": "Tom Greytak", 
        "comments": [
            "physics was very difficult course . But I enjoy it . He lectures very heavy but is the kind of challenge that you expect from Massachusetts Institute of Technology.", 
            "I love when Tom Greytak's undershirt shows under his carefully picked out blue oxford shirt. And of course, how could you not love \"good morning early risers\"", 
            "Patronizing, and throws in random math to make things look more spiffy", 
            ":-(", 
            "Very boring lecturer who makes the material hard to understand. The only reason to show up to class is for the PRS...which he is very bad at running. And he coughs into the microphone!!", 
            "No Comments", 
            "Dry style and approach to somewhat dry (in context of undergraduate physics curriculum) subject."
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Lecture heavy ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "251734": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=251734&showMyProfs=true", 
        "score": "4.3", 
        "name": "Andrew Lo", 
        "comments": [
            "Healthcare finance is a great course and Professor Andrew Lo makes it interesting by using various examples", 
            "Financial Markets one of The most imperativo al Courses from Finance (15-3) Curriculum with Andrew lo very Inspirational", 
            "When i took Fin 15.401 was called Finance Theory. He is funny and gives amazing lectures . The Exams are a little Hard but manageable. He gives an Excelent Foundation of Managerial and Corporate Finance . He leads the Laboratory for Financial Engineering thats awesome. Is a Finance Master mind", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "2", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "121166": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=121166&showMyProfs=true", 
        "score": "4.2", 
        "name": "Daniel Jackson", 
        "comments": [
            "Jackson's decent at teaching. He knows his stuff, and speaks well. Unfortunately, he rarely gets rigorous, even when the course material allows for it. 6.170 comes with a lot of projects that take a while, often left open-ended by design. His teaching style borders on high school-style, mandating attendance, and other hand-holding techniques.", 
            "Cool class on web dev. D-Jax made it even more cool", 
            "Teaches a very good course on software modeling using Alloy. Goes the extra mile...but by no means an easy course. expect to put in some long hours.", 
            "Crisp is the word -- I'm ridiculously intimidated by this man but he lectures really well.", 
            "Very knowledgable but sometimes confusing. Has a menacing english accent. Ran a very organized class.", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Lots of homework ": "1", 
            "Group projects ": "1", 
            "Participation matters ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "344295": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=344295&showMyProfs=true", 
        "score": "3.5", 
        "name": "Oral Buyukozturk", 
        "comments": [
            "he is a genius and most likely professor", 
            "He really should not be at a place like MIT. He is the most-unlike-MIT-professor guy.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "712896": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=712896&showMyProfs=true", 
        "score": "2.9", 
        "name": "George Apostolakis", 
        "comments": [
            "Great Professor in Engineering Systems Sofía N Smith PE", 
            "the very best professor i've ever had", 
            "I regret", 
            "Greatest professor to ever walk the earth. Phenomenal person. Loves to teach. I could take his class 24/7!!!", 
            "Words cannot express my distaste for this man's teaching skills and class. Horrible does not even come close...", 
            "He teaches graduate courses as if they are in grammar school.", 
            "No Comments", 
            "Professor doesn't care much if the students learn anything useful. He spends most time on his favorite topics(probability distributions) and no time of useful material (like CBA). One of the worst professors you can find.", 
            "Engineering Risk-Benefit Analysts professor. Good intentions, but a bit of a hard attitude."
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "712895": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=712895&showMyProfs=true", 
        "score": "2.2", 
        "name": "Edward Crawley", 
        "comments": [
            "Too much bragging about his past work very arrogant no practical application at all", 
            "Cocky and Unapproachable! It got very tiring to hear about his many patents and \"honors\"", 
            "many slides... very deep thoughts behind every single bullet point. One of the best classes I have taken. Have to agree that professor is arrogant (talent should have its privileges).", 
            "Terrible teacher. Arrogant, unwilling to compromise or flex to the needs of the class, bad homework, unclear, lousy examples, spends a lot of time on trivia, no practical knowledge.", 
            "great teacher, a great architect, a great engineer. One learns hugely in his classes.", 
            "Terrible and pompous. Spends way more time bragging about his accomplishments than teaching. His class is painful. I'm in it right now...", 
            "100+ slides each presentation, skips most, unclear, terrible homework assignments, useless."
        ], 
        "tags": {}
    }, 
    "1187925": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1187925&showMyProfs=true", 
        "score": "4.8", 
        "name": "Moe Win", 
        "comments": [
            "I think if there are lecture notes, it will be better to review and form a more systematic view of the content of this course.", 
            "Prof. Win is a great professor. The lecture covers not only wide topics of communication theory but also interesting scientific histories.", 
            "The class made me realize how deep communication theory is.", 
            "The lectures cover topics of communication and localization in a rigorous, yet informative manner.", 
            "Prof. Win is a great teacher. He explains the contents in a clear and insightful way. Besides the knowledge, he also focused on the methodology and philosophy behind the solution. I've been benefited a lot in his class.", 
            "I learned a lot useful things from statistics course taught by Prof. Win. He gives very clear lectures, and he is always nice and patient when we interact after class and during office hours. Another thing worth mentioning is that I get a lot of inspiration and encouragement from his own research experience in industry and academia he shared.", 
            "His lectures were very clear, thorough, and balanced among giving students a good sense of theory and fundamentals, real-life applications of topics, and examples of how to solve problems. And all the TAs are very patient and helpful. I would highly recommend take a class of this professor.", 
            "Great professor - really wants to make sure his students understand the material. Will take time during lecture to tell relevant stories - giving a much needed breaks from the dense technical material. He is also not a slave to the syllabus schedule, slowing down the class if it means students will understand the material better.", 
            "PROFESSOR WIN IS THE MAN", 
            "Professor Win is a great teacher. He knows what he is talking about and is able to very clearly convey the material. He is also very understanding and the class has been one of the best that I have taken at MIT.", 
            "He injects life into what is otherwise a very dry subject. The manner which his TAs comnits themselves to his class suggests that he is very well respected and a caring professor.", 
            "Prof. Win gave a great lecture. My favorite part is that Prof. Win has introduced many experiences of himself. I think those experiences and suggestions are precious for my future study.", 
            "He is a great professor and explains the contents in a clear and insightful way. All his lectures are very informative and clear.", 
            "Prof. Win is fantastic. Coming from a non-math/engineering background, I had to work harder than the average student in this class, but Prof. Win did a great job of making the material accessible/intuitive, and offered plenty of help outside of lectures. He genuinely cares about his students, absolutely recommended!", 
            "Great course on communication and localization theory, providing solid illustrations for the application of estimation and detection theory on system design. The materials are well organized.", 
            "Professor Moe Win's 16.S399 course had excellent lectures with comprehensive, technical information. I learned an extensive amount about localization theory and digital communication through the lectures and recommended reaching material. Professor Win's courses never disappoint if you are looking to gain greater technical depth!", 
            "This is an excellent course on communication and localization. It covers essential topics in this field, including modulation theory, spectral analysis, and fundamentals in radar systems, etc. The course is very well organized, and the teaching pace is just right. I learnt a lot from this course.", 
            "A great lecturer. Inspirational", 
            "Great Professor. Very organised and accessible outside the class. He is well prepared for his class and some of the proofs he present during class is super clever. Would highly recommend take a class of this professor.", 
            "This was a great course for students to learn statistics regardless of their academic major or amount of background with statistics (beginner or some experience). His lectures were very clear, thorough, and balanced among giving students a good sense of theory and fundamentals, real-life applications of topics, and examples of how to solve problems"
        ], 
        "tags": {
            "Respected ": "12", 
            "Gives good feedback ": "15", 
            "Test heavy ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Participation matters ": "2", 
            "Accessible outside class ": "5", 
            "Caring ": "16", 
            "Clear grading criteria ": "1", 
            "Hilarious ": "3", 
            "Inspirational ": "21", 
            "Amazing lectures ": "13"
        }
    }, 
    "409757": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=409757&showMyProfs=true", 
        "score": "4.7", 
        "name": "Peter Dourmashkin", 
        "comments": [
            "Great Professor. Gives a great introduction to Physics", 
            "Really nice guy who really cares about his students. He really knows how to teach the course, and the difference showed the one day we had a substitute. Definitely try to get in his section, it's worth having a 9am class, and that's really saying something.", 
            "Professor Dourmashkin exceeds expectations in every category as a teacher and a human being. He displayed a knowledge of physics unparalleled to almost any teacher I have ever had with any subject. He put in so much time and effort into helping us learn, which for a college professor is uncommon. Not only that but he cares about the students.", 
            "He's amazing.", 
            "Massachusetts Institute of Technology Physy 8.01 physics I was a truly experience . He help so much the student but the class is heavy", 
            "Physy 8.01 Classical Mechanics is one of The most amazing courses at Massachussetts Institute of Technology. The review lessons and extremely helpful . Physics is The most difficult course at The freshman year. He is Truly inspirational and pretty clear to understand. Help Students a lot. I took Physy 8.01 and 8.02 and was a amazing Experience .", 
            "Professor Peter Dourmashking is one of The Best Professors at Physics Department at Massachussetts Institute of Technology. I took 8.02 Electricity and Magnetism despiste The course is Hard he made so Easy to understand. He colaborates de with The students and The Class is truly inspirational. Helps a lot and have passion for teaching Physics .", 
            "Professor Peter Dourmashking is one of The Best Professors at Physics Department at Massachussetts Institute of Technology. I took 8.02 Electricity and Magnetism despiste The course is Hard he made so Easy to understand. Always collaborates with The students and The Class is truly inspirational. Helps a lot and have passion for teaching Physics .", 
            "One of the best teachers I have ever had. Smart, funny, personable, and knows how to connect material at different levels. Physics was made into a fun and interesting class.", 
            "Professor Dourmashkin is one of the best known and most respected names at MIT due to his dedication to both physics and his students. He seems to enjoy teaching introductory courses and works to ensure all students enjoy his lectures. The tests aren't that difficult, the teaching staff is very accessible, and overall this is a great class!!!!!!!!", 
            "MIT's best physics instructor currently", 
            "This guy is an awesome teacher, my favourite so far for me. His enthusiasm for the subject is very contagious. I literally run to do my homework immediately after his class. Mark you I'm not even in his class (not by choice), I just attend his review sessions which he gives at night. True dedication!", 
            "Very helpful", 
            "He is a very good professor. In the TEAL environment he is very helpful and makes sure to go around to all the groups and makes sure that everyone understands the topics. I really enjoyed his class.", 
            "He is a pretty good and helpful professor. Absolutely deserving of a raise", 
            "his review sessions are much more helpful than the actual classes, but he is a really good prof and he is really invested in his students. oh and one time i overslept and it was halfway into class (we had a quiz) and he let me take it into another room and have as much time as i needed.", 
            "the best", 
            "He's a great teacher. Class was hard but he did everything he possibly could to help us along", 
            "Great intro to physics prof. He is really dedicated to helping students.", 
            "He is so hot!!!!!!!"
        ], 
        "tags": {
            "Respected ": "8", 
            "Gives good feedback ": "6", 
            "Accessible outside class ": "1", 
            "Caring ": "4", 
            "Inspirational ": "5", 
            "Amazing lectures ": "3"
        }
    }, 
    "1139554": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1139554&showMyProfs=true", 
        "score": "4.0", 
        "name": "Alan Guth", 
        "comments": [
            "Guth's 8.07 is a great class. It can be quite challenging with unexpected spikes in difficulty and workload, but he is typically quite understanding and generous with both extensions and extra credit to compensate. Definitely worthwhile", 
            "A joke this professor is, and a joke his entire theory is. I shall never dare to visit a petty lecture of his again, for I value my sanity and moral values.", 
            "I took a physics course in Astrophysics at graduate level was very interesting . He is a great lecturer and he talked about Dark Matter, Anti Matter , Dark Energy and more depth concepts in cosmological physics.", 
            "The best prof I have this semester. Despite being a nominee for a Nobel Prize in Physics, he can still clearly communicate basic concepts", 
            "Very smart. Very helpful. Very nice."
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Respected ": "3", 
            "EXTRA CREDIT ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "1201822": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1201822&showMyProfs=true", 
        "score": "4.6", 
        "name": "Elizabeth Vogel-Taylor", 
        "comments": [
            "The best professor for Principles of Chemical Sciences 5.111 at Massachusetts Institute of Technology.", 
            "Excellent for Chemistry any course with her at Massachusetts Institute of Technology easy A+ . Sofía N Smith PE", 
            "Chem 5.111 is Principles of Chemical Sciences at Massachusetts Institute of Technology. The class is very interesting. She really cares about your learning chemistry. Is a difficult course but is beautiful connected with other sciences like biology, quantum mechanics, and the chemistry of the universe. Excellent Professor", 
            "she is the best", 
            "She actually cares about students", 
            "Dr. Taylor is an incredible teacher. As an instructor, she gets to focus all of her time on teaching, and it shows in her lectures. They were all very clear and well-organized, and therefore very easy to understand. She made me really enjoy organic chemistry.", 
            "this teacher is amazing!! Search for this video on youtube to watch a lecture of hers. (15. Valence bond theory and hybridization) she's really good", 
            "she is hot, and good", 
            "She is awesome. Her style of teaching is very good and easy to understand. The quality of teaching is excellent. Thanks a lot for such a nice effort.", 
            "She is OBSESSED with vitamin B12. She also just gives us cheap methods to find the information we're expected to know for the course, but doesn't impart any understanding at ALL.", 
            "Her lectures are very easy to understand. The notes she hands out are extremely helpful for p-sets and exams.", 
            "Dr. Taylor is wonderful. Her lecture notes were organized and understandable, and she is incredibly nice."
        ], 
        "tags": {
            "Respected ": "4", 
            "Gives good feedback ": "1", 
            "Amazing lectures ": "3", 
            "Caring ": "2", 
            "Inspirational ": "4"
        }
    }, 
    "800239": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=800239&showMyProfs=true", 
        "score": "4.7", 
        "name": "Gilbert Strang", 
        "comments": [
            "I really appreciate the time I study Linear Algebra. Never feel better about learning.", 
            "I watched his videos about linear algebra on YouTube because my linear algebra prof couldn't teach, and honestly, I am so thankful for this man's lectures! His videos helped me pick up my grade from a D to B in linear algebra. He is overall straight to the point, and goes slowly enough to make sure you understand the concepts.", 
            "Great professor. He picks perfect examples to teach the insight of linear algebra and matrix theory without getting too bogged down in calculations.", 
            "Fantastic dude.", 
            "Gil Strang is an absolute legend. Not much more to say.", 
            "Professor Strang is the best! He delivered his lectures with such clarity.", 
            "Very useful videos on the internet!!!", 
            "I took 18.06 Linear Algebra with Prof. Gil Strang . He focus its class on new problems, and Matrix Theory . A lot of Applications taught me to think 🤔 critically in Mathematics. He is very brilliant professor . Explains well all the Topics in Linear Algebra and Differential Equations Sofía", 
            "As an economist from 1970 i have valued and enjoyed learning all about matrifes. Thank you. A real inspiration to look for more and enjoy maths or math if you prefer.", 
            "an amazing professor", 
            "Very Good, i enjoyed his lectures for linear algebra, and they made me feel exited for it", 
            "The best professor for Linear Algebra at Massachusetts Institute of Technology. He gives a lot of applications", 
            "Really enjoyed his lectures!", 
            "This guy made me fall in love with Mathematics", 
            "A clear structure is missing. I used 18.06 as a refresher for a theory heavy course I took 20 years ago, and I didn't mind that he skips backwards and forwards, but he does. FYI - he states certain prereqs are optional, but uses examples from them at times (e.g. diff eqs), I had to refer to such background. Still - a nice guy, motivational.", 
            "Math 18.06 Linear Algebra is the most difficult course that I took . The Professor Gilbert Strang is excellent. He always invented new problems. He applies linear algebra to engineering, computer science, economics and finance . This course is very useful in Economics. The book is very hard and also the exams . For me is the best Proffessor at MIT", 
            "Gilbert Strang is not prepared for his lectures. He knows his stuff but he's not prepared for transferring his knowledge and the order of the meterial he wants to lecture. That's why he usually starts a sentence and modifies it many times while speaking. I rarely see him saying a sentence in a single take. He starts a sentence, pauses, restarts ..", 
            "I took Math 18.06 Linear Algebra with Prof. Gilbert Strang he explains extremely well and include many applications. The book is more difficult to understand but you learn mathematics with him. For People that majoring in Finance and Economics this class with him is a real solid choice. Look for Gil Strang when you enrolled for 18.06 Linear Algebra", 
            "awesome", 
            "Is The Best Professor for Linear Algebra especially to Engineering, Computer Science and Economics Applications . He explained very well but The Exams are extremely difficult . He loves Linear Algebra and he dont understimate The ability of the Student to learn Mathematics. I like The course so much i majored in Economics and was truly inspiration"
        ], 
        "tags": {
            "Respected ": "15", 
            "Gives good feedback ": "4", 
            "Tough grader ": "1", 
            "Accessible outside class ": "1", 
            "Lots of homework ": "1", 
            "Lecture heavy ": "1", 
            "Participation matters ": "2", 
            "Hilarious ": "3", 
            "Caring ": "6", 
            "Inspirational ": "22", 
            "Get ready to read ": "1", 
            "Amazing lectures ": "18"
        }
    }, 
    "367160": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=367160&showMyProfs=true", 
        "score": "2.8", 
        "name": "Shankar Raman", 
        "comments": [
            "Professor Raman is funny, enthusiastic, and always appears to be in a good mood. His class is interesting and light-hearted, though his quizzes are difficult and he is a tough grader on essays.", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "508978": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=508978&showMyProfs=true", 
        "score": "3.2", 
        "name": "Meg Jacobs", 
        "comments": [
            "What an arrogrant, uninformed, pain in the ass. Don't take a class with her if you can avoid it. She's utterly unhelpful and she doesn't know her subject area.", 
            "Awful. Mean. Condescending", 
            "Avoid. Terrible class all around.", 
            "All fluff. She makes amazing # of factual mistakes, running jokes with students. Arrogant also.", 
            "I had Prof. Jacobs at CMC. She is smart, nice and has great stories about American history that make for a very interesting class. She was my thesis advisor and was very helpful.", 
            "She is a beautiful nice teacher who is more beautiful and nice than your average teacher."
        ], 
        "tags": {}
    }, 
    "1134538": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1134538&showMyProfs=true", 
        "score": "4.7", 
        "name": "Tyler Jacks", 
        "comments": [
            "Very good at lecturing, although sometimes moves very quickly. Is open to questions and good at explaining things.", 
            "Great sense of humor, extremely knowledgeable, and adorable.", 
            "Nice to have a big name professor teaching this intro class. Shame that the teaching instructor she-who-shall-not-be-named ruined the class."
        ], 
        "tags": {}
    }, 
    "936817": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=936817&showMyProfs=true", 
        "score": "3.3", 
        "name": "Brian Subirana", 
        "comments": [
            "Let me be very clear, this is one of the best courses in breath in Big Data - seriously. Prof. Subirana takes a wide swath of fields and brings in domain experts (6+ profs) to analyze them at the frontier. For me, this was really introductory. I've taken advanced engin. courses in the space, yet this was the most complete for application + theory", 
            "Shameful exploitation of MIT students to advance own business interest in RFID. avoiding real issues, forgiving of non-originality.", 
            "He is a nice guy but rather tardy. Do not expect him to be punctual about anything."
        ], 
        "tags": {
            "Respected ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "141360": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=141360&showMyProfs=true", 
        "score": "2.4", 
        "name": "Alvin Kibel", 
        "comments": [
            "He is a pretty hard grader on essays. The class was at times very boring, but sometimes he did bring up interesting discussions. He goes off on tangents a lot and will bring up some controversial issues. He seems like a very intelligent man in the subject (Art of the Probable), but it took a lot for me to keep my eyes open during his lectures.", 
            "Horrible teacher. Class was incredibly boring and he just went off randomly and never inspired actual, meaningful discussion. Worst class I've taken at MIT.", 
            "Kibel is a very hard grader so be prepared to write good papers. The subject matter is pretty interesting and despite being critical of students during discussion, Kibel is a pretty good discussion leader.", 
            "Alvin Kibel is brilliant. He brings the world of poetry alive, and he invites you to join him. He won't pave the road for you or anything, but he wants you there if you earn it. So earn it, and you'll love his class.", 
            "he's very rude in class, picks on students,makes political and religious comment"
        ], 
        "tags": {}
    }, 
    "144127": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=144127&showMyProfs=true", 
        "score": "4.0", 
        "name": "Moungi Bawendi", 
        "comments": [
            "He gives amazing intuitions. A very good teacher overall.", 
            "This Professor is an Excellent Profesor for Thermodynamics in Chemistry . He teach you a lot and the exams are no difficult. Is a nice person and have great teach skills. I found the material of the class very interesting if you like to study .", 
            "The material is boring, but he's really good and he follows his lecture notes", 
            "Very clear lectures. He followed the standard 5.60 notes very closely.", 
            "boring class, but prof was fun", 
            "Made a boring class slightly more boring. Poor guy had nothing to work with.", 
            "Good lecture notes, terrible lecture!"
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Respected ": "2", 
            "Lecture heavy ": "1", 
            "Amazing lectures ": "2"
        }
    }, 
    "702502": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=702502&showMyProfs=true", 
        "score": "5.0", 
        "name": "Igor Pak", 
        "comments": [
            "It's obvious that Professor Pak knows his stuff. His lectures are very useful. I didn't really have to consult the textbook while doing homework, which is very rare for a math class in my experience. Same could be said for exams. I didn't really need to do much outside studying other than reviewing the homework and lecture notes. He also has humor.", 
            "deserves tenure!", 
            "No Comments"
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "95063": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=95063&showMyProfs=true", 
        "score": "3.0", 
        "name": "Albert Meyer", 
        "comments": [
            "Boring lecture videos. Gives ambiguous questions. Course could be more structured and more formal. Comes to our table, does not look at our response, starts 'lecture' on why we must come to class prepared.", 
            "The class is a flipped classroom style, so the professor doesn't really matter. He occasionally appeared while our group was working and gave vague feedback that left us more confused. Outside of the classroom, he was horribly uncooperative. He changed course policies frequently and never had a helpful response when students asked questions.", 
            "great Professor he allows his students to share and receive much needed information. Loved him", 
            "No Comments", 
            "too easy.", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Tough grader ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Participation matters ": "1", 
            "Get ready to read ": "1"
        }
    }, 
    "631540": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=631540&showMyProfs=true", 
        "score": "4.1", 
        "name": "Junot Diaz", 
        "comments": [
            "Great", 
            "Overall good class. I would recommend", 
            "Good Class!!", 
            "Junot is one of the best teachers ever! The class has great discussions and he creates an environment in which everyone is respected and encouraged to contribute. He's hilarious and knowledgable. I learned a lot about writing and wish i could take another class with him.", 
            "Junot is wonderful. He is one of the few professors I've seen here who truly cares about his student's success. Junot is brilliant, and insists that his students create their own brilliance. His class is fun, and helpful, and a breath of fresh air from the dullness that is usually MIT."
        ], 
        "tags": {}
    }, 
    "125151": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=125151&showMyProfs=true", 
        "score": "4.4", 
        "name": "Arthur Mattuck", 
        "comments": [
            "I took classes with Professor Mattuck years ago. He puts great preparation into teaching classes. A wonderful and inspirational professor.", 
            "He is a great lecturer, but has the capacity to be extremely disrespectful and outright mean to students. Thankfully his textbook is sufficient to learn the material thoroughly", 
            "Professor Arthur Mattuck is one of the most respected professor at Massachusetts Institute of Technology. Ordinary Differential Equations deals with Euler Equation, Linear Algebra, applications in Engineering, Chemistry, Physics. The book Linear Algebra and Differential Equations is an excellent book . No math courses are piece of cake.", 
            "Math 18.03 Differential Equations at Massachusetts Institute of Technology with Professor Arthur P Mattuck is a solid choice . He covers a lot of Matherial Complex numbers , Eigenvectors, EigenValues, Partial Differential Equations. Applications to Engineering,Physics and Chemistry. Is the most difficult course for every engineer. Excellent", 
            "Math 18.03 Differential Equations with Professor Arthur P Mattuck is one of the best of Mathematics Department. The class is challenging he cover Fast Fourier series transform, Eigenvectors, Eigen Values . How ODES apply to engineering and sciences. He is so good that one friend from a mediocre UPR Mayagüez Can't pass its first OCW Exam", 
            "I took Math 18.100 Real Analysis at Massachusetts Institute of Technology. I do my bachelor in Nuclear Science and Engineering(22), Physics and Chemical Engineering I love all the Theorems and his is a genius", 
            "Best prof, hands down!", 
            "Math 18.03 Ordinary Differential Equations is one the most difficult courses that you ever faced in your Life. The Class Covers Fourier series, complex Exponentials, linear algebra topics, and a lot of Engineering applications. The Professor is very helpful and funny. The course don't include economics or finance application. exams are superb hard.", 
            "I was majored in Economics and Mathematics I took Math 18.100A Real Analysis he is an excellent Professor . The class is very though . He is very accesible and incredible person . The Exams are very though but prepares you For Math 18.701 Algebra .", 
            "Math 18100A Real Analysis is one of The most difficult Courses at Massachussetts Institute of Technology. Is Mathematical logic thinking . Prof Arthur Mattuck is an excellent Professor and Its book in Real Analysis is a must have", 
            "Math 18.02 Multivariable Calculus at Massachussetts Institute of Technology was and Extraordinay Experience. Prof. Arthur P Mattuck teach you how to think versus memorize formulas. This is The Best Professor of Mathematics at Massachussetts Institute of Technology. He Includes Partial Differential Equations and linear Algebra very useful .", 
            "Is The Best Professor for Differential Equations", 
            "Mattuck was probably the most accessible professor when I attended MIT, his door was always open and I soon found no embarrassment at asking any questions at all, moreover he offered cogent explanations in simple to understand terms. I would stop by with questions from other courses and he always obliged. I wish every professor was half as good.", 
            "Great professor. I'm 15 and currently learning his course on Differential Equations from OCW, and he's brilliant. Really explains the topics clearly and makes it easy to understand.", 
            "For math professors, he's about as good as it gets. Its refreshing how he doesnt bog the ideas down with mathematical jargon, and instead presents the main ideas in layman's terms, allowing the students to focus on the actual math.", 
            "Mummbly and rambling", 
            "absolutely BRILLIANT!", 
            "Love this guy, all the way from University of Houston!", 
            "I HAVE NEVER GONE TO MITNOR PLAN ON DOING SO BUT I MUST ADMIT HE WRITES VERY CLEAR AND HIS EXPLANATIONS ARE THOROUGH", 
            "I attended the equivalent of 18.03 at UBC in Canada and watched Dr. Mattuck on iTunes U to learn the course. He simplifies everything so clearly that I went from 40% to 100% between two midterms without going to my actual class. Give this man a medal!!!"
        ], 
        "tags": {
            "Respected ": "8", 
            "Tough grader ": "8", 
            "Test heavy ": "1", 
            "Accessible outside class ": "1", 
            "Caring ": "1", 
            "Inspirational ": "9", 
            "Amazing lectures ": "2"
        }
    }, 
    "1103018": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1103018&showMyProfs=true", 
        "score": "4.8", 
        "name": "Hazel Sive", 
        "comments": [
            "I learned bundles of intellect from her fave professor ever!!!", 
            "She's really enthusiastic about teaching and biology, which makes the class so much more interesting. Plus, she really cares about the students, and is just a fun person.", 
            "Wonderful professor. Kept us engaged with little quiz/prize interactions, used relevant modern examples related to concepts. Also has great blackboard technique and clear writing. Exams were long, but that's to be expected within the department.", 
            "Distracting and grumpy, but very good on the blackboard and well prepared.", 
            "AMAZING PROFESSOR! Lectures are comprehensive, with applications to modern experimental biology techniques. Made me want to switch majors."
        ], 
        "tags": {
            "Respected ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "1259688": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1259688&showMyProfs=true", 
        "score": "3.9", 
        "name": "Ben Brubaker", 
        "comments": [
            "Prof. Benjamín Brubaker is a great Proffesor for Math 18.01 . The Exams are though and so much homework", 
            "Wonderful lecturer!", 
            "", 
            "Amusing lectures, adorable man, tough exams."
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "395136": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=395136&showMyProfs=true", 
        "score": "2.2", 
        "name": "Janet Schrenk", 
        "comments": [
            "All I want to say is that she wants people to understand the material not memorize and that's why the class is hard. If you really like chemistry and some challenge, you will like her class. If you are doing well in her class, you are above average. (she is a great professor to get to know and use her tutoring hours-she is very helpful!)", 
            "I feel sorry to take chemistry class with her. It seems that UMASS hires the worst teachers ever. The connect homework is very hard. I barely see her solving connect problems. I do not understand a lot of things. I am sad. I tried to google some connect questions, but a lot of them don't make any sense. I feel sad being in her class.", 
            "Here's the thing, Dr. Schrenk is not too bad if you show that you care about learning and are friendly with her. Academically, she certainly knows her chemistry very well, but it seems you have to know everything before taking her class to get good grades. I found her grading and quiz material unfair at times. Waaaaay too much homework!!", 
            "She told us at beginning of the semester, day 1, that if you didn't already take chem 1 or an equivalent chem course in hs, you would have to struggle to achieve 70s on her quizzes and need 80s on hw to PASS, even though she knows you need a 65 to get credit. Doesn't answer questions when she asks if people have any before quizzes. Don't take.", 
            "Worst chemistry professor I have ever had. Goes over topics in the homework that have not been covered in class. She will explain them the day after it is due. Quizzes are unforgiving and has many surprise questions from previous chapters. Lectures are terribly boring and are all worthless power points.", 
            "does not explain concepts well, doesn't go over material before quizzes although they are for the most part fair, assigns homework on material not covered yet", 
            "To me, she seemed like a good prof. if you showed interest. Does assign a lot of work and does not scale. But overall I learned a lot and if you put the time in and go to her for help. She'll do anything to help you pass. She even stayed up late emailing me helping me with the homework before the test and she is always there to help whoever asks", 
            "She's a nice person and interesting to talk to. Her Quizzes are poorly worded and are impossible to prepare for. She doesn't warn students for what to study. I recommend all students studying every form of conversion and make sure to read word for word every part of the text. Her notes in class are useless along with her lecture.", 
            "A very difficult professor who doesn't know how to teach. She's not mean but most of the class will struggle to pass. Ruined chem for me got a C after getting an A in Chem I. I'm at UML as well", 
            "Had her for chem 2 at umass lowell. Found her class extremely difficult. I may be going out on a limb by saying that her teaching plan from MIT is no different than the one here because this class is ridiculous. I spent 10 hours a week at least on the homeworks and still passed only 3-4 quizzes. Learned a lot but quizzes are way too hard. No scale.", 
            "Now she is at UMass Lowell and her homework assignments are still way too long, her test averages are still way too low, and her lectures are still terrible. She teaches as if the prerequisite for Chemistry II is Chemistry II itself...every step of the way she talks down to the class as if we were supposed to already have known everything.", 
            "stinks", 
            "Inconsiderate. Extremely inconsiderate.", 
            "Needs to take a little more time getting dressed in the morning. My saving grace in this class were my TAs. I think this class is Janets revenge against the world.", 
            "No Comments", 
            "Homework assignments are way way tooo long, she doesn't post practice test answers or grades online and is the worst lecturer. It saddens me to pay $40K a year for this.", 
            "I agree so much w/the comment about patronizing comments and tests. There is no way of guessing at this woman and she doesn't curve to a B. Yay! Let's fail half the class!", 
            "A strange paradox of teaching styles, especially for a required class. She delivers lectures as if students were in middle school, asking patronizing rhetorical questions, yet exams and homework are long, poorly worded and harshly graded. C- test averages", 
            "Hard grader (way too hard for a GIR!), doesn't seem to like teaching in new ways.", 
            "No Comments"
        ], 
        "tags": {
            "Lots of homework ": "2", 
            "Tough grader ": "2", 
            "Caring ": "1"
        }
    }
}