{
    "742768": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=742768&showMyProfs=true", 
        "score": "4.7", 
        "name": "Teresa Pica", 
        "comments": [
            "Excellent Dr. Pica", 
            "She is just perfect.Strongly recommended. You will not regret taking her class. I love her !", 
            "Great Professor", 
            "If you fulfill the requirements, you'll get an 'A'.", 
            "Very good", 
            "I took several language acquisition courses from her and she is great. Years later, she and I still keep in touch."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1"
        }
    }, 
    "925159": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=925159&showMyProfs=true", 
        "score": "4.9", 
        "name": "Damon Freeman", 
        "comments": [
            "Great Professor...Learned Alot...Wish I could have taken hom more. Very Smart... Class was always amazing! Learned so much...Has alot to offer his students!", 
            "Dynamic, sincere, thoughtful. I learned a ton in this class and much of it was the reading but a ton more was the teacher and class discussion. He is a gem, SP2 is lucky to have him.", 
            "awesome teacher, always gets students to think critically", 
            "Great professor and good looking too!", 
            "No Comments", 
            "Great professor, offers great thought-provoking examples to the class. Not that bad to look at, either!", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "742766": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=742766&showMyProfs=true", 
        "score": "3.8", 
        "name": "Eric Nodler", 
        "comments": [
            "I enjoy lecture and teacher very much. From Thailand", 
            "Terrible.", 
            "", 
            "Great Professor! I learned so much that I couldn't wait for class each week.", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "562355": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=562355&showMyProfs=true", 
        "score": "5.0", 
        "name": "Julie Schneider", 
        "comments": [
            "She is a great educator", 
            "Best. Teacher. Ever. Made me love everyday!", 
            "Julie is the most accesible department head I've ever met. she always has the time for me, and worked incredibly hard to get me all the wall space i ever needed when it was show time. a wonderful teacher and a wonderful person.", 
            "I miss the days when I could just walk into her office and plop down in a chair for a chat. She was one of my most caring professors at PENN. I was lucky enough to have her for both Painting I and senior thesis.", 
            "One of the best teachers I had at Penn. Julie is an incredible undergradate chair, artist, and mentor. She takes all her students seriously and truly is a wonderful person. I'll alway cherish my learning experiences from this person."
        ], 
        "tags": {
            "Inspirational ": "1"
        }
    }, 
    "466534": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=466534&showMyProfs=true", 
        "score": "3.0", 
        "name": "Marie Gottschalk", 
        "comments": [
            "Absolutely a nightmare... her class was extremely disorganized. The course packet is about 2500 pages long, with most of the readings in articles. Became nearly impossible to keep track of all the articles that you have to read. Even worse, so many of the readings, often the long ones, were irrelevant to what was covered. TA was great", 
            "Very interesting class, very engaged professor and high interest in teaching people to think.", 
            "I loved this class and the prof. Expanded my mind.", 
            "worst prof i've ever had.", 
            "Takes time with students and explains things thoroughly.", 
            "A former journalist that should have kept away from serious thinkers."
        ], 
        "tags": {
            "Lecture heavy ": "1", 
            "Tough grader ": "1", 
            "Participation matters ": "1", 
            "Get ready to read ": "2", 
            "Inspirational ": "1"
        }
    }, 
    "923578": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=923578&showMyProfs=true", 
        "score": "5.0", 
        "name": "Peter Davies", 
        "comments": [
            "Best professor I have had yet. Very understanding of the struggles of school, but also encourages people to try in his class. Cares so much about his students and pushes us to learn. I loved this class so much, can't believe I'll miss Thermo!", 
            "Took intro to materials with Professor Davies; course was awesome, entertaining and interesting. Highly recommended to anyone wanting to learn more about MSE. Great professor!", 
            "A great professor. I truly enjoyed my time and learned a lot of things!", 
            "Professor Davies is an amazing professor who truly wants students to learn; best teacher I've had in my major, if not at this entire university.", 
            "The best professor I've had at Penn so far--and one of the best teacher's I've ever had.", 
            "Davies is engaging, funny, organized and entertaining uses excellent examples to engage his students; one of the best teachers on campus. Take his course if you get the chance.", 
            "I took this course last semester; I have never had a better teacher . Dr. Davies cares so much about his students: awesome", 
            "Took thermo this spring, Dr. Davies spent many extra hours helping me understand concepts. Really cares about students, best professor I've had so far.", 
            "Really good notes and explanations; actually makes Thermodynamics understandable. Entertaining professor who cares about students and lectures - best I've had this year.", 
            "Chemistry is not my favorite subject, but this professor is. He makes things clear and connects to interesting examples in technology. Dr. Davies is by far my best prof.", 
            "All these comments are true, great professor and funny. Kept my interest in a course that was hard for me.", 
            "Amazing lecturer - relates basic chem to emerging technology, great at keeping our interest.", 
            "Unbelievable at making incomprehensible material understandable and clear. Best prof in the school, funny too.", 
            "Great jokes, very funny. Connects basic chem to real applications, love this professor", 
            "Sooo helpful in office hours and clear in lectures. Of all my engineering profs he is the absolute best", 
            "Currently taking frosh chem; all comments are true. Fantastic prof, really funny but jokes have a purpose - they help you learn. Best of all my current teachers", 
            "These ratings are true - clarity to the max and very funny.", 
            "Amazing at explaining difficult concepts - thermo rocks when Davies is teaching it.", 
            "Funny very clear explanations - you've got to take one of his classes", 
            "Amazing engineering prof; connects what can be boring material to interesting applications. Very funny - go to his lectures and sit at the front."
        ], 
        "tags": {
            "Hilarious ": "4", 
            "Respected ": "7", 
            "Inspirational ": "3", 
            "Caring ": "7", 
            "Amazing lectures ": "3"
        }
    }, 
    "167424": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=167424&showMyProfs=true", 
        "score": "3.5", 
        "name": "Haimanti Banerjee", 
        "comments": [
            "She is nice but a terrible teacher. Don't take her. There is only four parts to the grading scale she uses, so if you do poorly on one thing you're kind of screwed. Her tests are really hard and don't really match with what she reviews. She is very unenthusiastic and doesn't enjoy explaining or helping her students when they have questions.", 
            "Absolutely delightful! An incredibly kind person with a talent for engaging her students. She makes Bengali a real joy, and I love her class! =)", 
            "Have enjoyed her class tremendously. Motivated students and managed to teach grammar in interseting ways.", 
            "The professor might be a nice lady, but she isn't the greatest teacher. She's tough on the students, doesn't give sufficient time or help on assignments, and has a habit of rescheduling class that aren't always convenient for the students."
        ], 
        "tags": {
            "Test heavy ": "1", 
            "Tough grader ": "1", 
            "Lecture heavy ": "1"
        }
    }, 
    "1163410": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1163410&showMyProfs=true", 
        "score": "3.4", 
        "name": "Freda Adler", 
        "comments": [
            "I enjoyed her class. She does do pop quizzes, though.", 
            "..", 
            "Lectures could be tedious but overall Professor Adler is an interesting person with a lot of experience in the field. Easy and fair if you attend lectures.", 
            "", 
            "HORRIBLE lecturer. Literally could not listen to her babble without wanting to commit suicide. Never take her class, you won't get anything out of it."
        ], 
        "tags": {}
    }, 
    "1299150": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1299150&showMyProfs=true", 
        "score": "4.2", 
        "name": "Mike Kaplan", 
        "comments": [
            "Amazing professor, and is one of the smartest people I have ever met. If I could get taught by him forever that would be the best thing ever. Amazing prof overall.", 
            "AWESOME", 
            "Not knowledgeable. Teaches the class as if it were electrophysiology.", 
            "The man. Seriously.", 
            "best prof ever!!!!!!!! he even sang one of the lecs and played keyboard! and he's eye candy!"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "394608": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=394608&showMyProfs=true", 
        "score": "4.7", 
        "name": "Avery Goldstein", 
        "comments": [
            "One of the best lecturers I have ever had class with. Clear, concise, and very interesting. One of the best classes I've ever had. Information is useful, interesting, and presented in an engaging fashion. A must-take (along with his other classes) for anyone interested in international affairs (even out of major).", 
            "Amazing teacher. Makes Chinese history and domestic politics sound absolutely fascinating. Lectures on Chinese foreign policies are phenomenal.", 
            "This prof. is definitely the most interesting and engaging one I've had so far at Penn. His lectures are clear and to the point. In his office hours, he will always make you think beyond the basics and make you analyze every situation critically.", 
            "This prof. is definitely the most interesting and engaging one I've had so far at Penn. His lectures are clear and to the point. In his office hours, he will always make you think beyond the basics and make you analyze every situation critically.", 
            "Attendance not strictly mandatory, but HIGHLY recommended.", 
            "An awesome professor! One of my absolute favorites at Penn. Lectures are straight forward and clear. Funny and keeps class interesting!", 
            "very interesting. will spark interest", 
            "Fantastic speaker and inspiring lectures.", 
            "Great sense of humor", 
            "No Comments", 
            "great lectures", 
            "He's amazing. Had him last semester - most I've ever learned in a course. Funny and attractive too."
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "689525": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=689525&showMyProfs=true", 
        "score": "4.1", 
        "name": "Jean Gallier", 
        "comments": [
            "I cannot even begin to describe how cool and amazing this professor is. I had him 3 and a half years ago and am only writing this now because he was that good. Only CIS class I actually attended in person. Super cool, genuine, nice guy. Love him", 
            "Absolutely useless as a professor. He took seemingly trivial concepts that are fundamental to computer science and made them incomprehensible. I had to go to extra readings to learn nearly all of the material", 
            "He was a really great professor! :) highly recomended", 
            "Good class!", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1438988": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1438988&showMyProfs=true", 
        "score": "3.3", 
        "name": "Gomaa Omar", 
        "comments": [
            "Great professor who cares about his students. If you memorize everything from the note packets he gives in class, you can get a very high score. Out of the four midterms, only one was especially hard, covering material we didn't cover in class (but he curved the class to account for this). Easy A", 
            "Gomaa is a really entertaining lecturer, and I found that the more attention I paid the more the material stuck in my head (even as a firm social sciences student). Don't take if you're socially anxious - he WILL make you engage with the class. The tests are absolutely insane.", 
            "Lectures were interesting and entertaining. As a social science major, this is the first hard science class that I've ever enjoyed. It's nothing but memorization and the tests are easy as long as you study.", 
            "Professor is disorganized, unprofessional, and acts inappropriately toward women in class.", 
            "Unprofessional. Prints his slide deck but slides are out of order, the content is different, etc. Even exams are poorly constructed - entire groups of questions are duplicates. These are mistakes that can easily be fixed but he seem to be unconcerned with such details. His conduct in class is also immature.", 
            "I love Omar! Great class, funny, organized, informative. Exams tedious and very long, asked for every little bit of minutia he mentioned in lecture.", 
            "Classes were informative. Professor very nice. Only 3 tests. no other work required. But tests, although multiple choice, VERY EXTENSIVE. Some information asked not on slides."
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Graded by few things ": "1", 
            "Test heavy ": "2", 
            "Skip class? You won't pass. ": "2", 
            "Hilarious ": "1", 
            "Amazing lectures ": "2", 
            "Inspirational ": "2"
        }
    }, 
    "936309": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=936309&showMyProfs=true", 
        "score": "2.4", 
        "name": "Stephen Shatz", 
        "comments": [
            "Excellent", 
            "He's tough. He'll \"yell\" at students for being wrong, but the right answer really sticks with the students because of that. The math part of the class was boring and largely unrelated to the homework, but the reason I didn't skip lecture was to hear his wild stories-- he has a tendency to go off on long, fascinating tangents.", 
            "Absolutely the worst professor. Don't ask any questions in his class, or get ready to be yelled at you. He can get easily offended for anything. Not very clear in presenting the material, and intentionally makes it very confusing for students to understand.", 
            "The very absolute best teacher I have ever had (or seen) in my entire life. He challenges people to 150% of their abilities and gets 120%, but that's the fun of it. He really inspires. Thank you, Steve.", 
            "Worst professor I have ever had. Instead of teaching us math, he yells at us for not knowing the information. Midterms are nothing like the homeworks he gives, and there is absolutely no way to prepare. Every single question is a trick question. Offensive to all students, and could care less what they learn. Only has one arm.", 
            "Sorry for whining about being 'personally reprimanded'. I would delete the post if I could. I was being immature. Shatz is a likeable and brilliant guy, he just doesn't always have the best people skills. I'm sorry.", 
            "He is a very interesting lecturer, but is very easily offended with students who are struggling with the material/or/ask him questions. And he lets them know he is personally offended with them. I think it is a cultural thing, but it is hard on people with delicate egos who don't like being strictly and personally reprimanded for nothing.(like me)", 
            "Doesn't allow us to rate him on the Penn system so I'm doin it here instead. Apparantly he's afraid that his true colors will show if he uses the Penn Course Review.", 
            "The absolute worst professor I have ever had. Not only is he arrogant, but isn't even good at explaining concepts. Makes fun of students for asking him questions about the material and refuses to answer any of them. The mathematics department should be humiliated to even be associated with this man."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "57512": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=57512&showMyProfs=true", 
        "score": "4.4", 
        "name": "John Diiulio", 
        "comments": [
            "the best professor I have had at Penn. Knew his stuff and could analyze in a non-partisan fashion.", 
            "He is a very charismatic and inspiring speaker who makes things I previously found boring instead fascinating and relevant. The multiple choice midterm was extremely tricky, with a lot of \"All of the above\" or \"Both A & B\" options about random details instead of the main ideas of texts. You really need to read all the material thoroughly.", 
            "Awesome", 
            "An amazing mentor!", 
            "He is awesome! By far the best professor. He is also just an all around great human being.", 
            "\"In 2000, it would ahve been impossible to find any Amer. who thought it would be a good idea if Amer. fought a war in Afgh. After Sept. 11, 01, it was hard to find an Amer. who didn't think it a good idea.\" WHAT WORLD IS HE LIVING IN!!!", 
            "Best professor I ever had.", 
            "very overrated and very full of himself", 
            "Impressive calloboration between him and James Q. Wilson of UCLA especially when it came to his musings.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "131284": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=131284&showMyProfs=true", 
        "score": "4.2", 
        "name": "Gwen Eudey", 
        "comments": [
            "Pretty hot. Easy exams", 
            "She knows what she is talking about, she is elegant, and her tests are easy. What else do you want?", 
            "She knows what she is talking about, she is elegant, and her tests are easy. What else do you want?", 
            "Eudey is very easy. All you have to do to pass her quizzes and exams is memorize the answers to the practice questions she gives you. Those questions will appear word for word on the test and quizzes.", 
            "she uses the class to sell her textbook.", 
            "sHE JUST ROCKS!", 
            "I swear this woman has the hottest ass in the world. Dammnnnnn ...", 
            "amazing. clear, punctual, HOT.", 
            "Gwen Eudey may have been the best professor I ever had at Penn.", 
            "No Comments", 
            "She is funny and awesome.. Her class is cool", 
            "Gives good real life examples", 
            "i didnt like the way she set up her class", 
            "So easy", 
            "No Comments", 
            "She was very clear and really wanted the students to succeed.", 
            "Eudey is phenomenal- brains and beauty", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "817015": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=817015&showMyProfs=true", 
        "score": "4.7", 
        "name": "Karen Rile", 
        "comments": [
            "No Comments", 
            "This professor rocks!", 
            "No Comments", 
            "An excellent class taught by a wonderful professor!", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "99782": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=99782&showMyProfs=true", 
        "score": "3.9", 
        "name": "Amir Roth", 
        "comments": [
            "He helped me with some lab related questions.", 
            "He's a cool guy, but I don't think he explains things well enough in class and goes quite fast, although he does do a short review at the beginning of every class. Homeworks in this class are a pain.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "294522": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=294522&showMyProfs=true", 
        "score": "2.3", 
        "name": "Ania Loomba", 
        "comments": [
            "Professor Loomba is a knowledgeable scholar. You can glean that from reading her many books. As a teacher, however, her pedagogy is non-existent, her feedback is harsh, oddly personal, and often unclear, and she gets overly defensive and even offended when disagreed with. In private, she'll make comments that cut deeply. Beware.", 
            "Professor is unprofessional and condescending. She does not have compassion for non native English speakers or low income students. The professor thinks only her opinions of things are correct. The professor does not respect other cultures and is an intellectual bully, as the previous comment states.", 
            "Terrible experience with Ania Loomba. She is often historically wrong and is a an intellectual bully with little compassion for poor students, though she claims to be postcolonial all day long.", 
            "Ania Loomba is a poor intellectual. If your views are different to those of Loomba she starts raving and ranting and saying amazingly rude things in a crude manner.", 
            "By far the most disrespectful professor I have ever encountered in school. Nasty in office hours. She is not willing to help, clarify, or provide HELPFUL feedback to students. I regret taking her class, and I would not recommend anyone to take her course.", 
            "boring and disrespectful.", 
            "Mediocre", 
            "She is awesome. Most students say that about professors that are either easy or laid back, (she isn't either one of those things), but what she is is brilliant. Amazingly smart, and will challenge you ideas and how you think. SHE IS NOT RUDE or disrespectful to students in class or in office hours. Don't expect to be coddled but to be challenged.", 
            "Extremely RUDE. Not as brilliant as others have made her out to be. Class was fairly easy, rather boring. Her angry rants should not be mistaken for a genuine interest in the subject matter.", 
            "Can be very intense but totally inspirational.", 
            "brilliant.", 
            "By far the most disrespectful English Professor I have ever had. Does not seem to respect other cultures, either.", 
            "A shame such an intelligent person cannot be as gifted in dealing with people respectfully. Exceedingly arrogant and not worth learning from.", 
            "I added her class only to find that she had singled me out in a crude, malicious tone during the first five minutes for adding the class late and not knowing what book we would be using that day. Other students, as well as professors, later approached me saying that they felt sorry for me and that she was just usually \"mean\" and \"judgemental\".", 
            "She is the reason I didnt become an English major like I thought I would Freshman year. She is really cruel in office hours, like another poster said. In class she is interesting and enjoyable, but she really says hurtful and rude things to you in personal meetings.", 
            "Prof. Loomba is amazing. She takes you not just through the texts, but the surrounding contexts, reading cultures as well as plays, poetry, etc. She really challenges you to think, to attack questions is ways you never have before. Plus she is amazingly nice, and brought cookies for us on more than one occasion. Take a class with her.", 
            "amazing", 
            "Brilliant and fair.", 
            "very smart and interesting in class. not available very much outside of class but her excitement for intellectual material is contagious.", 
            "Great in class, but NASTY in office hours. No respect for students' intelligence, efforts, commitment. Assignments unclear. Takes offence and goes on the attack if you ask her to clarify. Tells students she doesn't have time to help them. Her general message is that you should just give up."
        ], 
        "tags": {
            "Lecture heavy ": "3", 
            "Participation matters ": "2", 
            "Tough grader ": "3"
        }
    }, 
    "1865361": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1865361&showMyProfs=true", 
        "score": "4.0", 
        "name": "Noam Lior", 
        "comments": [
            "He is great and willing to help international students with our expression problems! The content of this course is pretty easy for students from other backgrounds like me. Before his class I had no mechanical engineering background but it is still easy to get an A in his class. Just read the Moran's and listen to the class.", 
            "I liked him a lot and liked his sense of humor.The class was very expository. It was more or less a seminar type class: very enlightening.", 
            "I really liked the professor and the course. And he had a sense of humor that I appreciated.", 
            "Great Professor. Enjoyed his class!!!", 
            "Markets the class to people outside of engineering, but it is clearly only intended for someone with an engineering background. I'm sure its great for them, but not a business school student."
        ], 
        "tags": {}
    }, 
    "133091": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=133091&showMyProfs=true", 
        "score": "2.9", 
        "name": "Ponzy Lu", 
        "comments": [
            "Taking CHEM022 is a once in a lifetime opportunity.", 
            "Dr. Lu is a bitter misanthropic man who takes joy in trying to be extreme beyond all reason. He bitter views on everything grow tiring as the course continues and he delves into 101 reasons why pre-meds are stupid and biologists are idiots, in fact everyone on earth aside from Dr. Lu is an idiot, at least that's what we've been taught.", 
            "Unfortunately many students judged Ponzy by his cover. On a one-on-one basis, Ponzy is an excellent professor and deeply interested in students' well-being and helpful in giving career advices.", 
            "Even with his many acclaimed and accomplished scientific credentials, Ponzy lacks in being a good person and is seen as a jackass.", 
            "Dr. Lu's class (I was in the Vagelos seminar) is one of a kind. Its not about learning, its about taking on his insight (however cynical on the world). Kind of a joke class, but it was a lot of fun.", 
            "he's a total **** who has, in spite of his ostensible \"achievements\" in science, remains insecure, jaded, and bitter toward practically everyone", 
            "No Comments", 
            "a royal pain for classes-- 6 hour exams on valentines day evening does not a happy student make... but when it came to career advice/recommendations, very helpful", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "212926": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=212926&showMyProfs=true", 
        "score": "4.4", 
        "name": "Irma Tamburri", 
        "comments": [
            "her italian was very good. some things are better left unsaid.", 
            "Her Italian was very good. And she understood the scemo concept very well.", 
            "her Italian was very good...... she understood the scema concept very well....some things are better left unsaid......", 
            "I took her class a long time ago. We had tons of fun, it was a CGS class. We went to the movies and had \"cultural\" experiences which may have included Italian wine.", 
            "extremely hot", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1013306": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1013306&showMyProfs=true", 
        "score": "4.5", 
        "name": "Paul Goldin", 
        "comments": [
            "Nice Professor", 
            "He's very interested in what he teaches. Very energetic and articulate, you will never feel bored in his class even though this is all about Chinese history. He is one of the very few professors that I can still remember 5 years after taking his class. Highly recommended if he's still teaching.", 
            "Prof. Goldin is also an alum of my high school. Besides that, Prof Goldin always holds the attn of his class with a booming voice, and just all around good naturedness. He's very interested in what he teaches and he transfers that onto his students.", 
            "Great sense of humor, though he is not a loving type when it comes to advising. He will help you, but won't fill you with warm fuzzies...", 
            "Funny guy; very easy to listen to. Never had a bad experience with him over the course of two semesters."
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Group projects ": "1", 
            "Beware of pop quizzes ": "1"
        }
    }, 
    "250040": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=250040&showMyProfs=true", 
        "score": "3.4", 
        "name": "Wolfgang Ziller", 
        "comments": [
            "Old, hard to understand, makes mistakes frequently.", 
            "Takes time to provide useful examples", 
            "No Comments", 
            "The subject matter isn't easy, but Ziller did a good job of taking the time to explain anything we didn't understand.", 
            "Funny Russian accent and cool guy. Great examples in physics for calculus problems. Found lectures really interesting using MAPLE programs in class. Very helpful in office hours and was available outside of class for questions. Really nice math prof."
        ], 
        "tags": {
            "Lecture heavy ": "1"
        }
    }, 
    "974679": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=974679&showMyProfs=true", 
        "score": "3.8", 
        "name": "Eleni Miltsakaki", 
        "comments": [
            "Very knowledgeable and passionate.", 
            "Very knowledgeable and passionate professor.", 
            "I learned a lot in this class! I appreciated the hands-on labs on web 2.0 technologies (I finally know what that is). I now feel I'm up to speed with my students and can use technologies they like to improve my teaching.", 
            "This is an excellent class for everybody who needs a hands-on training on how to use basic technologies in their classes to support learner-centered curricula.", 
            "I agree 200% with everything the 4/07 comment said. I already have a blog, and I already know how to use Google sites. I also already know how to write a research paper. I was hoping to learn and experiment more with new technology in education. What a waste of time.", 
            "No Comments", 
            "We learned absolutely nothing except how to create a blog (which we could have figured out on our own). There is $4000 down the drain. She also spent an entire class period teaching us excel, and only how to hide columns. She's difficult to understand sometimes and frequently changed the syllabus. I hated Mondays because of this class."
        ], 
        "tags": {}
    }, 
    "127095": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=127095&showMyProfs=true", 
        "score": "4.2", 
        "name": "Jeremy McInerney", 
        "comments": [
            "It's been more than a decade since I sat in McInerney's classes as a Post-Bac student, but I can still remember many of his insights and much of his charm. Having attended five universities, I encountered three great professors: McInerney is one of them.", 
            "One of the most interesting classes I've taken at Penn. McInerney is a great lecturer who is able to hold the attention of the entire class. Extremely helpful after class too, would recommend going to office hours and taking help from his TAs - they're usually great!", 
            "Excellent orator, lots of arete.", 
            "If he taught all my classes, college would be a lot more exciting. He was very accessible during office hours and a reasonable grader.", 
            "So interesting to listen to lecture. He makes my soul smile.", 
            "Amazing Prof. He was my advisor and I probably wouldn't have graduated without his help. He bent over backwards to help me fight the bureaucracy of the College. He is an amazing scholar and a very caring advisor/professor. His lecture style and Australian accent make him very engaging as well.", 
            "Great teacher and a really funny guy in private. Unlike some, I've never had trouble meeting with him for whatever length of time was needed. Once I had to get to the office and had to cut him off (politely btw) Keep in mind that if all you take is the giant ANCH026/027 classes you're not getting the real JMac.", 
            "He's a great lecturer but, in my opinion, a poor overall professor. You can only meet him for 15 minutes and he's more than happy to kick you out after said 15 minutes. I had him for a recitation leader and his grading of term papers (there are 2) was insanely hard. Take this at your own risk.", 
            "No Comments", 
            "dismissive of everyone because he is surrounded by ass-kissing 24/7. loving his class won't get u anywhere because everyone does. he'll let u proclaim ur interest for a 15 minute office hours session and then send u home with a B- for A work. take this class, but do it pass/fail.", 
            "compelling, erudite and dismissive of slackers. will irritate those looking to be coddled. everything a professor should be.", 
            "while he is probably the best lecturer at penn, he is such a self-satisfied, unresponsive, student-hating prick, that it negates his likability. he complains about bratty students and threatens absurd deadline consequences as if we're in 5th grade. his impressive lecturing is fueled by pride alone.", 
            "I loved his class so much, I switched my minor to Ancient History!", 
            "No Comments", 
            "Fantastic lecturer. Not my favorite subject, but he captivates me nonetheless. There's a lot of reading to do for this class.", 
            "wonderful, interesting lectures", 
            "The best lecturer I've had; a magnificent storyteller and historian", 
            "Prof. McInerney is spell binding - he jsut tells you a story about history."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "2"
        }
    }, 
    "336357": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=336357&showMyProfs=true", 
        "score": "4.4", 
        "name": "Peter Struck", 
        "comments": [
            "Greek/Roman Mythology from Coursera. Pro: Friendly face, FWIW Cons: Tone of voice is casual, hard to differentiate between points, like rambling. Course says no mandatory reading, but lectures as if you've read material-cannot rely on lectures alone or you'll be lost. No AV. No structure in lecture/is confusing. Reading transcript is kind of better", 
            "Mr Struck breaks down intimidating subjects with ease and in the process his students become engrossed in a classic world- while fully understanding it. He undid the damage high school English did with the Odyssey in the 90's. Thank-you", 
            "One of the best professors I've ever had in a Coursera class. I am still thinking about and talking about this class even two years later. Made me passionate about Classics and I haven't turned back since. Would recommend to anyone. He is passionate about his subject and makes you passionate about it too.", 
            "One of the best professors I've ever had in a Coursera class. Engaging and passionate - loves the material and makes you love it too. Good at making things accessible. I am still talking about and thinking about this class even a couple years later. Would recommend to anyone. Lots of reading, but well worth it.", 
            "Scholarly yet engaging, Dr. Struck is an excellent tour guide to a fast-paced deep reading of the classics you will never forget. His friendly and approachable lecture style smashed stereotypes about dusty classics, explored deep territory and motivated our huge MOOC with Coursera to light up the discussion boards from all over the world. Yes!", 
            "Taking this class on Coursera. Love the lectures, have always been interested in Greek and Roman mythology. If Prof. Struck isn't Greek, then he should be.", 
            "An engaging and charismatic lecturer! I took his Coursera Greek & Roman Mythology course, and it opened up a whole new world for me.", 
            "Interesting prof, good teaching~", 
            "Great Professor!! He makes his class very interesting!!", 
            "Struck is awesome. Lectures are interesting and well planned. Tests are not easy but are fun.", 
            "Incredible lecturer. Spitting image of Cameron from Ferris' Day off", 
            "awesome", 
            "great guy", 
            "Wonderful Peter Struck! He is awesome. That's about all. He'll show you pictures of his song and go to the pub with you after class sometimes.", 
            "this guy was awesome. I highly suggest you fin a way to work this class into your schedual. Plus, iot fulfills a general requirement.", 
            "Struck rocks! Quite approachable and determined to answer your questions. helped me a lot in the application process for grad schools.", 
            "lame. thinks way too much of himself. he also, unfortunately, geared the tests and the entire learning of the course towards memorization of names and places instead of really exploring the themes, imagery, and language of the readings. very disappointing. it is difficult to take ancient greek tragedy and make it boring - he succeeded.", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Inspirational ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "131200": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=131200&showMyProfs=true", 
        "score": "3.5", 
        "name": "Daniel Hammer", 
        "comments": [
            "Insightful...", 
            "Dedicated and talented professor. An asset to the institution.", 
            "knows his material, but difficult to get a hold of", 
            "course had very relaxed deadlines, assignments could be turned in whenever (all at the end of course for example), but he also lowered my grade a semester AFTER giving me an A because he didn't grade those assignments till weeks after submitting \"official\" grades. And didn't tell me either. Classy.", 
            "Prof Hammer tends to teach directly from the book. It sounds boring and you probably can learn without attending lecture. I started out below average but quickly worked upwards. You need to depend on yourself to teach the stuff. I expected better like Prof Gorte with his really good notes."
        ], 
        "tags": {}
    }, 
    "48216": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=48216&showMyProfs=true", 
        "score": "3.6", 
        "name": "Carolyn Marvin", 
        "comments": [
            "Whoever wrote \"truely\" needs to learn how to spell.", 
            "Not coming from a \"culture\" perspective this class was really challenging... However, the class proved to be the best class of the semester! Dr. Marvin is excellent and I appreciate her demanding that students back EVERY claim that they make in class with substantial evidence and conviction... Truely a great class", 
            "Excellent professor.", 
            "Sexy class!!! sexy prof!! The class was about taboo -- It was fun!", 
            "Appears to be pretty and sweet, but is extremely unfair--calls her self \"grade-buster\". Loves to \"pull the rug out from under students.\" Very arrogant, favors men over women, slippery; refuses to set concrete goals/expectations for papers--as far as I'm concerned she is no better than a common liar.", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "238172": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=238172&showMyProfs=true", 
        "score": "5.0", 
        "name": "Patrick Wehner", 
        "comments": [
            "One of my most enjoyed classes this semester. He really cares about his students, and goes out of his way to give you helpful feedback and advice. He is also really funny, and makes the class really entertaining.", 
            "Professor Wehner is the best writing professor anyone can ask for. He is approachable, friendly, funny, and a great lecturer. He is always willing to help students and give helpful feedback. Even if his office hours do not fit your schedule, he will find a way to meet with you. He helped me become a better writer. I would recommend him to anyone.", 
            "Dr. Wehner is a great professor--his classes are interesting, he is approachable, and I learned a lot about writing.", 
            "Dr. Wehner's writing seminar was easy and rather instructive. The class meetings were on the dull side.", 
            "No Comments", 
            "Hard but fair grader. Class is (almost) always interesting and engaging. He's very approachable and friendly and unintimidating, but still very knowledgeable."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Accessible outside class ": "1", 
            "Gives good feedback ": "2", 
            "Lots of homework ": "1"
        }
    }, 
    "567509": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=567509&showMyProfs=true", 
        "score": "2.5", 
        "name": "Susan Phillips", 
        "comments": [
            "Actively discouraging and spiteful towards students. Refused to acknowledge and fix her mistake regarding lecture polling registration and instead blamed and mocked students for it. Forced to apologize for making exams irrelevant and impossible to finish. Just generally not a good professor. Should stick to research", 
            "Felt like she made things more difficult than they had to be. Material/lectures were all over the place, and it was extremely difficult to figure out how to effectively study for her exams. Would not recommend.", 
            "She frequently goes off topic during lectures which makes them hard to follow. She spends hours of class time going over concepts that never showed up on any tests. Very minimal partial credit given on exams! The material was NOT presented clearly at all. The assigned textbook homework had NO resemblance to the exams either!", 
            "Completely Horrible. Do not take her if you are taking Chem 101", 
            "Major's Chem Lab. Take it, its a small section and the grading is a lot more lenient than regular lab. You do a little more pre and post lab work but I think Dr. Philips runs a better lab than Kozub does. She is pretty reasonable and nice about things, though a little loopy at times. Nice lady.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Lecture heavy ": "2", 
            "Graded by few things ": "2", 
            "Tough grader ": "1"
        }
    }, 
    "794220": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=794220&showMyProfs=true", 
        "score": "4.5", 
        "name": "William Clee", 
        "comments": [
            "I had Prof. Clee for the night class (601) and he was an excellent, very reasonable professor. He covered the material very comprehensibly and has a wonderful sense of humor. I'm not sure if it's more me or him, but half my notes were funny things that he says; his lectures are extremely engaging and really give you a taste of the art in math.", 
            "Clee is a good professor for MATH 240, he is, however, hard. His tests can be rough, and can be substantially more difficult than the practice tests/study guides, but if you do the homework problems, and the extra practice problems, you should be fine, as long as you really have them down. If you skip even one class, it can really set you back.", 
            "Clee is extremely thorough with his covering of the material. He is extremely nice, and if you have questions and show that you care, he will help you.", 
            "Great teacher. If you don't like math he will make you interested in it. If your base in math is \"so-so,\" he will explain some lower and upper stuff you will need, and sometimes things you won't need, just for the sake of it.", 
            "Professor Clee is the sweetest man. I really looked forward to his class. He had a great sense of humor and made math 103 extremely interesting!!", 
            "He is very sweet, helps the student, and also very laid back. He makes the class very interesting, even if you hate math.", 
            "i love this guy...he was so cute and nice and taught the course really, really well..i enjoyed my semester with him and only wish he was still me teacher", 
            "a really good teacher. explained the material well and always prepared us well for the exams. I hate math, but Clee made it worth its while. Thanks, sir!", 
            "No Comments"
        ], 
        "tags": {
            "Graded by few things ": "1", 
            "Test heavy ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Hilarious ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "1892546": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1892546&showMyProfs=true", 
        "score": "3.2", 
        "name": "Carly Goldberg", 
        "comments": [
            "Does not follow the expectations as laid out in the syllabus. The professor does not explain the theories of the class well or in a clear fashion as described in the text.", 
            "Carly's passion for teaching and social justice is inspirational. Her teaching style is the perfect balance of levity and honesty. Absolutely take her class!", 
            "Carly was my favorite professor my first semester of my MSW. She connects with her students on a deeper level, and cares about the material. I was inspired by her from day 1 and looked forward to going to class everyday. If you're interested in clinical social work and happen to be a feminist, I highly recommend taking her courses.", 
            "Not conducive to different styles of learning. Felt like she was not into the material, after all she is not a professor or a teacher, but rather a social worker. I don't think her place is in a graduate classroom. Superficial knowledge of the material.", 
            "Classes are boring and her teaching style just didn't match with my learning style."
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "1", 
            "Lots of homework ": "1", 
            "Lecture heavy ": "2", 
            "Caring ": "1", 
            "Hilarious ": "2", 
            "Participation matters ": "2", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "71151": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=71151&showMyProfs=true", 
        "score": "4.9", 
        "name": "Rita Copeland", 
        "comments": [
            "The kindest, most joyful, animated, reasonable professor I've had. Full of movement. Even though I am young she has more youthful vigor and five times more energy than me every morning. She made dense material interesting. Everything she said was intellectually sound, plausible, and coherent. Very encouraging towards all her students' commments", 
            "Rita Copeland is mindbogglingly energetic and enthusiastic. She is brilliant and fabulous and everything I've ever wanted in a professor.", 
            "Loved the class! I highly recommend this professor.", 
            "Incredibly knowledgable; an excellent lecturer and professor", 
            "Rita Copeland is so helpful - she's really great.", 
            "Professor Copeland is my favorite professor at Penn!"
        ], 
        "tags": {}
    }, 
    "6465": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=6465&showMyProfs=true", 
        "score": "4.5", 
        "name": "Rudra Sil", 
        "comments": [
            "His lectures and course content were very well planned. Kept the class interesting and motivated. The reading was not unreasonable and was always relevant to the coursework. Prof. Sil's also a very funny guy which keeps the mood in the class light. Just don't interrupt him while he's in the middle of a lecture and get there on time!", 
            "great", 
            "Prof Sil is easily one of the best professors at Penn.", 
            "Rudra Sil is one of the best professors on campus. You are bound to like political science if you took a class with Rudra Sil.", 
            "This is an awesome prof. Funny, clear, and incredibly informative. I wasn't sure about this class when I signed up but it turned out to be my favorite class.", 
            "I loved this class. All the material was fascinating and I learned so much. He covers so much ground in each lecture. He maximized usage of all the time within each lecture very effectively. The lectures were thought-provoking, and extremely organized. He lets us use notes on exams. The exams were fun and did not involve regurgitating information.", 
            "Lectures are very clear and he also emails very detailed handouts.", 
            "excellent", 
            "Prof. Sil is by far the best prof I've had at Penn. I've no idea what the person who made the 11/22 comment was smoking. The lectures are great, he's funny, and the class totally changed the way I think about the world. I highly recommend this prof.", 
            "Professor Sil doesn't seem to care about teaching at all. There's no point in going to lecture because he just reads from the notes he sends out via email. The class is ridiculously easy, but it's also really boring. I'm really disappointed I signed up for this class and would not recommend registering for Sil's classes.", 
            "No Comments", 
            "No Comments", 
            "Dr Sil is an unbelievably great teacher in his clarity and entertainment value.", 
            "Very clear in his lectures...ties things to the Simpsons well! Also funny."
        ], 
        "tags": {
            "Hilarious ": "2", 
            "Respected ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "271059": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=271059&showMyProfs=true", 
        "score": "4.5", 
        "name": "Jonathan Steinberg", 
        "comments": [
            "The best professor I've ever had. Perhaps the only one who ever really changed my life. On top of being an expert and a bona-fide genius, he's a model of how a professor should act; he engages every student, memorizes their names and invites them to draw on his knowledge and experience should they ever need help during college.", 
            "One of the few people in this world who has somehow managed to develop a genuine interest in the lives, needs, and potential of others. Incredible. Restored my faith in humanity.", 
            "Brilliant professor, perhaps one of the top three I've ever experienced. I took his European History module this past summer at Cambridge University and loved every moment of it, though I wish it could have laster longer. He is thorough, informed, inspiring and fair. If you are passionate about history, he is your guy. Good luck and enjoy!", 
            "Great professor and one of the few faculty who cares deeply about students. Highly recommended.", 
            "He was my academic advisor, a really nice guy. I thought the class was a little hard for a history class--I only got an A- on the midterm and I mean, I had the books practically memorized. A big workload, too, midterm and final exams with essays and short answers as well as a final essay. But understanding--I failed the final and still got a B.", 
            "No Comments", 
            "I haven't had a class with this guy, but I've seen him many times on the history channel, and he knows his stuff. Very interesting!", 
            "Smart prof and very nice. Lectures too early in the morning!!! Easy grader.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "616322": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=616322&showMyProfs=true", 
        "score": "4.2", 
        "name": "William Laufer", 
        "comments": [
            "Professor Laufer is THE best professor I have had at Penn.", 
            "Awesome", 
            "No Comments", 
            "he was an AWESOME professor. a great teacher and a great person!!", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1552546": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1552546&showMyProfs=true", 
        "score": "4.5", 
        "name": "Casey Bohrman", 
        "comments": [
            "So... Casey is absolutely brilliant. You're expected to participate, yes, but it's hard not to. Her lectures are relevant, interesting and thought provoking. Also encourages the class to be sensitive of students from varying backgrounds/opinions, etc. Not a tough grader (from my experience). If you have a chance to take a class with her, do it!", 
            "Casey is an excellent professor. I enjoyed taking her class and learned a great deal.", 
            "Incredible! Casey is so knowledgeable and relatable, and she always made class interesting with discussions, projects, etc. 10/10 would recommend.", 
            "Casey is a pretty good professor. Shes very cool and laid back. We have lots of discussions. Tumblr and twitter project can be a bit annoying but the most you will do is read a lot and one big paper at the end", 
            "She was awesome! Some of the assignments were not fully developed and so were confusing but I think it'll get better as she fine-tunes them. She was very passionate and brought up relevant examples which really helped with engagement. She used various modes of teaching ie videos, lecture, class discussion, student presentations, etc.", 
            "Knowledgeable but honest when she doesn't know. Manages to make a pretty dry topic into an interesting 2.5 hours every class. Plus if someone ever tried to bust in and take you hostage she could handle them!", 
            "Casey is one of the most wonderful professors at SP2 she is super helpful!", 
            "Casey is very energetic and knowledgeable. She looks for creative ways to engage the class, which everyone really appreciates. Of all my classes, this is the one I truly look forward to each week."
        ], 
        "tags": {
            "Gives good feedback ": "2", 
            "Lots of homework ": "1", 
            "Participation matters ": "4", 
            "Accessible outside class ": "2", 
            "Caring ": "2", 
            "Amazing lectures ": "2", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "336355": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=336355&showMyProfs=true", 
        "score": "4.2", 
        "name": "Jacques Bromberg", 
        "comments": [
            "Good guy, knows his stuff, and doesn't test you too hard. Most everything graded is online and is very helpful if you have any issues. Easy class but only because he teaches well.", 
            "He is a great guy who cares a ton about his subject matter, in my case Greek History. He made his midterms, quizzes, and final online so I just googled everything and passed. Assigns a lot of reading but you never have to do them, overall would recommend if you want to learn without pressure", 
            "He's a really funny professor that's nice and understanding. Attendance isn't taken and communicates really well in person and via email. Clear passion about Greek History and gets excited in lectures. Final project instead of a final test and his weekly quizzes are online so I rarely showed to class. Cool guy! I learned a lot, have fun.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Accessible outside class ": "2", 
            "EXTRA CREDIT ": "1", 
            "Caring ": "2", 
            "Clear grading criteria ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "610504": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=610504&showMyProfs=true", 
        "score": "3.8", 
        "name": "Anthony J. Pietrovito", 
        "comments": [
            "Dr. Pietrovito was the reason I graduated second in my medical school class. He was my first chemistry professor in the Post-baccalaureate Program prior to medical school. His class seemed impossible! However, he was always available to teach outside of class. He was a true mentor and inspirational to me and many others!! He was amazing!", 
            "Socially inept and gives painfully long winded lectures while never pausing for questions from the class. The exams are very detailed with what never feels like enough time to complete said exams. He should be teaching graduate students, NOT intro chem to undergrads.", 
            "Dr. P is a nice and funny guy sometimes. I had a horrible time understanding him or relating to him. I work full time and cannot utilize his office hours which i understand might have been useful. He has a NO MAKE UP TESTS policy ( you get to drop lowest). Not great for people without 20 hours/week to study/teach themselves the material.", 
            "Nice guy, hard class.", 
            "A revolutionary teacher, if I do say so myself.", 
            "Completely unintelligible lectures to the average student who is new to chemistry. Do not take Chem 101 with this man", 
            "Amazing, amazing, amazing! Dr. P is a great professor. His lectures are extremely clear. He explains the concepts in such an accessible way! He also posts his notes which are great! They explain the information better than the textbook does most of the time. If I could take CHEM 102 with him, I would! Highly recommend", 
            "Dr. P is incredibly accessible and only wants to see you succeed. Don't hesitate about coming to see him, even if you think it is a stupid question. He is the best professor I have ever had, and this is coming from a girl who had to take his class twice!", 
            "AVOID THIS MAN AT ALL COSTS.", 
            "The man is brilliant, but the kind of brilliant that makes it seem like he's living on another planet. I never went to lecture. It boring as heck and impossible to follow. But what I did do was READ EVERY SINGLE DOCUMENT HE POSTS. Its all in there. They are SO LONG but if you know those documents backwards and forwards, you'll ace every exam.", 
            "Dr. P is a great guy who cares a lot about chemistry. His lectures are really boring but if you are disciplined enough to listen, they can be really enlightening. Must explicitly show all work on tests to receive full points, which is frustrating given the time constraints.", 
            "LOVE Dr. P. This guy is so dedicated to his craft and only wants you to do well. He gives a lot of his time outside of the classroom to help students in office hours, appointments and in workshops where he mediates problem solving. He can get confusing in class while he is rambling off-topic, but it is all out of his passion for chemistry.", 
            "Put in the work and you will walk away from his classes an expert, but don't expect it to come easy. Get as much face time with Dr. P as you can. Go to class, recitation, workshops, and office hours if you need it. Be prepared to study 20+ hours a week for his exams: you will need to be able to do the material in your sleep!", 
            "Great guy!", 
            "Excellent professor, always willing to help. He may get too deep into the details for both lecture and exams but it prepares you for what is ahead.", 
            "Could be worse...", 
            "He's a great chemist but you cannot rely on him to teach you. You must read the chapters and his lecture notes. Once you do put in the work, he's an amazing resource. He will literally derive equations infront of you in seconds and explain it extremely well along the way. Go to office hours!", 
            "What a wonderful teacher! He is tough but he teaches really well, enjoys interacting with students, really cares about his students, and is willing to spend additional time explaining concepts.", 
            "Dr P is great. He is extremely accessible, loves helping students. Tests are tricky, but there are no surprises on them and he covers only material that has been thoroughly covered. A hardworking student who takes advantage of his problem sets and workshops can earn a good grade in his class.", 
            "Dr. P is great - he is very thorough, responds to emails quickly, always available to meet. His explanations are very easy to understand. It is clear that he fully enjoys his teaching and he has a good understanding of the subject matter. He is a great professor! I would highly recommend him as your chemistry professor!!"
        ], 
        "tags": {
            "Respected ": "2", 
            "Tough grader ": "4", 
            "Test heavy ": "2", 
            "Skip class? You won't pass. ": "1", 
            "Lecture heavy ": "2", 
            "Accessible outside class ": "2", 
            "Caring ": "1", 
            "Hilarious ": "1", 
            "Amazing lectures ": "1", 
            "Get ready to read ": "6", 
            "Inspirational ": "1"
        }
    }, 
    "571450": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=571450&showMyProfs=true", 
        "score": "5.0", 
        "name": "Marie-Eve Fecteau", 
        "comments": [
            "Very pragmatic", 
            "Awesome teacher!", 
            "Great professor and clinican", 
            "I love her accent", 
            "No Comments", 
            "Awesome Professor! Her enthusiasm and passion about patient translate in her class presentation. She is well articulate and funny. She is a great role model for women that want to succeed in large animal field.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "222541": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=222541&showMyProfs=true", 
        "score": "3.9", 
        "name": "Kenneth Lande", 
        "comments": [
            "Professor Lande changed my life. Physics is now one of my favorite classes. Professor Lande gave inspirational lessons and encouraged me to work hard and it payed off. He is an amazing person and professor. He gives great feedback and I would definitely take his class again", 
            "Professor Lande changed my life. Physics is now one of my favorite classes. Professor Lande gave inspirational lessons and encouraged me to work hard and it payed off. He is an amazing person and professor. He gives great feedback and I would definitely take his class again.", 
            "It was the non-Majors class, but everyone there seemed to have taken advanced Physics already. It was a lot harder than prof made it out to be. Lande was nice enough to award participation and curve exams. When he says you'll have the formulas he's not telling the whole truth--study them. He was wonderfully nice though.", 
            "Professor Lande tries to simplify this class as much as possible. He is willing to help if you are very proactive about seeking his help. Beware-- he takes attendance!", 
            "I had Lande a few years ago for premed physics. First off, I must say that I hated physics (beware of physiology in med school. you can never escape physics). Lande was slow, boring, and not helpful. Although he was a nice guy. Try Sovin if you need to take physics. He's a much better prof.", 
            "Great teacher. He actually teaches stuff that i can understand. Nice guy. If i was taking 151 i would definitely make sure he's my prof.", 
            "Wonderful, kind professor who generously offered time to help with students on homework problems. Encouraged students to work together in groups at study sessions. Great guy who wanted us to learn and not worry about grades. Took both PHYS 150, 151..."
        ], 
        "tags": {
            "Caring ": "2", 
            "Inspirational ": "2"
        }
    }, 
    "178250": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=178250&showMyProfs=true", 
        "score": "4.5", 
        "name": "Daniela Viale", 
        "comments": [
            "She is a nice person but for a class where you are just starting to learn a language, she jumps into all italian-no english way to quickly in the course. She will be talking in italian and often I got very confused on what we were supposed to do. Other than that the course is relatively easy and fun. The homework really helps on tests and in clas", 
            "very thorough teacher.", 
            "No Comments", 
            "No Comments", 
            "Daniela is a phenomenal teacher! And she's sooooo cute and bubbly that you actually hate missing class."
        ], 
        "tags": {
            "Lecture heavy ": "1", 
            "Participation matters ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "249296": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=249296&showMyProfs=true", 
        "score": "3.0", 
        "name": "Jeffrey Winkler", 
        "comments": [
            "Not a very good communicator, and taught esoterically. The exams did not reflect anything given in either the lecture or the reading material. Very abrupt and short when asked for help during office hours. Not empathetic when you came with questions that he felt you \"should\" have known the answers. One of the worst professors during my 4y at Penn.", 
            "He's terrible. Instead of helping me when I needed him most he encouraged me to drop out and forget medical school. Luckily I ignored him and am applying to match in vascular surgery this spring. If you're doubting yourself because of things he said to you- know it's not you- it's him.", 
            "Winkler can teach well enough, however on a personal level, he is demeaning, condescending, and makes efforts to shame students rather than help us. I love chemistry but he turns me away from it. He makes going to class or meeting with him a very unpleasant experience.", 
            "The man", 
            "went much much too fast. didn't care that nobody understood him. made \"jokes\" that were demeaning. just not a nice guy in the classroom. unpleasant to be around.", 
            "Awesome professor. His explanations are 1000x better than the textbook. Plus, unlike other professors, he finishes the material for the semester on time without a rush at the end.", 
            "Always available great teacher even though most students will hate the class b/c it's orgo", 
            "Really tough course and Prof Winkler didn't make it any easier. Exams were much too challenging even for his graduate students. He needs to gauge students understanding rather than just try to get a good distribution of grades. Avoid him period..."
        ], 
        "tags": {}
    }, 
    "862967": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=862967&showMyProfs=true", 
        "score": "2.5", 
        "name": "X Witmer", 
        "comments": [
            "I have never seen a professor as devoted, patient, and har-working as her!!!", 
            "She genuinely cares about her students and would stay much longer after every class to answer questions as well as provide practice problems.", 
            "Great professor. if u want clear answers for ur questions from her, u can ask her after class", 
            "Aside from being ridiculously out of sync with the textbook and the English language, she was cute. That is all.", 
            "Some issues in clarity, but not so much that you can't figure it out if you try. She is definitely not going to spoon-feed anyone anything, but she is very invested and if you follow her guidelines, the class is significantly more manageable.", 
            "Undoubtedly, THE WORST educator I have ever had in my entire life. Doesn't speak english--or write tests in understandable english. Has favorites. She even talked about how much she hates her boss. AVOID at all costs...it's worth the money to switch to the day class if you're in LPS.", 
            "the worst!! moderate to severe language difficulty, deliberately unavailable TA's, poor communication, lab ahead of lecture, blackboard not utilized, exam problem questions do not match lectures, unable to \"teach\" material and uninterested in changing to improve, responds to favorite students", 
            "Thick accent, difficult to understand, horrible tests with many typos and problem sets are often outside the scope of the course. As a person she's friendly, interested in her field and easy to catch during office hours/after class etc, however she's close to the top of my list of 'worst professors I've ever had.'", 
            "She is not bad. True, there are issues with exams (typos and clarity), however, she is fully invested in her students and interested in their success. Gives weekly MCAT quizzes relevant to current material, which is extremely helpful for MCAT prep. Overall, you will learn what you need to, and she is definitely knowledgeable.. just be patient", 
            "She's far from the worst. She's generous with her time, is very nice, and loves the topic. Language is the biggest problem, as you'll often ask her a question, and she'll simply repeat what she said previously. Exams can be hard, but labs and quizzes are pretty easy. Be prepared to put in the yards and you'll do fine.", 
            "worst!", 
            "Unhelpful. Prioritizes research above teaching. Thick accent, cannot convey lessons to students. Text is wonderful but unhelpful for the purposes of doing well in her class. Makes tests up the night before, they are full of typos and difficult to understand. Very disorganized.", 
            "She lies. She is not helpful in anyway. She will ruin your GPA. Do not take her.", 
            "No Comments", 
            "She has a good heart but she is a horrible professor. I would discourage anyone from taking her class. It is very hard to understand her and she is very insecure about what she teaches.", 
            "Worst professor I've had the displeasure of taking classes with. Worries more about finished lectures than if students understand. Exams are horribly worded. And worst of all, no one can understand a word she says. Not being a Penn student, this course has discouranged me from taking other Penn courses in the future! F------------------------"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Respected ": "1", 
            "Gives good feedback ": "2", 
            "Caring ": "2"
        }
    }, 
    "155916": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=155916&showMyProfs=true", 
        "score": "3.6", 
        "name": "Max Mintz", 
        "comments": [
            "He shouts while giving his lectures. The course is made to appear tougher than it actually is.", 
            "Great professor. Very knowledgeable. Manages to make the most mundane math topics interesting. Great person too.", 
            "Very difficult but very knowledgeable", 
            "One of the best teachers at Penn.", 
            "Anyone who can make a class on set theory something to look forward to is obviously a gifted teacher!", 
            "No Comments", 
            "FANTASTIC, amazing professor. One of the best at Penn. Really cares, really goes out of his way. Teaching is excellent. Very fair. On top of all that -- he's extraordinarily funny. And a very nice guy.", 
            "8 years after graduating, I can say with confidence that this course is useless to the professional software engineer. Mintz's influence keeps it in the core CSE courses, but SW methodology or lifecycle courses would be much better. He is hurting us.", 
            "The most quotable professor I ever had.", 
            "No Comments", 
            "No Comments", 
            "AWESOME prof!! He really cares about teaching and is something of an institution at Penn CS. His courses are highly recommended - but beware the he fails around 20% of each class!"
        ], 
        "tags": {}
    }, 
    "470683": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=470683&showMyProfs=true", 
        "score": "3.9", 
        "name": "Alan Johnson", 
        "comments": [
            "Professor Johnson has a classic experimental physicist's humor which he infuses throughout his great lectures. He genuinely cares about how well the class is grasping the material as he takes care on his explanations which makes him a great professor for this honors course. He is very open during office hours and gives great help with the homework.", 
            "Best physics professor at Penn, hands down. He should teach every class. Sad to see Durian's teaching it now, that guy has pitiful ratings.", 
            "Solid. In-depth. Fun.", 
            "Good professor. Not the greatest, but he's a great guy. Very helpful.", 
            "Awful", 
            "No Comments", 
            "Worst professor I've ever had.", 
            "No Comments", 
            "No Comments", 
            "he's so sweet. i was having trouble and the guy totally helped me out during his office hours/ not during his office hours. he was really helpful and very willing to give up his time. did i mention he's really hot?"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Hilarious ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "233470": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=233470&showMyProfs=true", 
        "score": "4.9", 
        "name": "Benjamin Moore", 
        "comments": [
            "He was a great teacher", 
            "Just amazing. This class would be far more difficult if he weren't there to make it so engaging and interesting.", 
            "No Comments", 
            "Awesome professor. He really cares about spanish and his students. He always comes to class excited and makes each class fun.", 
            "Wonderful professor who demystified Spanish grammar for me."
        ], 
        "tags": {}
    }, 
    "1586235": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1586235&showMyProfs=true", 
        "score": "5.0", 
        "name": "Vijay Venkatesh", 
        "comments": [
            "If there is such a title as a cyber samurai this prof is it. He is a far cry from all the other profs who just preach. This prof does a lot of deep show and tell. He is also a real internetwork expert and cyber hacker. He recommends key books but honestly he should be teaching the guys who write the books. He is an expert++ and demands precision.", 
            "Hardest class I have taken. You need to know everything - servers, routers, switches, vmware, programming, bits, bytes. Prof knows all this inside and out - has real world practical experience. You will get no credit for something that sort of works - class demands very high level of precision and perfection to become a cyber kung fu master.", 
            "For professor the network either works or not - very binary 1 or 0. No partial credit after so much work. Always available to help understand concepts but you need to put in lots lots of effort and show you want to learn. All classes hands on and shows you so many tricks. Part of DoD cyber warrior program - pretty serious stuff.", 
            "clear on assignments and easy on grading. easy work load for the week.", 
            "Professor is way passionate about security and really knows it inside out. His eyes and red lips get way intense when he is so focused on topic. Prof is always online 2am, 5am, 10pm - doesn't matter he can do a conference call anytime. He needs perfection so you need make sure you learn the material and core concepts.", 
            "Very very hard to get an A in this class. Instructor is always helpful and I always get response in less that 5 minutes. Instructor is a real cyber and internet expert - he teaches but also does detail show in class. No credit for attendance like other classes but if you want to learn you need to show up or you lose a lot.", 
            "The professor is quite open to discussion and the class shows how to use the security tricks. He is not big on deadlines but be careful - if you don't do the work in time you will be lost on the next week's homework. Make sure to submit all papers before last day of class and you are good. Don't expect to get any credit for showing up to class."
        ], 
        "tags": {
            "Respected ": "3", 
            "Gives good feedback ": "3", 
            "Clear grading criteria ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Inspirational ": "4"
        }
    }, 
    "424342": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=424342&showMyProfs=true", 
        "score": "4.8", 
        "name": "Connie Scanga", 
        "comments": [
            "I enjoyed Connie B. Scanga PhD course.", 
            "Very tough. Tests are usually more detailed than any information given in class", 
            "What an amazing personality! She's fun, incredibly knowledgeable, helpful and friendly. My favorite professor ever!!", 
            "Amazing!", 
            "Loved her! She really levels with each of the students. Knows her stuff and truly loves teaching A&P. Now whenever I recall my basic anatomy, I can hear her crazy laugh :D", 
            "I love her. She really made A&P interesting.", 
            "Dr. Scanga is awesome! I would take any course taught by her. Clear and knowledgeable. Snarky sense of humor. Really interested in helping students learn. Attendance in lecture not mandatory, but if you miss it, will have a really hard time as she doesn't teach straight from text.", 
            "No Comments", 
            "Brilliant. Driven. A little intimidating. Knows her stuff. Makes you learn A&P."
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Caring ": "1", 
            "Inspirational ": "1", 
            "Get ready to read ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "636305": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=636305&showMyProfs=true", 
        "score": "2.5", 
        "name": "Patty Rogers", 
        "comments": [
            "Honestly, she was by far the worst nursing professor out of my nursing education. She was unsupportive of the students; it almost felt like it was her vs. the students most of the time. I cannot believe an educator (especially at Penn) could and would behave this way toward students.", 
            "I took N390 (Senior Leadership) this past semester with Patty. Lectures are boring, unclear, tests are convoluted, she is extremely defensive, will bite your head off if you push back on anything, she represents the old school kind of nursing education which really needs a makeover. Not a supportive teacher. Mean-spirited.", 
            "This professor is extremely defensive and has difficulty answering questions from students. Exam questions are convoluted and were not covered in the lecture materials or text.", 
            "Patty was our introductory professor to the BSN/MSN at Penn. We had her for but one blissful week - really enjoyed her humor, humility, frankness and intelligence. She opened our eyes to the world of nursing and I hope that the journey will be great because of her.", 
            "confusing, vague tests from lectures that don't cover anything specific. Some of the case studies were helpful but they move too fast to learn much. Patty pulls off \"caring\" but she will bite your head off when she feels threatened.", 
            "Prof. Rogers is engaging and has the students' best interests at heart. Great class.", 
            "Unclear, uncoordinated and uncool. Tests are out of nowhere and intolerant of questions or comments. Avoid at all costs.", 
            "Sweet teacher! Will do anything she can to help you, and also tries to get student input/feedback continuously so she doesn't just bore you in class. Cool lady."
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Group projects ": "1"
        }
    }, 
    "1246921": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1246921&showMyProfs=true", 
        "score": "4.0", 
        "name": "Michael Cancro", 
        "comments": [
            "Absolutely fascinating lectures from someone who watched the whole field develop from the front lines. Tests are not particularly difficult. Tons of extra credit available (like, 6% of your final grade. it's insane).", 
            "It is extremely time consuming. But the best way to survive is in groups. all tests and take homes can be discussed. learnt most in those sessions trying to crack it. Worth every bit of effort", 
            "It is definitely a lot of work with the weekly discussions and the many exams but if you put the time into it, you can definitely get an A. He isn't as accessible as I would have liked outside of lecture but the TA's were very helpful. Overall, this class is a must take, very applicable if you are in the research field.", 
            "Definitely one of the most time-consuming courses I've ever taken! Expect weekly in-class quizzes, weekly online thread discussions (minimum of 2 posts), 2 take home exams, 15 page paper, midterm and final- oh and a group presentation (optional). And if thats not enough he calls on people every lecture- HE WILL PUT YOU ON THE SPOT!", 
            "You will work hard (and sometimes bang your head on the desk with the time needed for exams or weekly message boards) but it is definitely worth it...and an A is easily within reach if you commit. You will look back and actually feel like you accomplished something. He's a great guy too.", 
            "Best Class I have taken so far", 
            "Definitely not an easy class, but Dr. Cancro is a great teacher. There are take home exams due before every in-class exam, but they're really helpful for studying. He will most definitely call on you in class. Online discussions are really time-consuming, only marginally useful.", 
            "No Comments", 
            "He's a cool professor. However, stay clear of the front seats. He will call you out to answer questions. Class includes exams, quiz, pop quiz, weekly online discussions on blackboard and 10 page paper. Be prepared for lots of work!!!"
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "1", 
            "Lots of homework ": "2", 
            "Participation matters ": "1", 
            "Hilarious ": "1", 
            "Test heavy ": "1", 
            "Clear grading criteria ": "1", 
            "Inspirational ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "820682": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=820682&showMyProfs=true", 
        "score": "4.0", 
        "name": "Richard Gelles", 
        "comments": [
            "This class is utterly fascinating, raises a ton of hard questions and the prof is not afraid to delve into controversy. He loves to get people riled up, which is what a teacher should do. There is a ton of reading but he is generally pretty understanding. I think he is an excellent professor, nevermind the haters.", 
            "Worst. Professor. Ever.", 
            "Too funny.", 
            "I am in love with this dude. He's awesome. I never miss class cuz he's actually really entertaining. You'll definitely enjoy him if you like sarcasm.", 
            "I love this guy...kinda weird, but a real hoot 'n' a hollar. I always look forward to his class."
        ], 
        "tags": {}
    }, 
    "403395": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=403395&showMyProfs=true", 
        "score": "4.4", 
        "name": "Nechama Sataty", 
        "comments": [
            "The most compassionate, hilarious, knowledgable, and insane prof I've ever had. I will never forget her class.", 
            "crazy, anxious....thats all im gna say", 
            "My favorite class. Never a dull moment. She is insane, but in a good way. You learn a lot, very quickly.", 
            "She is a great teacher. The class was never boring and I enjoyed it a lot.", 
            "CRAZY woman. But she actually isnt a bad teacher, I never got bored, mostly because she is completely insane. In a funny way.", 
            "Awesome!"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Lots of homework ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Hilarious ": "1", 
            "Caring ": "1"
        }
    }, 
    "483119": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=483119&showMyProfs=true", 
        "score": "3.6", 
        "name": "Caroline Wong", 
        "comments": [
            "Class is almost entirely discussion-based, so she expects you to speak up. We've had lots of guest lectures (not always related to the course content, go figure). Readings are really, really dense BUT it's easy to get by without doing them.", 
            "All the previous comments are spot on. Professor Wongs class is pretty unstructured which leaves room for the class to take it any direction (positive or negative). This means that the class must be willing to speak up, and work together to organize class. She also brings food to nearly every class. Prof Wong is good, but not the best (or worst).", 
            "There was too much group discussion that didn't go anywhere. The assignments were unclear. However, she asked good questions, challenged us, and brought a unique perspective to the subject matter.", 
            "Caroline Wong is a good prof that, given the right mix of students, has a very good class. She also makes some amazing food.", 
            "The prof is nice and the class has potential but people are afraid to say what they really think. Wong is a good professor but I recommend speaking up in class."
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1", 
            "Participation matters ": "2", 
            "Get ready to read ": "2"
        }
    }, 
    "2348670": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2348670&showMyProfs=true", 
        "score": "4.5", 
        "name": "Fatemeh Shams", 
        "comments": [
            "One of the best professors I've had at Penn! She really cares about her students and wants to see them succeed.", 
            "My last semester at Penn. Will miss her classes. Loved those hours in class, truly life-changing. So humble, so caring...", 
            "One word: INSPIRATIONAL. I loved her as a teacher.", 
            "tough but inspirational. read her poems. she is one of a kind!", 
            "A generous soul. Always available even if you are no longer a student. Inspiring and opens up your mind about poetry, Iran and its truly fascinating literary tradition.", 
            "Down-to-earth, and knowledgable. Nominated her for the teaching award. truly a good teacher.", 
            "Amazing prof and human being. 100 percent", 
            "truly amazing. so happy I took her course. learned a lot and was challenged in every right way. will miss the three-hour weekly class :/ fun guest speaker too.", 
            "Very interesting course materials. Fun to read and attend. Short papers could feel a bit much but a good writing practice all round. She is truly a poet-scholar and a great teacher too. usually brings amazing guest speakers and Iranian artists on campus. Would take again", 
            "So sad to finish this amazing course... :( she cares a lot about her students which is rare. I struggled a lot with Penn and its unleathy competitive environment and she was by far the best teacher to calm me down at times of crisis. Always accessible outside of classroom. was my third class with her...", 
            "The most LGBTQ-friendly prof ever!!! Love her as a human and a scholar. Helped me get through a big crisis in life while under so much pressure to pass my units.", 
            "Amazing at explaining difficult concepts/literary texts - funny and kind. Gotta work hard tho", 
            "Just finishing this course. As a sophomore, I had to take electives and my peers suggested this course. Happy I took it. You gotta work hard but totally worth the effort. My first academic encounter with the middle east was through this course and it changed my view in so many ways. Penn better make this course mandatory for American students!", 
            "Took this course as an elective with no background in literature and poetry. Frankly the only intresting elective Ive taken at Penn so far was this one. Its not demanding but participation and engaging with the materials matter. She cant stand lazy bums tho. So avoid the course if you dont wanna do any work! Id take this course again.", 
            "She doesnt give A(s) if you dont get ready to read or engage with the material. Well, thats a good thing I guess! But if you are there to be a lasy A(ss) looking for an A choose another class. But this course is seriously good for your soul! So take it and learn something!", 
            "I already told my advisor this class changed my life. I was constantly challenged to open up to new horizens. To learn new ways of looking at the world and make sense if it, not just Iran and the middle east but in general. She asks questiobs that change your view and definition of many conventions. Refreshing and engaging readings.", 
            "already signed up for my next class with her next semester. a proper Oxford-trained prof. meticulous, analytical, serious and humorous. I wish Penn had more instructors like her. I never had to force myself to go to this class and never felt sleepy while in class. and believe me, that's a HUGE plus for me! I can fall asleep easily. lol", 
            "I had fun in this class. The class is focused on a chronological study of Persian poetic tradition. A very good survey course to start from scratch if you don't know anything about the topic. classes are interactive and fun. planning to take her modern lit course next spring!", 
            "A fair professor. I learned some fun stuff. But I wouldn't take again. I guess there's not a healthy atmsphr in her classes. Sort of a weird tension. Maybe it's just me though.", 
            "Out of focus in so many occasions and ruined my GPA. Thank you so much!"
        ], 
        "tags": {
            "Respected ": "6", 
            "Gives good feedback ": "5", 
            "Participation matters ": "2", 
            "Accessible outside class ": "8", 
            "EXTRA CREDIT ": "3", 
            "Caring ": "8", 
            "Hilarious ": "2", 
            "Amazing lectures ": "9", 
            "Get ready to read ": "3", 
            "Inspirational ": "8"
        }
    }, 
    "550572": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=550572&showMyProfs=true", 
        "score": "3.5", 
        "name": "Rose Malague", 
        "comments": [
            "She's a wonderful source for an actor to expand their gifts to new demensions never experienced before.", 
            "Definitely likes to play favorites--if you're not a theatre major or haven't acted in one of her productions, the bar is significantly higher for a good grade. She is incredibly arbitrary and makes up the syllabus as she goes along. We often receive large assignments with less than a week's notice. The most unprofessional prof I've ever had.", 
            "Dr. Malague is extremely animated and passionate about theatre. Not only is she an actress herself, but she is also extremely down to earth and interested in every word that each of her loyal students utters. A definite must for all students with an interest in theatre history.", 
            "Rose has her own agenda and isn't above playing favorites.", 
            "Great!", 
            "has a weird persona - is prone to snap when pushed", 
            "It depends on your personality whether you'll find her to be BS or not; she focuses on actor-actor connection and objectives excessively, but tries to blend theory and practice pretty successfully. Good intro course if you don't clash with her; I expected at least a B+ or A- but got a B in the class"
        ], 
        "tags": {}
    }, 
    "1014872": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1014872&showMyProfs=true", 
        "score": "3.5", 
        "name": "Robert Hollebeek", 
        "comments": [
            "GOOD TIME", 
            "Professor Hollebeek is an amazing professor. He spends a great deal of time into working with his students. Although class sometimes can get monotonous, he always tries to make the physics as interesting as possible.", 
            "Prof. Hollebeek is one of the best teachers at Penn. Don't believe what other people had said. He is very helpful outside of class. Some may complain b/c he gives a lot of quizzes, but at the end of the day you will realize it actually helps you score better in the exam. If you really want to learn physics take his lecture!", 
            "Avoid him like the plague. THE PLAGUE!", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "498311": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=498311&showMyProfs=true", 
        "score": "4.0", 
        "name": "Hocine Fetni", 
        "comments": [
            "Dr. Fetni is an amazing professor. His ideas are inspirational and he encourages different opinions and perspectives in class. He's very accessible outside of class; a lot of us dropped by at his office to discuss course materials of general political matters. There'd be a lot of readings, but he would cover all the content in his lectures anyways.", 
            "HE IS THE BEST", 
            "enthusiastic in teaching and humorous in giving examples.", 
            "Unbelievable! So intelligent and loves to share his knowledge. Comes from Algeria and had a horrifying childhood, lost multiple family members but still worked to become one of the best professor's at Penn.", 
            "Interesting Professor, interesting person. Encouraged questions unlike other Upenn Prof., which many won't even let you ask them, you have to ask their grad students. Also answered questions ranging on all political topics.", 
            "This guy is the greatest.", 
            "the best in penn university", 
            "Dr. Fetni is a very knowledgable and remarkable professor. Although he is a practicing attorney, he knows how to circumvent leagalese in layman terms. This is a class you should take!", 
            "I took an international law class at drexel which he was teaching.I really liked him and I thought he was an amazing professor, although some of my classmates were upset by his \"cockiness\" .. he expects people to be ontime and work hard, but regardless hes a great professor who encourages discussion", 
            "Dr. Fetni's awesome. He taught me in the first class I took at Penn. It was a night class and he kept our energy up with interesting side-stories to the subject matter. He would make you defend your opinion without belittling you, or making you look foolish - not so with some Penn Profs...", 
            "Interesting lectures, likable guy; workload reasonable; likes punctuality, but also professionalism; knows his stuff.", 
            "advised me when i was a pre-freshman. he told me i must take all pre-med classes if i had the slightest inkling of interest in medicine. that was after yelling at me 10 min for being 5 min late to MY meeting. it was my first time on campus. i didn't pay for advice on punctuality azz. do ur job."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Tough grader ": "1", 
            "Accessible outside class ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "312233": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=312233&showMyProfs=true", 
        "score": "4.7", 
        "name": "Jacqui Sadashige", 
        "comments": [
            "It is important to pay attention in class because sometimes contradictory instructions are given on the website. It is also very important to stay on top of your work and to get a clear understanding of the assignments given.", 
            "I had the pleasure of taking several classes with Jacqui, who is the most engaging prof I had at Penn. That being said, her brilliance is matched by her beauty and seductive energy - it boggles the mind as to which outweighs the other. Jacqui puts the T&A in T.A., if you catch my drift.", 
            "GREAT PROFESSOR. INTERESTING SUBJECT MATTER. NOT MUCH WORK REQUIRED.", 
            "No Comments", 
            "Jacqui is awesome! She has great outside stories and really gets a chance to relate to you. You get to hear a lot about her Friday nights, but she leads an interesting lifestyle, so you'll enjoy them. Plus, the class is interesting and easy."
        ], 
        "tags": {}
    }, 
    "721101": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=721101&showMyProfs=true", 
        "score": "2.5", 
        "name": "Bob Perelman", 
        "comments": [
            "He was good at contextualizing the poets (I'm sure he's had relations with many!) but you must get him to talk about his own poetry...those are the really cool moments. Not too intellectually rigorous though.", 
            "Professor Perelman is a very smart man, and it's clear he gets caught up quite a bit in what he's thinking. The problem is that he is below average in translating what he's thinking into something that makes sense in the classroom. The thing that kept me awake in his class was listening for the inevitable gem that would come out once per class.", 
            "Boring.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1554557": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1554557&showMyProfs=true", 
        "score": "4.9", 
        "name": "Jane Willenbring", 
        "comments": [
            "Jane is one of the, if the the best teacher I have ever had, you will succeed in her classes unless you intentionally work towards failing", 
            "Fabulous professor, brilliant woman...and super helpful. I went to this class worried about the requirement and am leaving it really interested in geology. My fave course this semester.", 
            "Dr. Willenbring is the best! She is super inspiring and in the class she talks about all the good parts of Geology and none of the boring stuff. Def my favorite class this term. Have to go to class during the add period though.", 
            "Easily the best professor I have taken in my freshmen year at Penn. I learned quite a bit even though I don't really care about the subject. Although this class isn't easy, if you pay attention and read the book an A is attainable. I thoroughly reccomend taking her class.", 
            "She was great! Very funny and super helpful. I was dreadding this requirement but I'm really glad I took it."
        ], 
        "tags": {}
    }, 
    "840405": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=840405&showMyProfs=true", 
        "score": "2.6", 
        "name": "Julia Lynch", 
        "comments": [
            "Challenging, but all-around awesome! You learn a lot from Professor Lynch. She's really smart and she makes class fun!", 
            "Prof. Lynch was a great prof for PSCI 009 Politics and Society in Italy. I'm looking forward to taking more classes with Prof. Lynch in the future.", 
            "No Comments", 
            "The class was far too obscure and difficult, with the grading being incredibly harsh. Assignments were often unclear or too broad, the final covered a vast array of material at an incredible level of detail that made it very difficult to study for. In sum, it took up an inordinate amount of time and was almost impossible to get a good grade in.", 
            "horrid"
        ], 
        "tags": {}
    }, 
    "542640": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=542640&showMyProfs=true", 
        "score": "4.3", 
        "name": "Andrew Lamas", 
        "comments": [
            "Open my eyes", 
            "Lamas is interested in real critical social work - not anti-intellectualism. Some students became frightened when he threw out the syllabus - if you are at school simply for the \"credentials\" then save space in the class for those who will actually benefit. I will reference Lamas and the work we did probably forever.", 
            "He is a very different type of professor than most others I've had at school so far. He is very passionate about community development and cares a great deal about his students. When it comes to grading he is more than fair. If you are at all interested community development I recommend you take his class.", 
            "An inspiring and brilliant man who is extremely dedicated to helping students find innovative solutions to societal problems. His course will give you a taste of an authentic education.", 
            "While he is a great thinker, persuasive and great at encouraging students to push their limits... he is extremely condescending and at times hurtful. But, he will throw out the syllabus, which at times can be horrible or awesome, allowing for more creative forms of work - like multimedia submissions... its a toss up!", 
            "This is an awesome class if you are interested in learning, especially free-form learning. Andy has many resources, and is a creativeflexible instructor. He is also demanding: he expects you to bring as much passion to the work as he does. I highly recommend his class if you want to cultivate your intellectual awareness and opinions of the world", 
            "This class offers plenty of interesting material, some flexibility. Its often engaging;sometimes a bit overwhelming. Professor Lamas pulls in incredibly interesting sources; at times it seems like too much, at other times it seems like a miracle to encounter such gems. Discussions can be feisty; students are encouraged to take risks.", 
            "Expectations were not clear and constantly changing. He was insulting and condescending, and though I liked the way he encouraged us to do real-wold policy projects, the fact that he threw out our syllabus left me totally unprepared for future coursework in policy. By the time he started warming up to us, it was too late. Worst class I ever had.", 
            "I was skeptical about his teaching style but I learned tremendously from prof Lamas. He made me want to go to class and awoke my appetite for learning. If you want to be challenged academically and intellectually take his class.", 
            "One of the best, most unique approaches to \"macro\" social work. I really appreciated how he tied in so many different aspects of what is important in life in order to build community capacity. Andrew Lamas is a hero.", 
            "Wonderful prof. Kind, caring, insightful. My best one at Penn"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "628285": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=628285&showMyProfs=true", 
        "score": "4.4", 
        "name": "Santosh Venkatesh", 
        "comments": [
            "He is simply the best professor I have ever had. An interesting, rigorous introduction to probability from both a mathematical perspective and a historical perspective. - Penn Student", 
            "Lectures are lengthy but engaging. Each class is a wealth of insight in probability. Pay attention and there is almost no need to read the book to understand the topics and do the homework. The clarity with which he delivers the material is inspiring. Homework usually requires careful thinking, but never impossible.", 
            "Excellent, engaging and brilliant professor. Makes statistics interesting through use of important historical events and stories. Book due out soon, \"The Goddess of Chance\", Oxford University Press. Outstanding Prof!", 
            "Don't take too many notes. Just get the formulae from the book and listen to Santosh's lectures. He is brilliant.", 
            "Extremely good at lecturing on tough material. Brings a real excitement to a tough and generally dry field. Hands out a very significant amount of work though. Be prepared to bust your butt.", 
            "excellent, excellent teacher! Very clear and well prepared class material. I'm in grad school now, and I make frequent reference to the notes I took while in Santosh's class.", 
            "Not a good professor. Stay away from his class."
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Lecture heavy ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "1102509": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1102509&showMyProfs=true", 
        "score": "3.2", 
        "name": "Robin Pemantle", 
        "comments": [
            "Great teacher, always accessible to the students.", 
            "Very smart guy, but a poor teacher. Problem sets are interesting and the text book is great. His classes are not that useful -- read the book. When you are stuck, he'll figure it out in an instant.", 
            "Way hard, but always willing to give you extra help!", 
            "The worst math teacher i have EVER HAD. His students have an exam average of 13% less than the other teachers.", 
            "The lectures were about average. Dr. Pemantle gets really involved in the material, which sometimes means overly complicated, obfuscatory examples."
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Caring ": "1"
        }
    }, 
    "1304015": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1304015&showMyProfs=true", 
        "score": "2.5", 
        "name": "Jenine Maeyer", 
        "comments": [
            "Lab was very straightforward. Jenine and her TAs make the material easy to understand and are effective communicators even if there's a language barrier. They aren't trying to trick you. They want you to understand lab safety and give you everything you need.", 
            "Super disorganized. She's constantly pushing around due dates to a point where it's ridiculous. Also, written exams don't necessarily seem to correlate to what is covered in lecture and lab... otherwise, her lectures are actually good and she seems to care. Just not very organized.", 
            "Completely disorganized. Takes off points for no reason. Probably couldn't pass her own class because she doesn't even have a rubric.", 
            "She is totally disorganized. Not clear with due dates. Practical exams and written final is on topics you barely discuss.", 
            "After a year of her courses, I can safely say Jenine Maeyer is the worst professor I have ever had. Take NOTHING for granted in her classes. Read and understand the lab procedures (they will have errors), and Google everything--she lifts stuff straight from the web. If she says X won't be on the exam, study it anyway, because it will be.", 
            "She is the closest to a which in the 21st century. She makes things in \"pots.\" She is also a terrible teacher. She gave me a C.", 
            "Easy to understand. Straightforward.", 
            ""
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Tough grader ": "2", 
            "Caring ": "1", 
            "Clear grading criteria ": "1"
        }
    }, 
    "204559": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=204559&showMyProfs=true", 
        "score": "4.8", 
        "name": "Randall Collins", 
        "comments": [
            "Collins is a genius. Clear and engaging lectures with good PPT--and he has good sense of humor and solid wit--keeps it fun and fresh. Read about a book a week. Started with theory--Norbert Elias, \"The Civilizing Process,\" Collins, \"Interaction Ritual Chains,\" and Wounters, \"Informalization,\" --then a number of interesting ethnographic books.", 
            "Collins is a world-class professor and scholar. He brings the material to life through his lectures. Truly inspiring.", 
            "At first he appears to be kind of a crazy old man, but he is a hilarious genius. He manages to keep even the driest material amusing and interesting, and all the while I find myself liking him more. The level of difficulty is really dependent on the TA. Ask him about the novel he wrote about Sherlock Holmes.", 
            "No Comments", 
            "Amusing and highly intelligent. Straight forward teaching style and if the class is slow its definately the material more than the prof."
        ], 
        "tags": {
            "Respected ": "1", 
            "Get ready to read ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "521985": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=521985&showMyProfs=true", 
        "score": "4.3", 
        "name": "Craig MacKinlay", 
        "comments": [
            "Awesome class. Easy A!", 
            "Professor MacKinlay was the best professor that I had at Wharton. He made corporate finance very clear and relevant. I was pursuing an accounting major before taking his class and decided to switch to a career in banking after taking the course. He really is a captivating professor.", 
            "No Comments", 
            "Great class, Prof MacKinlay is a superb lecturer and provides excellent examples for clarity.", 
            "Very good class and prof, highly recommend taking him; he gives out a lot of previous exams to study from in the bulkpack"
        ], 
        "tags": {}
    }, 
    "1179391": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1179391&showMyProfs=true", 
        "score": "4.6", 
        "name": "Bruce Boylston", 
        "comments": [
            "Great teacher! I wish he would teach more classes!", 
            "The best professors at University of Pennsylvania that teaches accounting!", 
            "Keep up the good work Dad!", 
            "Ur the best professor that I've had at college so far!", 
            "Tough to keep awake. Brings soft pretzels to class. A lot of work before class begins.", 
            "A lot of work even before the classes begin", 
            "Professor Boylston is a nice man! He gives out good grades for us in class.", 
            "Professor Boylston cares about the content of the course and is well prepared"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1"
        }
    }, 
    "222545": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=222545&showMyProfs=true", 
        "score": "1.4", 
        "name": "Donald Voet", 
        "comments": [
            "I had the misfortune of having him for both intro chemistry and biochemistry...I should have just taken biochem with the Biology department. Terrible professor, completely unhelpful, reads verbatim from his textbooks (that you are required to use for Biochem), and recycles tests, making cheating rampant. I'm surprised he's still teaching.", 
            "When I went to Dr. Voet's office to ask for help on a topic that I did not understand, he literally told me to \"go figure it out\". He teaches because he has to; he does not care about his students. Take this course with another professor!!", 
            "He was the boringest professor I've ever had.", 
            "Worst professor ever - he simply repeats verbatim the book that he wrote but the book sucks and is really confusing and unnecessarily detailed. i like how he wants you to understand big picture ideas but he SUCKS at explaining that - both in lecture and in the book. avoid him at all costs", 
            "His class made me hate chemistry so much. He makes it seem easy in lecture and then he pulls out ridiculous tests.", 
            "literally wants you to fail. only reason i did well in this course is a fantastic ta. dont even bother going to lecture.", 
            "I honestly believe Voet teaches awfully on purpose to give kids bad grades in the class. Learn his tricks fast. Ignore anything he says in lecture and study only the book and the Logan's Notes. He'll try to trick you into thinking that you need to know a thousand formulas. Don't listen!", 
            "He aggressively sucked.", 
            "I agree. This guy really made me question my decision to pursue a chem major. He should not be teaching. I took a lot of classes at Penn and he was the worst teacher I had...by far!", 
            "I hate his guts too!!", 
            "I had this guy 4 years ago when I was freshmen at penn. All I can say is this guy is like a good hazing for potential pre-meds. He's pretty terrible. So if you can get by with him, you might be able to survive a lot of things in life.", 
            "Voet is definitely the worst prof I had at Penn, and I have graduated already! He should not be teaching! It is clear that he teaches only so that his research will be funded -- not out of concern for his students.", 
            "Everyone hates this man. Penn should fire him. Seriously.", 
            "Worst prof ever.", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "worst teacher ever! i hate his guts!"
        ], 
        "tags": {}
    }, 
    "1515590": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1515590&showMyProfs=true", 
        "score": "4.8", 
        "name": "James Giles", 
        "comments": [
            "Great teacher, explains everything well and goes beyond the lesson to impart other important tidbits of information on the class.", 
            "Excellent teacher who brings a career of experience and knowledge to the classroom and greatly enhances the helpfulness of the course.", 
            "LT Giles did a great job teaching us what was need to be known. A power point heavy class but it was the best way to teach all the information needed. He brought in other people in the Navy and Marines to teach specific subjects of their field. Great class, learned a lot.", 
            "LT Giles does a great job making sure the students learn the most important aspects of being in the Navy. He is very helpful and very practical.", 
            "I can tell Lt. Giles is very experienced and he makes the knowledge very easy to understand. His class is very useful, I only expected to learn a little more about the other Navy communities.", 
            "Great teacher. Explains things well and a very enjoyable class.", 
            "LT Giles is a great professor and has some ridiculous \"sea stories.\" Great, informative class.", 
            "He is very informative and is always ready to discuss current events. He will teach you exactly what you need to know, because he has experienced much of it himself.", 
            "Very Intelligent, he tells you exactly what he expects and wants you to know.", 
            "great teacher, lots of experience in the Navy and knows what he's doing. Keeps the class interesting and starts class the same way with current events on most days.", 
            "Good teacher, knows what he's talking about when it comes to Naval Science.", 
            "Great class and teacher!", 
            "Very helpful and knowledgeable on everything we did.", 
            "Good class, too early!", 
            "I agree with the rest of the comments. He is an excellent teacher, I really enjoyed this class!", 
            "LT Giles is very knowlegable and really knows how to keep a class interested. Highly recommended!", 
            "He's not even a full professor and he's the best teacher I've ever had.", 
            "Great class! Very interesting teacher!", 
            "Very good instructor. Too many powerpoints, but not really his fault."
        ], 
        "tags": {}
    }, 
    "326229": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=326229&showMyProfs=true", 
        "score": "4.1", 
        "name": "Don Berry", 
        "comments": [
            "Great professor, makes complicated material easy. He's great in office hours. If you are pre-med, take chem 102 with him!", 
            "Had this guy for Major's Section. Don't take it, he makes everything harder than it really is. He co-taugh with Park, who cannot speak English for the life of her. His sense of humor is not for all and his approach to things is definitely not for everyone. The test are fairly hard and you can make mistakes easily. So take regular.", 
            "No Comments", 
            "Fun teacher", 
            "This man may be one of the funniest teachers I have ever had-it was a hard class, but I learned a lot that I needed later on. who cares if white powders (organic) cure cancer- inorganic has colors!"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "1551168": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1551168&showMyProfs=true", 
        "score": "2.0", 
        "name": "Anthea Butler", 
        "comments": [
            "In the two classes I've taken with Professor Butler, I have adopted a new passion and appreciation for RS at Penn. She is intuitive, openminded, and considerate on towards all students (as long as you are respectful and go to class!!!). She is passionate and involved with what she teaches. She is helpful with assignments and exams.", 
            "She is more interested in imposing her opinion and making sure white guilt is felt than actually teaching anything. Made consistent errors that could be pinpointed by her students and took herself so seriously that she would get angry if you questioned her and would insinuate that racism/sexism was the \"real\" reason why you raised a question.", 
            "Not good at all :/", 
            "Pathetic. This teacher is pathetically bad at her supposed job. Do not give this untalented instructor any more classes. Bad.", 
            "its an embarassment to the RS department that this loudmouth idiot with crazy Don King hair is the head chair. Worst Professor ive ever known or heard of. her opinions are poorly substantiated and academically unsound to say the least mostly due to her afrocentric presuppositional bias which makes her narrow-minded.Avoid her at all cost!", 
            "She is an awful teacher who thinks that she knows everything when half of the time she is making mistakes in the names of the things she is trying to teach! I'm a student and even I can see her mistakes! She takes herself way too seriously, and her TAs are awful! Her and her TAs are very harsh graders, beware!"
        ], 
        "tags": {
            "Tough grader ": "3", 
            "Skip class? You won't pass. ": "3", 
            "Lecture heavy ": "2", 
            "Hilarious ": "1", 
            "Caring ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "1553207": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1553207&showMyProfs=true", 
        "score": "1.9", 
        "name": "Lara Krawchuk", 
        "comments": [
            "Not a star professor ... Mediocre instruction. A true disappointed.", 
            "Seems nice but isn't really. Becomes angry and condescending when people disagree with herself. Is EXTREMELY dismissive. Bills herself as a ''grief and loss' expert'''; she has an esteemd mentor who allows her to write in his books but hadn't published/researched on the topic. Low quality instruction. offers \"help\" but too \"busy\" to offer it...", 
            "She only knows about medical social work, as that's all she has ever done. If one wants a well- rounded orientation to Advanced Clinical Social Work, it would behoove him or her to take a more well-rounded and knowledgeable professor. I literally had to fact check everything she said...", 
            "Mediocre instruction. She is all over the place and lacks \"conceptual clarity.\" At the end of the semester, most students stated that they felt as if they were not grounded in theory and therefore unprepared for the profession. Students of other clinical professors felt MUCH more prepared.", 
            "Just began this semester and am loathing this class... I have a BSW and liked social work before attending her class. I learned more at the BSW level; she isn't challenging me or making the subject interesting. Please DON'T!", 
            "teaches at a VERY basic level, for example, only says one general statement about slides and is not one for detail. as a result, she does not cover the material/content well. she expects students to read (since she can't teach...) but does not discuss the readings in class! Perfect class for an easy A but not so perfect for 'real' learning...", 
            "She's very nice and all but I could not stand her teaching style. She talked over students and kind of had a savior complex that was extremely annoying. She could be really disorganized as well and that was frustrating. I would not take a class with her again.", 
            "Very clinically oriented. Has private practice for grief therapy. Great at teaching clinical skills and very compassionate"
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Caring ": "2"
        }
    }, 
    "1158957": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1158957&showMyProfs=true", 
        "score": "4.7", 
        "name": "Nakia Rimmer", 
        "comments": [
            "The kid! Great, thorough teacher.", 
            "Prof Rimmer is a fixture within the Penn Math Department. I like him a lot, and had two classes with him, back to back. However, be forewarned - he is hard, and despite his easy-going lecture style, he is tough on certain mathematical pet peeves. Would only recommend taking him in an online course if very adequately prepared.", 
            "Literally am so sad that I won't be having him for all my math courses at Penn. He's a professor who actually likes to teach and wants his students to succeed. He's also willing to take any extra initiatives to make sure students understand the material.", 
            "Rimmer was an awesome professor! Honestly, if you don't do well in this class it's because you weren't really prepared to take it.", 
            "One of the best professors I've had at Penn! He really cares about his students and wants to see them succeed.", 
            "Great professor. Definitely takes time and effort in his work. He has so many resources that he lets students use so they can do well. He will always answer any questions you have. Tests are tough but lectures are always funny and entertaining. I would definitely recommend taking his class. Best math professor at Penn!", 
            "He's very dedicated to his teaching career.", 
            "No Comments", 
            "He is GREAT! His teaching actually makes you enjoy math. I want to continue taking courses with him.", 
            "I think he's great!!", 
            "I liked his teaching style a lot, especially since the material and text was so hard to understand. Unfortunately, he wasn't the person making the exams the year I had him, and the exams were common. So things got competitive. Then when it was time to do grade break downs a lot of my class had the same grade so every point mattered to the decimal.", 
            "He's a pretty cool guy. Definitely knows his stuff. He makes the occasional math error in lecture, but he's good about correcting himself.", 
            "Great Professor. Probably one of the best I've head at Penn. His lectures are cleary and he is extremely helpful. One of the few professors at this school that actually care about teaching."
        ], 
        "tags": {
            "Respected ": "4", 
            "Gives good feedback ": "2", 
            "Tough grader ": "2", 
            "Lots of homework ": "1", 
            "Hilarious ": "3", 
            "Caring ": "1", 
            "Amazing lectures ": "2"
        }
    }, 
    "935648": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=935648&showMyProfs=true", 
        "score": "4.8", 
        "name": "Erik van Erp", 
        "comments": [
            "he's super cool and funny. does this shrug when he's lecturing. helps if you ask and really knows his stuff", 
            "Best Math 104 Professor ever!! Doesn't care that students don't care about math and recognizes that its just a requirement so focuses on the practical stuff: Acing the final", 
            "Best math 104 prof!!!", 
            "Your examples were so clear and concise, I left every class glad that I was in your lecture and no one else's. Prof. Van Erp is a tremendous asset to whatever university he teaches at, extremely brilliant", 
            "VanErp is an excellent teacher, his lectures are clear and to the point. It is obvious that he cares about his students, by taking time to go over difficult areas of the curriculum with him. I would recommend him to all students.", 
            "Erik is the greatest MATH 104 teacher. Tells you only what you need to know for the tests. He's straight forward and he tends to summarize the lectures in steps (1,2,3) and reviews which is a plus in a class that moves in such a fast pace. You'll love his shrugs and humor. Still hate calculus but Erik rocks.", 
            "best professor to have for 104. only teaches what you need to know for the exam...other students in other sections would use my notes to study for their exams. ends class early alot too", 
            "He is a talented teacher.", 
            "Very clear teaching. Highly recommend.", 
            "He is very helpful, and basically teaches you everything you need to know to help you get an A on the final. He skips complicated mathematical proofs, etc. so kids taking math 104 for the love of math alone will be disappointed. Everyone else is happy. Because he genuinely wants to help you.", 
            "realizes that most people are taking this course to fulfill a requirement. doesn't give you any more information than needed to solve the problems. very good when it came to preping class for finals."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1"
        }
    }, 
    "43441": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=43441&showMyProfs=true", 
        "score": "2.0", 
        "name": "Nina Auerbach", 
        "comments": [
            "Brilliant", 
            "Great teacher!", 
            "No Comments", 
            "Weird but interesting", 
            "No Comments", 
            "bizaar - absolutely insane", 
            "The reason why I abandoned the idea of a career as an English academic. Honestly the worst professor I have ever had--a hack and a has been.", 
            "the agony", 
            "worst teacher at Penn", 
            "brainless and quirky. she should retire", 
            "dumb, scattered, tries to come across as eccentric", 
            "Brilliant but evil", 
            "she is an amazing professor, interesting and quite brilliant"
        ], 
        "tags": {}
    }, 
    "43442": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=43442&showMyProfs=true", 
        "score": "4.1", 
        "name": "Toni Bowers", 
        "comments": [
            "Boring and very restrictive in her approach.", 
            "Super nice person. At least in the class I took, I thought she relied too heavily on textbook readings, on quizzes, and on her TA. (The particular TA I had was a prima donna and made life unpleasant.) Maybe because it was only a sophomore-level class, but I thought the general feeling was more like high school than college.", 
            "Toni is just a lovely person and a very generous scholar.", 
            "No Comments", 
            "SHE'S AWESOME", 
            "Demanding but very friendly"
        ], 
        "tags": {}
    }, 
    "222553": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=222553&showMyProfs=true", 
        "score": "3.0", 
        "name": "William P. Dailey", 
        "comments": [
            "Dr. Dailey is one of the best science professors I've ever had in my life. He genuinely cares about teaching and wants students to truly learn and understand organic chemistry. The exams are challenging but manageable (if you spread out your studying, ask for help, and are really curious).", 
            "Complete and total... Fill in the blank", 
            "So interesting reading positive comments by students in this professor's case, especially the ones about being easy to approach and helpful. Then again, most of those also were written several years ago. Obviously, something has changed.", 
            "Absolutely awful. Has no interest in his students or their well being whatsoever. It's a huge disappointment that a university of the caliber of UPenn keeps an individual such as this on its staff. Clearly ignores the university's professed mission to be mindful of the emotional well being of its students and to recognize needs and provide support.", 
            "Amazing prof. Hands down the best chemistry professor I've had at Penn. I didn't think orgo could be a good experience, but Dr. Dailey makes it bearable (and almost enjoyable).", 
            "He's just terrible. Will go on and on about semantical nonsense, and makes test absurdly difficult. Why would you brag that most students make a 30-50 on your exams? If everyone misses it, the problem clearly lies with him.", 
            "Horrible horrible horrible. Takes pride in his in knowing he makes killer exams. So frustrating.", 
            "Wish I had gotten my act together sophomore year to fully appreciate Professor Dailey's teaching...second semester Ochem is a killer class but he made it tolerable. He genuinely seems to care about teaching, which is rare in Penn's chem department.", 
            "explains everything clearly in class and is very nice and open to questions.", 
            "Very clear and intelligent prof. I didn't think I'd like organic chem, but he changed my mind about it.", 
            "Ruined my 4.0", 
            "GOOD TEACHER", 
            "No Comments", 
            "he sucked.", 
            "Taught 2nd semester of organic chem which is TOUGH no matter who teaches it. Still, he was approachable and conduct lectures very organized. Available during office hours but need to do lots of problems to prepare for midterms. Study lots for any orgo.", 
            "one of the minority of chem teachers that doesn't completely suck"
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "3", 
            "Skip class? You won't pass. ": "1", 
            "Lecture heavy ": "1", 
            "Amazing lectures ": "2", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "925162": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=925162&showMyProfs=true", 
        "score": "4.7", 
        "name": "Mark Stern", 
        "comments": [
            "Professor Stern knows his history backwards and forwards and makes it applicable to future social workers. He's a kind individual who makes the subject come to life and obviously cares about his students.", 
            "awesome teacher. extremely knowledgeable.", 
            "Professor Stern is hands down the best teacher I think I have ever had. He is a true testament to what a student looks for in a teacher. He is dedicated to his material, and is extremely knowledgeable. On top of everything else, he just won teach of the year and has the genuine sense of humor - I never stopped laughing!", 
            "very organized, brilliant, and so sweet", 
            "No Comments"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Participation matters ": "1", 
            "Caring ": "1"
        }
    }, 
    "213109": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=213109&showMyProfs=true", 
        "score": "2.4", 
        "name": "Gregory Wolmart", 
        "comments": [
            "His laugh is the most annoying thing in the world and will drive you crazy. He also strays from the purpose of his conversation way too easily and takes much too long to get to the point of the discussion- if he gets to it at all. SO BORING. Save yourself and do not enroll in his class.", 
            "Strays from topic too easily. Spent too much time on film content and not enough time on critical writing analysis.", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "435141": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=435141&showMyProfs=true", 
        "score": "4.4", 
        "name": "David Grazian", 
        "comments": [
            "I just had Prof. Grazian Spring 2018 semester. He was very bubbly and energetic and clearly cared about what he was doing. I did all of the readings and attended most lectures and the material really sunk in. I will be shocked if I don't end up with an A or A-. Easy class that is enjoyable.", 
            "Dr. Grazian is first rate--I highly recommend him. He knows his stuff and them some! I took his Ethnographic Field Methods course. Reading load was no joke, but very valuable. It was a seminar course, so can't evaluate lectures. Awesome facilitator and thinker--super engaging and hilarious sense of humor. Take his course, work hard, enjoy!", 
            "He has a lot of knowledge about the topics he teaches, his lectures are very organized and clear, with up to date examples. His tests are only about what he taught in class or included on the readers. I still use the books he recommended for other classes and I had a lot of fun during that semester.", 
            "Professor Grazian made me see the light... before I had no Idea about how I should dress up before going out on the town... he helped me find my nocturnal self and since then I never go out without a hot outfit on. I also order my steaks medium because I now know that cooks creativity and artistry is limited by the context of their job. luv u Graz", 
            "great reading and very interesting paper topics.", 
            "Very fun teacher!", 
            "Loved this class - particularly how DG highlighted the key aspects of the readings using examples. Warning - if he asks you what the capital of Thailand is, DO NOT ANSWER.", 
            "No Comments", 
            "Grazian was always entertaining, particularly when talking about the Chicago blues. Don't miss his pop culture class, where the readings range from Texas high school football to talk shows to Durkheim."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "So many papers ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Hilarious ": "1", 
            "Caring ": "1"
        }
    }, 
    "139297": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=139297&showMyProfs=true", 
        "score": "4.5", 
        "name": "Kent Smetters", 
        "comments": [
            "Prof Smetters is a talented lecturer and very smart. However, he's terribly inaccessible. I tried several times to talk with him and he always told me he was too busy (he did not provide office hours)He was also unavailable during class breaks (as other profs have been). I believe a prof is more than a lecturer so I must say he's not a good prof.", 
            "Great prof, sucks that he doesn't teach the entire class.", 
            "Best teacher I've ever had...hilarious - no one is safe when Smets gets on a role. Makes a boring class one you have to go to.", 
            "funny; smart; good prof", 
            "His jokes kick ass - cool guy"
        ], 
        "tags": {}
    }, 
    "133446": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=133446&showMyProfs=true", 
        "score": "3.2", 
        "name": "Rita Barnard", 
        "comments": [
            "Terrible experience with this professor, despite being a top student in my other courses. Treats students according to how smart she thinks they are. The smarter she thinks you are, the better she will treat you. Very snobby. Will make judgments about you based on where you're from and where you went to school before & will treat you \"accordingly.\"", 
            "Intellectually snobby, plays favorites, and is dismissive of the majority of her students. Is also highly inappropriate and rude at times. Most lectures are tedious and irrelevant. AVOID!", 
            "Brilliant but terribly disorganized and erratic. Very little feedback on written work. Some lectures were great; the vast majority were only so-so. If you are not a film or english major, you may find her problematic.", 
            "She's a moron. Not only is she a blathering idiot, she says things that are beyond politically incorrect and offensive... only to laugh them off. She's horrible.", 
            "Truly original, and lovely human being.", 
            "Very enthusiastic, helpful, and accessible", 
            "Brilliant but has been known to play favorites. Also seems to have chilly relations with some colleagues (important if you want to use her for a reference or to back an application).", 
            "Brilliant, accessible, and a hot dame"
        ], 
        "tags": {}
    }, 
    "633277": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=633277&showMyProfs=true", 
        "score": "2.8", 
        "name": "Herman Gluck", 
        "comments": [
            "He's even worse than last semester. Doesn't prove anything that can't be done by just drawing a picture. By not proving anything he can keep a very fast pace, but keeping up with the textbook is impossible (unless you don't want to understand proofs i.e. you don't want to understand at all). Please go teach undergrads as they don't want rigor.", 
            "A problem with the course is assigning so much homework that there isn't enough time to read the text. This is a problem, because of the lack of rigor. For someone already familiar with the material, I would guess the course is pretty ideal. For everyone else the course is far from it. The 2nd year grads also seem to either love it or hate it.", 
            "My favorite course this semester! The class covers too much material to go through the proofs in class, so we spend most of the class time with examples; proofs are assigned as homework reading or exercises. (There are good proofs in the literature but few good examples!) Decent lecturer. Looking forward to 601!", 
            "Gives no definitions and very few rigorous proofs. Ignores the fact that a 1st year graduate course in differential geometry is supposed to teach tools and techniques with the goal of being able to use them in other fields. His course is equivalent to teaching grad cosmology out of Hawkins' A Brief History of Time. Useless and worst course ever.", 
            "When I had Professor Gluck, he took particular care to make sure that every student understood what we were learning. I thought he was excellent.", 
            "really nice guy, tries to keep class animated, but just not possible with the material"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "372445": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=372445&showMyProfs=true", 
        "score": "2.6", 
        "name": "Terry Adkins", 
        "comments": [
            "Professor Adkins is generous and intelligent. H is always there for serious students. His interdisciplinary approach to his own work is exemplary of the ideals of the program at large. Those who have studied under him have gone on to do great things in art.", 
            "Arrogant Arrogant Arrogant", 
            "Terry is a wealth of knowledge and a valuable tool!so EXPERIENCED.", 
            "Terry is caught up in his own ego and mirroring it on his students rather than teaching. His courses seriously lack planning, a syllabus and a critical dialogue which overall does not constitute a challenge whatsoever...that is if he attends his own class. Don;t take ANY of Terry Adkins' courses!", 
            "No Comments", 
            "sucks"
        ], 
        "tags": {}
    }, 
    "131530": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=131530&showMyProfs=true", 
        "score": "3.9", 
        "name": "Zoltan Domotor", 
        "comments": [
            "What a champ. Wish he was my dad.", 
            "HOW COULD ANYONE GIVE BIG Z A POOR RATING??? Philosophy of Space & Time was a cool class and Zoltan was hilarious. Class isn't hard at all either, though there is a bunch of annoying memorization. Interesting material though.", 
            "Excellent prof with a great sense of humor, he takes great interest in his students", 
            "I loved this class. Prof. Domotor is very funny, actually, and if you get logic, the course is a real breath of fresh air. I took it as an elective, and I couldn't bear to drop it, so I sacrificed an English credit for it!", 
            "Extremely clear.", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "This class was so dull, putting it after lunch was tortuous. Domotor is impossible to understand, and his TAs couldn't make it any clearer. His melodic drone is a good cure for insomnia, though."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "412130": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=412130&showMyProfs=true", 
        "score": "3.7", 
        "name": "Heather Love", 
        "comments": [
            "She is hyper political and she gives her dumb acolytes higher grades than smart regular students. She plays politics above merit.", 
            "Heather is brilliant and amazing", 
            ":)", 
            "No Comments", 
            "No Comments", 
            "Heather is brilliant, young, fun, amazing...and HOT."
        ], 
        "tags": {}
    }, 
    "1303135": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1303135&showMyProfs=true", 
        "score": "4.6", 
        "name": "Yechiel Schur", 
        "comments": [
            "Dr. Schur is a virtual einstein. How Penn ever landed such a professor I'll never know. He deserves instant tenure. Taking his class is an experience that everyone should have at least once in their lifetime.", 
            "Wonderful class! I love Dr. Schur!!!", 
            "Good class! I adored Dr. Schur then, I still do, and always will!", 
            "Dr. Schur is a phenomenal professor. Great class!", 
            "Dr. Schur presented \"Death in Medieval Judaism and Christianity\" very well. I like how he did not require additional research for the final exercise. I would happily take this class again!", 
            "Excellent class!", 
            "Dr. Schur is the type of professor you expect to encounter at an ivy league university. He is professional, efficient and has an acute attention to detail. Dr. Schur is friendly without being a people pleaser and an eloquent speaker with no trace of arrogance. Exceptional instructors and intellectuals like Dr. Schur are seldom found in academia."
        ], 
        "tags": {}
    }, 
    "153813": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=153813&showMyProfs=true", 
        "score": "4.1", 
        "name": "Arthur Waldron", 
        "comments": [
            "Waldron is absolutely superb. As far as professors go, he is intensely warm to his students -- his office hours are absolutely fantastic.", 
            "Arthur Waldron is a sweet professor interested in the history of himself. Each lecture, we spend around 45 minutes discussing an anecdote about his schooldays in England and the next 45 on the lecture, but only in the most indirect way possible. His syllabus claims rigorous analysis but his lecture style is anything but.", 
            "One of the best professors at Penn.", 
            "very interesting and smart guy", 
            "really interesting material. he's an interesting speaker, but he seems pretty unavailable to students compared to a lot of other profs", 
            "a lot of work but great, informative class"
        ], 
        "tags": {
            "Respected ": "2", 
            "Lecture heavy ": "1", 
            "Get ready to read ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "1119531": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1119531&showMyProfs=true", 
        "score": "5.0", 
        "name": "Meta Mazaj", 
        "comments": [
            "I loved this course. It was challenging but not hard. Pr. Mazaj would always have very interesting thoughts about philosophy, film, and society. She kept me awake the entire semester even though it was a night course. I would totally recommend her.", 
            "Super nice professor, always inviting for a conversation, but most importantly loves what she teaches. All course materials were relevant and engaging, even though some of the films were not super awesome. World Cinema was amongst the best courses I had this semester, full credit goes to Pr. Mazaj.", 
            "Amazing professor. She's always on time, love to engage in and out of class, and thrives on what she teaches. The course was of particular interest to me but even for non-majors I would recommend this course. Notes were clear and she responds to her emails within 4 hours most of the time. Absolutely awesome professor.", 
            "Pros: super nice, blazing fast email replies, and very accessible. Lectures are polished and intriguing. Very engaging and provides a lot of info about grades, notes, etc. Truly interested in her field and lives her classes. She's incredible! Cons: not all the chapters had a vocabulary sheet.", 
            ""
        ], 
        "tags": {}
    }, 
    "2132145": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2132145&showMyProfs=true", 
        "score": "4.7", 
        "name": "Welton Chang", 
        "comments": [
            "Provided very interesting perspective to students in the class from an extensive and unique background experience, which made the material very engaging. Converses often with students to help them grasp and think critically about what is covered. Overall, great experience, and would recommend the course and the professor.", 
            "You had to show up at least for the presentations and the weekly quizzes; the rest, you could miss and still do fine in the class. It was definitely necessary to do the readings in order to do well on the quizzes. The information was interesting, but the lectures could get a bit slow and repetitive at times, and it was often easy to just zone out.", 
            "Welton was pretty good!", 
            "Political Psychology was by far the most interesting class I took this semester and Welton Chang definitely played a role in that. He made the material interesting and engaging. It wasn't an easy class but I never felt lost or too confused because the professor and the TA were both very responsive and helpful.", 
            "Welton is very knowledgeable and passionate about Superforecasting. He also has a fascinating background (spanning both the public and private sector), and uses it to develop interesting simulations. Hes also very friendly and approachable. He gives great advice, and I wouldnt hesitate to take a course by him again. I hope we stay in touch!", 
            "Welton was my TA/associate professor for the MGMT276. Welton has an awesome background in intelligence and was able to make any topic interesting. Welton was also extremely easy to work with, and always provided relevant and easy to understand help when asked. Welton was an excellent professor!", 
            "Welton went above and beyond to make the power points enjoyable by finding humerus comics or cartoons that were based on the information we were learning. He also had a very impressive range of skills and could offer helpful feedback for all of the group discussions. Welton had a very well respected opinion.", 
            "Welton was a great TA for MGMT 276. He has interesting ideas and challenges students to approach forecasts in new ways. I appreciated his feedback throughout the class; discussing ideas with him helped me to refine how I think about problems.", 
            "Welton is supportive, accessible, and overall a great pleasure to learn from.", 
            "Welton had a lot of worldly knowledge and experience to draw from to make class more interesting. He was also really understanding of personal conflicts that came up for me during the semester.", 
            "Welton was extremely helpful throughout the course. When I was having trouble with group assignments he was understood and did his best to work with me. In class he helped students to see subject matter in a new way, through engaging activities.", 
            "Welton was a great as a teacher in the class this year. Firstly, due to thevalue his insights and expertise gave to students in a very specifc and competitive subject. But what was great about Welton, was the fact he was willing to discuss, and spend time, explaining his reasoning and forcasting methods to students. He created a welcoming environme", 
            "Brings his professional experience as a military intelligence analyst to the classroom in a very interesting way.", 
            "Really hands on with the students. Only wish he had more of him so that he could spend more time with everyone.", 
            "He was super helpful and definitely seemed to take a deep interest in the class.", 
            "Always had something constructive to say when help was requested. Responded to e-mails very promptly with specific and clear instructions where required. Assisted Professor Tetlock in the construction of clear and entertaining slides for the course.", 
            "really helped me to develop a more open mind and approach forecasting in a productive way", 
            "Depth of knowledge about US policy and international affairs adds value to class content", 
            "Welton was an extremely valuable part of my class experience. He often offered his knowledge as extensions of the material, connecting the in-class readings and discussions to his real world experiences. He was clear in class and via email, and highly responsive to any questions and concerns.", 
            "Very quality course, engaging as well. Welton made himself very available to answer questions and was open to opposing ideas."
        ], 
        "tags": {
            "Respected ": "19", 
            "Gives good feedback ": "21", 
            "Group projects ": "2", 
            "Participation matters ": "8", 
            "Hilarious ": "2", 
            "EXTRA CREDIT ": "1", 
            "Caring ": "5", 
            "Clear grading criteria ": "1", 
            "Inspirational ": "7", 
            "Get ready to read ": "3", 
            "Amazing lectures ": "4"
        }
    }, 
    "277891": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=277891&showMyProfs=true", 
        "score": "3.4", 
        "name": "Alan Charles Kors", 
        "comments": [
            "Great", 
            "Kors is incredible!", 
            "Great professor", 
            "amazing prof", 
            "One of the smartest people I have ever met. I really did not understand much of what was going on, but hoped that some of his brilliance would rub off.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Lecture heavy ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "129511": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=129511&showMyProfs=true", 
        "score": "4.6", 
        "name": "James Schlatter", 
        "comments": [
            "Wonderful and enthusiastic professor who listens to you and encourages your interests within the subject matter. Take any of his classes. You'll come away from them as a much richer person.", 
            "Dr. Schlatter is a perfect mix of serious and silly. His intro to acting class really breaks students of both their fear of public speaking and being embarrassed for trying to act. Everyone in my class made significant progress and were stage ready after just a semester.", 
            "Jim is an awesome professor but he can't use email worth a damn. Be sure to get everything you need from him in writing...", 
            "great storyteller"
        ], 
        "tags": {}
    }, 
    "1385246": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1385246&showMyProfs=true", 
        "score": "3.8", 
        "name": "Sanjeev Khanna", 
        "comments": [
            "Kind of intimidating.", 
            "great prof. would recommend", 
            "Extremely knowledgeable in his field. Always very helpful in class and outside of class.", 
            "Excellent professor. Hard grader and a challenging course (CIS320) but I learned a lot in a very short amount of time", 
            "Not just a terrible prof, a horrible person too. Condescending, insulting, and actually told one of my friends in the class that he should reconsider being a PhD student at Penn if he was struggling with Khanna's class. And the PhD student was just taking the class because he thought it would help him with research--he was an EE PhD."
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Tough grader ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "621002": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=621002&showMyProfs=true", 
        "score": "2.7", 
        "name": "Harvey Grill", 
        "comments": [
            "Great professor! Really cares about his students, their interests, and their intellectual development. Easy to approach.", 
            "He is very smart, but very scattered in the way he teaches.", 
            "No Comments", 
            "Took this class as a non-psych major. HORRIBLE idea - not the material, this man. AND the TA is horrible: wrong or no answer several times in Q&A. He OFTEN missed class, is arrogant, relied solely on bad powerpoints to teach. Did put ppoints (his waste of a class) online though... which was helpful.", 
            "Hilarious dry sense of humour, loves class participation. Might make you feel stupid for asking a question. Very distinguished researcher in his field. Lucy Faulconbridge is a super helpful TA."
        ], 
        "tags": {}
    }, 
    "1119357": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1119357&showMyProfs=true", 
        "score": "3.9", 
        "name": "Sigal Ben-Porath", 
        "comments": [
            "One of those classes where you can learn a lot if you put your mind to it. Thought provoking lessons in a laid-back environment. Do your readings to maximize what you learn.", 
            "Dr. Ben-Porath requires a lot, but the amount of work is worth it! I came to this class with 0 interest in Phil. of Ed.. Every week our discussions are so interesting that I find myself drawn to all of her topics. She replies to every reading response and provides prompt, useful feedback. Again, definitely recommend!", 
            "A sweet and wonderful teacher!", 
            "not good", 
            "Ben-Porath is smart, helpful, and a great teacher. She does especially well with seminar-type classes.", 
            "Sigal was unable to pull together interesting class discussions. Maybe it was the class size and not her fault, but regardless of fault it was not worth my money. She lectures, instead of tying things together. She also gives very little helpful feedback on the assignments.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "784381": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=784381&showMyProfs=true", 
        "score": "5.0", 
        "name": "Jeffrey Babin", 
        "comments": [
            "Professor Babin has been one of my favorite instructors at Penn. He is a charismatic lecturer who engages students through interactive presentation of the material. Babin motivates his students to interact in class through frequent group breakout sessions and guest speakers.", 
            "Great!", 
            "really great prof, makes class something you look forward to", 
            "Prof Babin seems intimidating but is more than willing to help his students in and outside of class.", 
            "a very good professor!", 
            "No Comments", 
            "One of the best profs I've had at Penn! Nice guy, very involved with students, tons of experience and guidance, will even introduce you to VCs and other entrepreneurs. Learned more in this class than I have in the last 2 years combined in both SEAS & Wharton."
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Participation matters ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "678353": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=678353&showMyProfs=true", 
        "score": "4.5", 
        "name": "Gregory Urban", 
        "comments": [
            "Dr. Urban is a wonderful professor. His lectures are interesting and very comprehensible. The tests are directly from lecture material (which can be found in online power points) as well as the reading material. The articles can be long and challenging, but overall Dr. Urban is excellent! I highly recommend his class!", 
            "This is the professor you wished you'd always had. He often quotes Pokemon cartoons and wears entertaining clothes. While the readings are only tangentially related to his lectures, his charisma made this class my favorite.", 
            "No Comments", 
            "Fun and interesting professor who always manages to engage his students to perform at the limits of their capabilities. One of the department gems.", 
            "great teacher - take his class even if you're a non-major", 
            "Enthusiastic without being annoying. Interested in teaching, very well organized, wonderful anecdotes along the way. Tests are fair and workload isn't impossible."
        ], 
        "tags": {}
    }, 
    "685129": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=685129&showMyProfs=true", 
        "score": "4.7", 
        "name": "Nedra Lexow", 
        "comments": [
            "Dr. Lexow challenged me as a thinker, made me overcome my fears of participation w/ her stimulating discussions, and instilled in me the pursuit of challenging literature reviews and peers. Dr. Lexow was present in all the stress and internal struggles I battled at the time, and supported me with passion, understanding, guidance, and maternal care.", 
            "Dr. Lexow's classes require a great amount of work to be done outside of class. Lots of reading/understanding of primary literature articles is required, and grades are determined based on presentation of deep analytical abilities with these materials. However, her classes are very rewarding - giving essential skills for the practice of medicine.", 
            "Dr. Lexow's seminar courses all have the same general format where you analyze primary literature about that week's topic. Most classes will then explore every aspect of that topic through class discussion. It is therefore imperative to thoroughly and critically evaluate all reading materials provided. You will literally be at the edge of science!", 
            "There is a reason why Dr. Lexow's classes have long wait lists each year. Her class taught me a range of skills that will be essential to me as I aspire to become an informed biomedical professional. I learned to comprehend and synthesize scientific literature with ease. There is a lot of work required each week, but it is highly rewarding.", 
            "Dr. Lexow is one of the best professors at Penn. Her classes require a strong background in neuroscience and she pushes her students to think critically about research and the current state of the field. Dr. Lexow gives great feedback and genuinely cares about her students. Id encourage anyone looking for a rewarding challenge to take her classes.", 
            "Dr. Lexow is one of the best professors at Penn. You do learn biology in her class, but she gives you so much more - she teaches you new ways of thinking about research and critiquing findings. You will come away a better thinker and a better scientist. Finally, she is an extremely kind and generous person. Penn is lucky to have her.", 
            "She is amazingly inspirational. Reflecting on many classes I took with her, she was an asset all the way! Amazing.", 
            "One of the best at Penn. Dr. Lexow inspired me to actually read and dive into the class. Paper writing could be a pain, but you were rewarded if you put the time in. She is very supportive outside of class.", 
            "Dr. Lexow is a really awesome teacher. She's very helpful, gives useful assignments, and grading isn't difficult. I learned a lot from the two classes I took with her and didn't have to do a ton of work. As I begin my career as a med student next fall, I am grateful that she taught me valuable skills that will help me succeed in the future.", 
            "Amazing! Dr. Lexow truly cares all while pushing you to do well. Her class was definitely one of the most profound learning experiences I’ve encountered. Material is always interesting and relevant, assignment are straightforward – put in the work & you will get the grade. She even takes the time to email you if you submit a thoughtful assignment", 
            "Nedra Lexow is hands-down the best professor I have ever had at Penn. She has high expectations, but her enthusiasm and passion are truly inspiring. Taking her courses was the best decision I ever made as a Penn pre-med and if you take one of her classes, you will want to take every class she teaches.", 
            "Before taking this course, I had a very limited scope on health care and medicine. She helps her students understand how research, marketing, and clinical practice all tie in together. Not only does she encourage her students to understand all possible perspectives, she gives us the tools necessary to make informed decisions. Thank you so much!", 
            "MY EXPECTIONS BEFORE THE CLASS WAS LOW. SHE MOTIVATED ME TO READ MORE ABOUT THE SUBJECT AREA. SHE IS SMART, AND MAKES YOU WORK FOR YOUR GRADE, SOMETHING I DON'T MIND DOING AT ALL. I LEARNT A LOT FROM HER. I WILL RECOMMEND HER CLASS TO HARDWORKING STUDENTS WHO WANTS APPROPRIATE REWARD FOR THEIR PRECIOUS TIME.", 
            "amazing", 
            "She is a very rare person. Brilliant, ethical and enthusiastic about her work. She expects you to read with an inquisitive mind and to always be anticipating new questions for science research. If you take her class- run with it! She is a rare find!", 
            "she's tough but fun", 
            "This class is very challenging but you learn alot from your research. People who don't like her style of teaching are usually people who don't like to work for their grades and want an easy A. Dr. Lexow is a great teacher, I would say one of the best!!", 
            "You get to learn about the most up-to-date topics in neuroscience!!!", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "3", 
            "Gives good feedback ": "3", 
            "Skip class? You won't pass. ": "1", 
            "Amazing lectures ": "1", 
            "Caring ": "2", 
            "Inspirational ": "3", 
            "Get ready to read ": "3", 
            "Participation matters ": "4"
        }
    }, 
    "264694": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=264694&showMyProfs=true", 
        "score": "1.1", 
        "name": "Kent Blasie", 
        "comments": [
            "The worst professor I have ever had and could ever imagine. He is a horrible teacher. When you don't understand what he is trying to say (you never will) and ask a question, he will act as if you are an idiot. And your grades on exams come down to pure chance, which didn't work out too well for me.", 
            "Do not underestimate the other negative comments! Armed with a hatred of students, a condescending manner, and a generally mean disposition, Blasie is also an awful professor. He turns simple chemistry concepts into complex gargantuan messes. He clings to a 15 year old slide show and a useless lecture pack. Try to avoid his CHEM 101 at all costs!", 
            "This is the worst professor I have had in my life. He ruined my once like for chemistry, made chemistry a living hell, and treated us like inferiors! I absolutely despised his class. this man should not be teaching. Everyone stay away!", 
            "Blasie has little care for his students. Pretty said don't show up to my office hour or else. Grading is done on a poorly formed rubric- very unfair. Teaches from a worthless \"lecture pack\" with no words! Make sure to attend class or else you're done for.", 
            "Blasie was totally disinterested in teaching ,and seemed to have a resentment for students and for them bothering him. Everyone was afraid to question anything, as he makes the person asking the question an object of ridicule. So rather than appear stupi", 
            "No Comments", 
            "This says it all: Blaise mocked students who showed up to his office hours for help. Very unclear in his presentation. He certainly had no love for teaching or concern for the future of chemistry, since he seemed peeved at having to pass along his knowledge to the next generation. I had him in '93!", 
            "Unhelpful, especially when getting caught up in his calculus derivations of formulas. Really condescending too. Bad bad class, bad bad professor."
        ], 
        "tags": {}
    }, 
    "122264": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=122264&showMyProfs=true", 
        "score": "3.4", 
        "name": "Americus Reed", 
        "comments": [
            "Started out good.", 
            "Dr. Reed is the best professor that I had at Penn. He's interesting, motivating and clearly passionate about marketing. I wish there were more professors like him on campus.", 
            "Dr. Reed is AWESOME! And he's so HOT!", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "357548": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=357548&showMyProfs=true", 
        "score": "3.5", 
        "name": "Talid Sinno", 
        "comments": [
            "He made the course particularly easy. And the assigned text was one that was easy to understand. He is clearly a very good professor.", 
            "Great professor. He did a good job of making the course easy. The assigned text was also easy to understand.", 
            "He will make you contemplate suicide.", 
            "hard class, moves fast. he will help you (if you nag him)", 
            "Transport is by far, the most work I've EVER had...cut us some slack! He tries to be helpful if you ask though.", 
            "transport graduate style, enough said"
        ], 
        "tags": {}
    }, 
    "1229798": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1229798&showMyProfs=true", 
        "score": "4.1", 
        "name": "Tara Trimarchi", 
        "comments": [
            "The class is one day a week for five hours. The professor's slides are text heavy and often have little to do with her questions on tests. The tests seem as if they are trying to trick you. You take tests based on lecture and your own self -teaching of other material. There are a lot of tests, all very hard.", 
            "Tara is amazingly smart. Be prepared to come to class and work your fingers off taking notes on her lectures. Her quizzes are hard and impossibly specific, but she tells you everything you need to know in class, if you can type fast enough! I recommend recording class, then listening to it back while filling in what you may have missed in class.", 
            "Prof Trimarchi is a fabulous prof! She is brilliant, but lectures clearly and not over her students' heads. She does everything possible to minimize anything that is anxiety-provoking, and is just incredibly nice. Her tests are hard but completely fair. I wish I could take more than just one class with her!", 
            "No Comments", 
            "difficult but interesting"
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1", 
            "Lecture heavy ": "1", 
            "Accessible outside class ": "1", 
            "Clear grading criteria ": "1", 
            "Get ready to read ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "268324": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=268324&showMyProfs=true", 
        "score": "3.9", 
        "name": "Peter Stallybrass", 
        "comments": [
            "Incredibly intelligent about his field. Has awesome stories and is super dedicated to his courses and his students. A bit scatterbrained but will be reasonable if he forgets to give an assignment, or will clarify if he forgets explain something. Awesome guy!", 
            "Love him. So warm and engaging. I didn't have a problem with the organization of the class. The course introduced me to a set of University resources I may have otherwise not known much about.", 
            "Great class- Peter's a genius. But he can be quite haphazard in his organization...", 
            "Peter is so engaged with so many different disciplines that you can't help but share his fascinations. He was stellar. Grads, be nice to undergrads. We didn't just wake up as grad. students one day (well, I suppose we did, but a lot of work came before).", 
            "Brilliant, exciting, stimulating, quirky, irreverent prof. This was an advanced graduate research seminar, though, so perhaps undergrads just don't get what a major genius and incredibly enabling BRILLIANT MAN Peter is. . .", 
            "No Comments", 
            "No Comments", 
            "An excellent speaker, says what he means and means what he says. Encourages questions from lecture class."
        ], 
        "tags": {}
    }, 
    "813929": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=813929&showMyProfs=true", 
        "score": "4.8", 
        "name": "Al Filreis", 
        "comments": [
            "Changed my life. Opened up poetry to me. Opportunity to be a better poet and reader. Al rocks.", 
            "Al was an amazing 'lecturer' - learning comes about because we discover things - not because he tells us.", 
            "ModPo is just a great course. Accessible, democratic, valuable and engaging. Prof. Filreis teaching style is always evolving and unique in its enthusiasm", 
            "Brilliant, passionate, and a gifted teacher, Al Filreis is by far the best professor I have ever encountered, online or IRL. I've taken his Coursera Modern Poetry course twice, and have enrolled for the next session. It is such a joy to be part of this international group of learners.", 
            "Amazing course. Amazing experience. Amazing professor.", 
            "My first MOOC. I was fascinated with the whole process. I came out of curiosity and stayed for the party without missing one assigned even though the course is ungraded.", 
            "Taught me how to close read a text. Highly recommend", 
            "Al Filreis is amazingly charismatic, generous, and passionate about the material, the course, the MOOC pedagogy, and especially the people. He teaches with a disarming style that inspires his students to stay engaged, dig deeper, and continue learning and sharing great poems and poets. Easily one of the top professors I have ever had at any level.", 
            "The videos were mostly talking heads with no differences in the point of view among the participants. The pace was very uneven. I was extremely interested in the subject and have gone to other on line classes in order to get different perspectives and interpretations. Communications were generally unclear. My time could have been better spent.", 
            "Al is passionate, knowledgable, encouraging and hip. Any student who has a class with him is extremely fortunate.", 
            "Al is passionate, knowledgable, encouraging and hip.", 
            "Incredible Experience, Excellent professor and staff", 
            "PROF.AL-Amazing: personally involved with so many students & accessible so many hours a day! Teaching style is top-level. Can't say enough good about this man. His course was a life-changing experience. I'll always be grateful. But rating categories seem more course related than prof. related. Al is outstanding across the board! I took ModPo 2x!", 
            "ModPo with Al Filreis--who would believe that love and humanity could be measured in a MOOC?", 
            "Attendance not mandatory, but I am still going to class. Simply the best.", 
            "Al Filreis is an enthusiastic, open-minded, intelligent, and welcoming prof, who's passionate about his subject, about teaching, collaboration, and discussion. His is an amazing, eye-opening course.", 
            "great", 
            "Superb and enthusiastic teacher. He makes interesting material even more fascinating. Take any class from this professor. You'll learn a lot more than you expected. He'll become one of your favorite teachers now and one of your most remembered teachers later.", 
            "Most excellent Mooc", 
            "An amazing life-changing course, taught by a passionate, exceptional professor. I doubt very much there is another of these types of courses being taught with this kind of enthusiasm and dedication, which is a shame. These are hopefully the classrooms of the future; we need to clone Al Filreis to make them a reality."
        ], 
        "tags": {
            "Respected ": "1", 
            "Amazing lectures ": "1", 
            "Caring ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "623514": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=623514&showMyProfs=true", 
        "score": "3.9", 
        "name": "Walter Palmer", 
        "comments": [
            "Professor Palmer is a great person and truly works for the personal liberation of his students. There are some frustrating aspects of being in his classroom, but ultimately the learning experience trumps those challenges. Don't take his class if you're not willing to openly discuss your own racial background.", 
            "Palmer's intelligence, passion, and articulation of complex social justice ideas are very striking. It is fascinating to hear him speak. You must do the reading, because he will assign mini-presentations of readings at the last minute, which is annoying-but worth it. I feel his course forever changed the way I think about race and U.S. history.", 
            "Prof Palmer is extremely passionate about teaching young people and making a difference in society. He is an excellent role model and lives his life by his teachings. His class is inspiring. Buy the books and be prepared to do the readings!", 
            "Smart, passionate, and if he's on your side, he is definitely on your side.", 
            "No Comments", 
            "Prof. Palmer is great. Sometimes he talks about himself too much, but otherwise the class is well worth it."
        ], 
        "tags": {
            "Respected ": "1", 
            "Participation matters ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "766730": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=766730&showMyProfs=true", 
        "score": "4.7", 
        "name": "Frank Pellicone", 
        "comments": [
            "Best class I've taken", 
            "Class was always interesting - with good discussion - this was my favorite class and the only one that I never missed.", 
            "this was by far my best class - the prof knows the material but is more down to earth than my other instructors", 
            "this class was great - I learned a lot", 
            "Prof Pellicone made this a great class - he always had good insights to helping the class understand - and he organized the discussions well - this was by far my best class yet", 
            "this was a great class to start out taking - I really learned a lot", 
            "just awesome", 
            "always available and always interesting - he let some in class talk too much though", 
            "This is the best class that I have taken -", 
            "This is the best course that I have taken at Penn - the reading is great and the discussions have been the best part of it.", 
            "this was a great class - and Dr.Pel was a great instructor", 
            "t", 
            "awesme professor", 
            "I liked the material and the way it was presented. We also were able to participate and get to know each other", 
            "The class was great - I like all of the novels and films; he made this class really interesting and cared about how we were learining", 
            "This class was the best class that I have taken at Penn -", 
            "This class was great and Doc Pell is always making things interesting", 
            "by far the best prof at Penn... always available and makes all classes interesting", 
            "Best class I took in 4 years", 
            "No Comments"
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "382983": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=382983&showMyProfs=true", 
        "score": "4.0", 
        "name": "Ingrid Waldron", 
        "comments": [
            "Fantastic Teacher", 
            "Booooring!about as clear as mud...", 
            "She really motivated me to learn more biol. and become the successful bio trwacher that I am now.", 
            "Prof. Waldron's course is challenging.She is slightly boring,but provides a lot of information,which I was not ready for as an upper freshman.I took this course in the Spring of 1987.I admit I did not work as hard as I should have.I didn't like all of the reading involved.Good professor,though!", 
            "Great teacher. Do everything as she says and you'll be fine."
        ], 
        "tags": {}
    }, 
    "1180553": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1180553&showMyProfs=true", 
        "score": "4.0", 
        "name": "Esther Alarcon", 
        "comments": [
            "I love her :)", 
            "Esther was amazing!! She is the best professor ever; she really teaches her students and expects everyone to work hard. Her class is both educational and fun at the same time! Also, she's really really smokin hot!", 
            "She is demanding which should be expected anyway. She was by far one of the best professors of a language I have ever had! Very enthusiastic, fun and extremley good at teaching!", 
            "she's really hard and expects too much. dont take her", 
            "shes okay. dont expect too much"
        ], 
        "tags": {}
    }, 
    "1798689": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1798689&showMyProfs=true", 
        "score": "4.2", 
        "name": "Matthew Ditty", 
        "comments": [
            "Ditty brings an upbeat mood to class. His lectures are entertaining, helping students stay engaged. With little effort, Ditty comes up with many great examples of each concept we cover; he's very knowledgeable. He is also approachable, welcoming any and all questions students may have. To me, he is one of the best professors at SP2.", 
            "Professor Ditty is extremely knowledgeable when it comes to the subject of this course: DBT. There was a lot of information packed into this semester course, and I completed the course confidently knowing that I learned a great deal---specifically due to having such a dedicated, genuine, and deeply knowledgeable prof. Highly recommend Prof. Ditty!", 
            "Prof. Ditty is a fantastic teacher! He has a very successful DBT practice in Delaware and is brings in a lot of direct clinical research with him. I think he combines the research and practical experience (concrete software to use and when) to inform future practitioners. Very recommended but you gotta like research!", 
            "Ditty is a pretty cool guy. He talks about DBT a lot because that is what he works with. We do mindfulness exercise at the beginning of every class. He lectures the whole time, even if he runs out of things to do he makes us sit there. Very rarely do we ever get out early and by early I mean at least 5 mins. He's funny though and very honest.", 
            "nice", 
            "Professor Ditty is single-handedly improving my perspective on research. He makes it fun, relevant, and links our learning to subjects we care about. The class is difficult, but he supports us and constantly expresses encouragement. Matthew Ditty is a great professor, one of the best I've taken, and a human being I respect a hell of a lot.", 
            "Really boring and arrogant", 
            "Matt is such a great professor. I found the material of the class to be rather dry, but it was still my favorite class to attend every week. He typically bring in his own real world experience to help bridge the material to your practice. He is very willing to help students. Don't take the class if you don't want to be challenged!", 
            "He is awesome. Very helpful and makes class interesting an fun. He brought his dog into class to prove a point about a theory. Definitely recommend taking him!", 
            "Very great professor. He will work with you as long as you are willing to work.", 
            "I loved Ditty's quirkiness and the fact that he really cares about his students. He does tend to be a little sensitive, especially if you challenge him, but he's also very approachable. He's funny and is open to talk with students outside of class. Definitely recommend taking him.", 
            "Good classroom environment, supportive teacher who wants students to understand assignments, open to feedback from students, wants students to do well and be passionate about swrk."
        ], 
        "tags": {
            "Respected ": "6", 
            "Gives good feedback ": "3", 
            "Lecture heavy ": "3", 
            "Participation matters ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "2", 
            "Caring ": "5"
        }
    }, 
    "508556": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=508556&showMyProfs=true", 
        "score": "4.0", 
        "name": "Janet Monge", 
        "comments": [
            "Dr. Monge is brilliant in about ten different ways. Top 3: her love of her subject is infectious, she chooses interesting stuff to cover in every lecture so it's never boring, and she's very funny. It's a class I always want to go to and makes me want to take another anthro class, preferably with her.", 
            "While often an entertaining lecturer and apparently a nice person, she's a frustrating professor. Course is all over the place, syllabus is vague, and tangents take up most of the class time. If you like the material (human evolution, fossils, primates), you might enjoy and learn something in the course, despite her scattered teaching style.", 
            "Clearly knows her stuff and expects you to be as passionate as she is about anthropology. If you're not interested in the material don't take the class it's not a cakewalk.", 
            "Dr. Monge is proof that it is possible to enroll in a course that is both rigorous AND enjoyable. She's a fantastic educator and is always taking part in great educational experiences outside of class (volunteer projects, lectures, etc.). She will be missed at the University of Pennsylvania and will be a great asset to another institution.", 
            "My worst experience at Penn. completely disorganized, unprepared, no sense of time. Didn't even update the Blackboard Site from a year and a half ago. Didn't write the exams herself. Exams didn't match up with material emphasized in class. Digressed and wasted our time with boring stories.", 
            "Cool professor, entertaining class. She often has students rolling in the aisles with laughter. Learned a lot.", 
            "Great teacher. Engaging, interesting, and fun.", 
            "Very clear, knows a lot and you learn a lot from her class, though you don't realize it. She's also tons of fun.", 
            "As funny as she seems you really don't learn much from her - her tangents are endless & she NEVER references the texts that you bothered reading. I'm sure she is brilliant but she can't teaach and at the end of the day you don't feel any more knowledgable in the topic. Easy A if you don't mind that you didn't learn a thing.", 
            "HILARIOUS, brilliant, sweet professor. She knows her stuff, loves to help, and makes class interesting. True, she went on tangents all of the time, but we learned a lot.", 
            "Personally, she's kind and funny. However, her lectures are far from helpful. People go to class because they wanna *learn stuff*. She digresses and talks about her life or how great anthropology is (as a field, not the class material) EVERYDAY. Entertaining at the year's start but when midterms come you wish she'd just teach one relevent class.", 
            "Very interesting lectures, amazingly animated professor.", 
            "Truly one of the better undergraduate professors we have in the department. Her classes are always lively and fun, interesting lesson plans, and exciting discussions. If you feel like stalling, just steer the conversation off topic. The readings can be put off until the midterm and final if need be, but should be done and reviewed as they're really neither too heavy nor too much. Oh and she really enjoys talking about pizza, the italian market, kenyan safaris, and her cats.", 
            "Janet Monge is the best. You will laugh the entire class and still learn a lot.", 
            "so funny, like the old lady on your block with all the cats.. she makes the class fun and always has some story to entertain you when she can tell you're getting tired.", 
            "Hilarious with a fascinating perspective.", 
            ":D"
        ], 
        "tags": {
            "Hilarious ": "2", 
            "Skip class? You won't pass. ": "2", 
            "Tough grader ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "178182": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=178182&showMyProfs=true", 
        "score": "3.1", 
        "name": "Ed Crotty", 
        "comments": [
            "As they said, he is a real gem. If you're lucky enough to have him, listen up.", 
            "I took an elementary education math course with him, and it has never been more of a waste of my time. He has no experience teaching younger children, so has no idea how to explain things to us. The majority of the class dealt with him talking about things other than math, and he never returned papers. If you have the choice, don't take him.", 
            "Random tangents about the history of Math..Average professor. Confuses us and loves to get off topic", 
            "I took a lower lever math course specific to education students. Supposed to be teaching me how to teach young ones how to do math. He DID NOT do this! He went on a million tangents and was incredibly pompous and arrogant. He does not appreciate people asking questions, but puts them on the spot in front of the whole class.", 
            "If you don't already know calculus before you've taken this class, then do NOT take Crotty. He will leave you incredibly confused. He's a really nice person but not so great when it comes to explaining things.", 
            "Crotty's lecture style is conversational: he employs anecdotes like you wouldn't believe. I would have preferred something else in an intro class where people are learning the math ropes, but I bet he's fantastic in 240 or 241, for example. He can seem intimidating, but he's actually very friendly and helpful. (Even though he looks like a viking.)", 
            "He was interested in the class but he did not seem interested in the course subject. Would sometimes stray of the topic and confuse students", 
            "Prof. Crotty's ability to boil all concepts down to everyday examples and willingness to expend time in story-telling if needed just to make sure the point gets across was refreshing.", 
            "Maybe the best teacher I had and I failed the class! Yeah, his tests are hard but he rounds generously and I was getting a B+/A- until the final. I liked how he always enoucraged me. He even let me take the final a second time after I failed it the first time. Super quick about responding to email; had him for 103 and got a B.", 
            "One of the worst experiences because he didn't go over any examples in class", 
            "Terrible professor! He didn't teach or assign work on 1/4 of the syllabus and then put the material on the final. He also changed the list of relevant chapters to study less than 6 hours before the final.", 
            "No Comments", 
            "I've had him for Math 104 and Math 240. Tests are hard as F*CK. He explains great if you keep up with the class, but he uses lots of esoteric words as well, so if you're behind you won't learn sh*t. IMO, he won't \"teach\" you the maerial in class but rather \"decorates it with unnecessary detail.\"", 
            "clear, thorough, makes you think", 
            "AWESOME!", 
            "He explains well but his tests are really hard!", 
            "No Comments", 
            "Much better than any of the other professors at explaining the difficult topics. Also very willing to help and answer questions in and out of class.", 
            "he uses maple a lot and derives formulas for most of the class period. i find it less confusing to just read the book myself than listen to his explanations. homeworks usually have some pretty challenging problems.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "6464": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=6464&showMyProfs=true", 
        "score": "2.0", 
        "name": "Yochanan Shachmurove", 
        "comments": [
            "The course on International Trade is a high level course at the Graduate Center. Dr. S. is a kind, genial gentleman, who has worked in International Trade for many years and is an icon in the field. The works involves heavy analysis and presentations of research papers which grants the freedom to learn on your own, and class powerpoints on theory.", 
            "Totally disrespectful towards students. It was not diffucult to get the grade,however the course was quite intense, carried out in a short period of timeActually, the course was useless as the professor did not provide us with any knowledge-not only the presentation was not his, but also he just read the slides which we could do on our own at home", 
            "I so much regret taking his course. All I have learned about Public Finance I learned from the textbook. Making college students read articles aloud in class is nonsense.", 
            "I took one class from this loser this last semester as a junior and it stunk. I got an A grade but the class was sub-standard in every way. Very befuddled uninsightful instructor.", 
            "This class was a total waste of time because the professor was so bad. He hardly understands what he is even teaching. He does not have the skill to teach at the college level, let alone a school such as Penn. He would be much better suited to teach junior high school, maybe high school. Do not take his classes, they are horrible.", 
            "Absolutly incompetent professor and a total disgrace to Penn. Class was absolutely atrocious. exams tested on material not even alluded to in class. Terribly boring lecturer. Many students did not even bother attending lectures because they were ultimately a waste of time.", 
            "This class was, at its very best, slightly below mediocre. I would not recommend this class to majors or non-majors.", 
            "I have somehow ended up taking three classes from him, and he is by far the worst teacher I've ever had. He makes generally interesting subjects seem duller and can't teach his subjects at all- you are better off studying independently.", 
            "great teacher. i was personally very motivated by what i learned in his class.", 
            "He is the worst professor ever. He insults his students, presses his political views on them, and tests his class on material not covered (or even in the textbook for that matter). He was teaching a course in development...but instead we learned about outdated international trade models and about how much he hates Barack Obama.", 
            "this guy was horrible - had him 10+ years ago...", 
            "Obnoxious, condescending", 
            "Gross!! What is he doing teaching here?? I pay for this monkey to teach me.", 
            "Awesome teach.", 
            "I heart Yochanan. What more is there to say? He's the reason I majored in Econ.", 
            "No Comments", 
            "He was funny, but I would go ahead and call him a terrible teacher. I learned -next- to nothing from him. My TA, on the other hand, was outstanding.", 
            "He completely ignored the syllabus and couldn't teach his way out of a paper bag.", 
            "obnoxious, condescending, and unhelpful; but importantly, he knows his stuff", 
            "Incredibly funny, but a bit obnoxious, and not everyone likes his lecture style"
        ], 
        "tags": {
            "Respected ": "1", 
            "Participation matters ": "1", 
            "Caring ": "1"
        }
    }, 
    "154485": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=154485&showMyProfs=true", 
        "score": "3.6", 
        "name": "Rebecca Stein", 
        "comments": [
            "She was very kind and helpful", 
            "Awful teacher. Very lazy. Requires students to spend hours outside of class learning the material through prerecorded lectures, fails to finish reviewing a basic worksheet during lecture. At the end of the day explains how SAIL is inherently superior to all other forms of teaching when, the only reason her students perform is bc they spend 2x time", 
            "She's very entertaining, and plays music before the class.", 
            "Good teacher. Tests are fair, and you can do well if you study appropriately. She is also very helpful during her office hours. Only downside is she sometimes moves too fast through difficult material", 
            "Lecture's very entertaining, wouldn't mind going to the her lecture twice per day. She used examples that are funny and different, so it is easier for the students to remember.", 
            "TERRIBLE TEACHER.", 
            "Stein is such a bad teacher. She makes Microeconomics unnecessarily difficult. Her voice is also incredibly irritating. She can be funny at times, but, to use micro terminology, the marginal cost of being in this class is greater than the marginal benefit. Skip it if you can.", 
            "easy to udstd", 
            "her exams can be tricky. but she's so great and funny. she is the best prof i've ever had. she is very helpful esp during office hours", 
            "her exams can be tricky. but she's great...the best prof i've ever had...she is also helpful esp during office hours.", 
            "Good professor, though not always clear.", 
            "Her lectures are crystal clear, even if you didn't read the book. She is very helpful and fair in her grading policy. Despite the low difficulty of micro, its very easy to get a D on the midterm. To ace the midterm, and the quizzes, make sure your answers are jam packed with vocabulary and explanations while being concise.", 
            "has a cool accent", 
            "she was great", 
            "An average prof. Lectures were very enjoyable, but outside of class she came across as very pompous", 
            "great clarity", 
            "She is awesome... seriously the best econ prof ever", 
            "No Comments", 
            "it is easy to be clear when you are just spouting the text book. brought little life to the text, just half a.s.s regurgitation. Quick to refer you to the study guide, but that is no help and it never covers testing mats. be prepared to be testested on math questions that they never really cover.", 
            "She's great for lecture, but it's the TA's you need to watch out for! Midterms and Finals can be tricky...make sure you pay attention in lecture and class (no basic problems like in textbook for tests)"
        ], 
        "tags": {
            "Respected ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "262854": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=262854&showMyProfs=true", 
        "score": "2.9", 
        "name": "Uri Spiegel", 
        "comments": [
            "the best !!!!", 
            "Seems like a nice guy, but does not explain things very well. Hard class overall", 
            "Almost impossible to understand. Also, not a very pleasant human being. Econ can be interesting, but he makes it dry, boring, and soul-crushing.", 
            "he's accent is hard to follow. But the lecture is quite interesting. Book is somehow useless here if you attend every lecture.", 
            "I love his accent, even though it's sometimes difficult to understand. He made the class very inetersting.", 
            "If you have never studied economics before than Spiegel will not make your life any easier. His lectures are very dry and he is very hard to understand due to his accent. He is an awesome economist but he fails to present his material in a coherent way. Spiegel loves math and equations so if you want economics with math than choose him.", 
            "His lectures are very difficult to understand unless you review the material ahead of time. He does not present the material in an organized and logical way. Lecture is not the best place to see the material for the first time.", 
            "No Comments", 
            "Obviously the first kid's comment is idiotic, considering he ****ing misspelled thick (he put think). His accent isn't too bad, it's way too built up. He is math based, and gives you lots of ways to get the answer quickly if you attend lecture.", 
            "His accent was way too think. If it weren't for that, I might have actually been able to stay awake in class and learned something.", 
            "Tries to be helpful and is knowledgable, but has difficulty with technology and is hard to understand", 
            "Dr. Spiegel is a super nice man but his accent is very strong. His class is more math based than other Econ 1 classes. His lectures can be very boring, but he at least trys. He is a readily avail in office hours, where he can help you a ton.", 
            "No Comments", 
            "Wants to be as helpful as he can, but you simply can't understand him in lecture. He has a heavy accent and is technologically incompetant (either the mic doesn't work or it hisses constantly)."
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1", 
            "Tough grader ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "644063": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=644063&showMyProfs=true", 
        "score": "3.5", 
        "name": "Srilata Gangulee", 
        "comments": [
            "Brilliant teacher. Her classes are very interesting and stimulating", 
            "Great teacher. Very knowledgable and attending her class was a pleasure.", 
            "Good professor but be careful about what you say in class.", 
            "amazing woman. the nicest, the best.", 
            "No Comments", 
            "Very nice and tried very hard. Explanations were sometimes vague and sometimes lectures very not very well executed."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "1298252": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1298252&showMyProfs=true", 
        "score": "3.8", 
        "name": "Michael Carchidi", 
        "comments": [
            "For ENM 503... Most worthless class I've ever taken. The lectures give you a hand cramp just trying to write everything he scribbles on the board. Half the class doesnt even show up to lecture. The exam questions come out of no where because all of the in-class examples and HWs require the use of Maple or Wolfram. Avoid this course/prof if you can.", 
            "No fluffy stuff. Straight to the contents. Systematic. Good Lecture notes. Good hw problems. Good illustrations on blackboard. Not rushed.", 
            "This is called Simulation but the course is no way related to simulation but centers around probability ! Many of us do not even have a background in probability !", 
            "Lecture notes are brilliant!", 
            "I will just say one thing about the homework. Solving Dr. Carchidi's homework is just like working on a piece of work of art, because of the elegance, the consistency and the inspiration reflected in these problems.", 
            "Basic course, Carchidi gave many examples, very clear, useful"
        ], 
        "tags": {
            "Respected ": "2", 
            "Tough grader ": "2", 
            "Lots of homework ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Lecture heavy ": "3", 
            "Test heavy ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "1538975": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1538975&showMyProfs=true", 
        "score": "4.8", 
        "name": "Carsten Sanders", 
        "comments": [
            "Very enthusiastic and knowledgeable professor. Lectures are well organized and taught in a refreshing interactive style (maybe include too much information at times). Assignments are challenging and time-consuming (homework on current topics every week, various lecture quizzes, three exams), but definitely worth the effort. I learnt a lot", 
            "Great guy who is passionate about the subject matter. Funny & engaging, lectures are entertaining most of the time but monotonous when nobody answers his questions. When they do though, this class is a lot of fun. Sometimes doesnt explain things well so it will take textbook reading. Tests on DETAILS from slides. Def understand but need 2 memorize2", 
            "Dr. Sanders definitely knows his stuff. And he is quite helpful. However, his exams are really tough, especially the in-class parts (the take-home parts are tough too, but you have a week to solve the problems). Overall, hard but good.", 
            "I think Dr. Sanders did a fine teaching job in this course. And he was very helpful if I had any questions. I would recommend biotechnology majors to take this course.", 
            "The course was very challenging (especially the exams), but the topics were always presented clearly and interestingly. I would recommend taking this course.", 
            "Overall I think that Dr. Sanders did an excellent job in teaching lecture and lab. I would recommend taking him as an instructor for both course parts combined. This is a wonderful opportunity.", 
            "It was a challenging course, but very structured, organized, and well-taught. There are four lecture sections, each concludes with a discussion of specific problem set. The exams consist of an in-class and take-home part. I really loved the take-home questions", 
            "Great teacher, very fair, clear and organized."
        ], 
        "tags": {}
    }
}