{
    "768666": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=768666&showMyProfs=true", 
        "score": "1.2", 
        "name": "Natasha Lee", 
        "comments": [
            "literally NEVER available. Terrible responder to emails. gives NO instructions on midterm/final papers until like a week before the due date. made me never want to take french again.", 
            "Similar to what other people have said: extremely unhelpful, pouts when participation is slow", 
            "My course with Lee was absolutely terrible. She seems really unstable and doesnt care at all about her students. I cant understand why she is a teacher. I will never take a class with her again.", 
            "No Comments", 
            "The worse professor I have ever had in 3 years here. Not available ever. totally indifferent to a student's needs. thank goodness I was a french major before taking her course because afterwards i wanted to get as far away from her as possible. I don't know why she's teaching, she hates it and it shows. she should go back to BrynMawr college o"
        ], 
        "tags": {}
    }, 
    "197928": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=197928&showMyProfs=true", 
        "score": "3.8", 
        "name": "Susan Naquin", 
        "comments": [
            "Very organized class. The professor is attentive to methodological issues in the history discipline and always listens to student's thoughts.", 
            "Class super easy. Assignments were not helpful to learning the material. Made us write a wikipedia entry on China without any potentially problematic political statements - almost impossible. Did not know how to answer questions in class and tried to brush them off with commonplace assertions on China."
        ], 
        "tags": {}
    }, 
    "1526745": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1526745&showMyProfs=true", 
        "score": "2.7", 
        "name": "Ali Aslam", 
        "comments": [
            "unclear about grading criteria, gives vague feedback and assigns ancient readings. Not recommended!", 
            "Amazing professor. Really cares", 
            "Very poor course. It was all fluff, mere jargon, no substance, no analytical reasoning. Good for posers though.", 
            "Great teacher. Very down to Earth, yet intelligent at the same time. Did a great job stimulating conversation and thought. A little sassy at times (good thing). Take a class with him if you can. He made writing seminar both worthwhile and enjoyable."
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Participation matters ": "1", 
            "Get ready to read ": "2"
        }
    }, 
    "1258345": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1258345&showMyProfs=true", 
        "score": "3.7", 
        "name": "Jeffrey Nunokawa", 
        "comments": [
            "Jeff is the most engaging teacher I have had so far at Princeton. He gives great insights and allows for conversation in lecture. He is also very accessible and personable. If you're lucky enough to have his precept, you will know this. Even outside of his precept students, he is reachable.", 
            "Talks really fast; seems a tad show-offy. A bit flighty. Can be helpful.", 
            "Never have I seen a professor that has Jeff's combination of originality of ideas and raw passion. He is also the most delightfully amusing lecturer at Princeton. Take any of his courses, even if you despise English or the topic. You will not regret it.", 
            "Exceptional enthusiasm and clarity of thought. Animates an otherwise boring subject matter into something wildly entertaining using humor and a different viewpoint. Prof has an excellent ability to use example after example to get his ideas across and relate the material to our own lives. Professor Nunokawa is at the top of his game.", 
            "No Comments", 
            "He's lively, funny, and brilliant.", 
            "Everyone LOOOOOVES Jeff! He talks a million miles a minute and is very easily flustered -- but if I were as busy and brilliant as he were, I'd probably be even worse. He's the sweetest, most amusing professor anywhere!! Just take any class with him -- you won't regret it!", 
            "Great lecturer -- untouchable insights and entertainment. Glamour, glamour, glamour. Be careful. Trouble with independent work.", 
            "Nunie Forever!", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Get ready to read ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "547436": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=547436&showMyProfs=true", 
        "score": "4.3", 
        "name": "Toni Morrison", 
        "comments": [
            "Amazing teacher. suggested reallyy.", 
            "Nice professor.", 
            "nice teacher really", 
            "She was by far the best professor I have ever had. What an incredible mind."
        ], 
        "tags": {}
    }, 
    "1781042": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1781042&showMyProfs=true", 
        "score": "4.5", 
        "name": "Rebecca Fiebrink", 
        "comments": [
            "She's dedicated, interesting, passionate, and so so cool. Really awesome research, taught a fascinating class, all around great professor.", 
            "great class and she is hot"
        ], 
        "tags": {}
    }, 
    "1695436": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1695436&showMyProfs=true", 
        "score": "5.0", 
        "name": "Joe Stephens", 
        "comments": [
            "Not easy but so rewarding. cannot really judge this class without being there", 
            "Wonderful course!", 
            "very exciting class, one of the best I took this year.", 
            "Amazing prof, wish he would teach every year!"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Participation matters ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "807854": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=807854&showMyProfs=true", 
        "score": "4.9", 
        "name": "Erik Sorensen", 
        "comments": [
            "Fantastic", 
            "His orgo notes are really helpful. not to mention his handwriting is amazing", 
            "", 
            "Best orgo professor ever!!!"
        ], 
        "tags": {}
    }, 
    "1107408": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1107408&showMyProfs=true", 
        "score": "5.0", 
        "name": "William Gleason", 
        "comments": [
            "Professor Gleason went out of his way to choose material that was important but a little off the beaten path, and he really worked with his students to help us understand and think critically.", 
            "Best professor ever! I hear his son is really cool too!!!!", 
            "Wonderful instructor--his lectures are equally accessible to majors and non-majors alike, which can be a rarity in this department. Gleason selects great reading material and does an excellent job of orienting students by explaining the historical context of the books on which he lectures. This approach is really effective--take his course!"
        ], 
        "tags": {
            "Amazing lectures ": "1", 
            "Caring ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "637839": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=637839&showMyProfs=true", 
        "score": "5.0", 
        "name": "Paul Miles", 
        "comments": [
            "COL Miles was my instructor for Grand Strategy in the 20th Century and later, my thesis advisor. An inspiring warrior-scholar of the highest order, with deep insight into the people, events, and context that shape the modern world. He was the best teacher ever. I still carry 3x5s, always take a position and engage in a social sport.", 
            "Took his Vietnam seminar my senior spring and it was one of the best classes at Princeton. He's been around for forever so he's got his teaching act down cold. Plus he remembers EVERYTHING and is incredibly knowledgeable. An awesome professor.", 
            "No Comments"
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "992545": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=992545&showMyProfs=true", 
        "score": "5.0", 
        "name": "Robert Gunning", 
        "comments": [
            "What a great professor!", 
            "Good man. Has a lot of critters. Go to office hours. He will rock your world."
        ], 
        "tags": {}
    }, 
    "199572": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=199572&showMyProfs=true", 
        "score": "4.5", 
        "name": "Alexander Nehamas", 
        "comments": [
            "Excellent teacher", 
            "Was my JP advisor. Great guy, super helpful, and a fair (not easy) grader.", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "336888": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=336888&showMyProfs=true", 
        "score": "4.7", 
        "name": "Al Acres", 
        "comments": [
            "Professor Acres is incredible--friendly, knowledgeable, & passionate. He knows the material well and shares his enthusiasm for it with the class. He kept lectures upbeat/interesting, and I really learned from him. Heavy memorization of pieces, but he leaves room for creativity in essays. I only wish I had been able to get to know him better!", 
            "He is an amazing professor- I definitely recommend him", 
            "Great!", 
            "Awesome", 
            "Al is an absolutely great professor. His seminar was the most engaging I had at Princeton--and I studied with some of the top people. He is meticulously well-prepared, rigorous, and he really cares about the material he teaches. He also cares about his students. If you have a chance to study with this man, don't miss it. A great teacher!", 
            "Now at Georgetown, he is the prof that got me interested in art history. very clear, easy to understand and practical. all the material is in the lectures so if you go to class then you don;t have to read. hes very well prepared and always willing to meet for help. when he shows you around the NGA you can tell how much he loves the material- great!", 
            "Not only the most helpful, thought-provoking, and friendly professor I've had on a personal level in my life, but an eloquent lecturer who really cares about his students and the material. Whichever school he ends up at will be very, very lucky. He makes me want to continue with my studies and go to graduate school, no doubt about it.", 
            "One of the BEST professors on campus. Dynamic, engaging and brilliant. The art history department will not find a better Northern Ren prof and they will regret losing him. Take a class with him while you can!", 
            "Awesome professor. It makes me sad he didn't get tenure.", 
            "AL IS THE BEST PROF EVER! I LOVE HISTORY BECAUSE OF HIM! I ALSO HAD A LOT OF FUN ON THE CRUISE! :)", 
            "Systematic and well-prepared, Acres is a wonderful professor"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Inspirational ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "2"
        }
    }, 
    "1391052": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1391052&showMyProfs=true", 
        "score": "5.0", 
        "name": "Charles Rice-Davis", 
        "comments": [
            "He's a good teacher and he makes an effort to ensure everyone understands the material. He had short office hours but was flexible with scheduling appointments outside office hours. Overall a really good teacher for an intro to a foreign language.", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Gives good feedback ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "711959": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=711959&showMyProfs=true", 
        "score": "5.0", 
        "name": "Kevin Kruse", 
        "comments": [
            "Best professor I ever had. Took his class freshman fall, made me want to change my major to History or Politics because he made the material so interesting. His lectures were one big story, you didn't want to miss anything.", 
            "Smart and dynamic. Engaging lecturer. His class made me want to be a history major."
        ], 
        "tags": {}
    }, 
    "571958": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=571958&showMyProfs=true", 
        "score": "4.8", 
        "name": "Brian Kernighan", 
        "comments": [
            "great guy but watch out for cos 109 - its not an easy A, and i had to work hard. the concepts are really difficult, but he's a great guy.", 
            "This guy is really a gem. He's so humble that you wouldnt even know that he's a huge figure in the history of programming. He flat out knows his stuff yet is the most kind and helpful professor I have ever met, unbelievable class.", 
            "Kernighan's a genius. He's amazingly friendly and clear. He makes computers accessible to the liberal arts brain and makes you want to wake up in the morning."
        ], 
        "tags": {}
    }, 
    "571956": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=571956&showMyProfs=true", 
        "score": "2.2", 
        "name": "Patricia Fernandez-Kelly", 
        "comments": [
            "Incoherent and doesn't do the topics covered in this class justice. She enjoys playing favorites and hearing herself talk instead of teaching. This was one of the worst classes I've ever taken at Princeton. I recommend taking other SOC classes taught by other professors in the African American Studies department. Don't waste your time with PFK.", 
            "She's great.", 
            "She can afford to have a bad side because her husband keeps her job permanent. There is no peer review that is fair and professional.", 
            "The issue of nepotism has become public now because Mrs. Fernandez Kelly could have been hired in a different department. But she has chosen to remain protected in the same place where her husband is teaching. It is against the University rules, and it is a shame that no one is doing or seeing anything.", 
            "She likes the limelight but has no clear direction in teaching or research. She seems to be jack of all trades and master of non. A major waste of time in your curriculum!", 
            "She is a role model for those of us who don't want to pursue a doctoral degree. You can get a job anyway if your husband has a big name.", 
            "For a prof. who does not have a doctoral degree, she's doing pretty well with lots of publications and lectures on various topics.", 
            "She is the worst professor I've ever had. She is an awful person and nobody likes her. Avoid at all costs.", 
            "PFK is EXCELLENT- one of the only professors who truly had an impact on me at Pton. She's very tough, but you'll appreciate it down the road when you see how much she can change both your academics and your life. Besides, underneath the tough exterior is an amazingly caring teacher who repeatedly goes to great lengths for her students.", 
            "My favorite prof. at Princeton.", 
            "I definitely agree with the previous commenter. But God forbid she hates you, you are screwed....", 
            "She either loves or hates you. Dynamic woman, fascinating personality. Avoid her bad side."
        ], 
        "tags": {
            "Respected ": "1", 
            "Tough grader ": "1", 
            "Graded by few things ": "3", 
            "Caring ": "1", 
            "Inspirational ": "2", 
            "Amazing lectures ": "1"
        }
    }, 
    "855947": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=855947&showMyProfs=true", 
        "score": "4.8", 
        "name": "Muhammad Qasim Zaman", 
        "comments": [
            "I love his lecture style - doesn't rely too heavily on digital media, nor does he go overboard with the massive amounts of Arabic names and words that he could have used. It's clear, concise, and gives an accurate depiction of a modernist Muslim's worldview without being preachy or apologetic.", 
            "best teacher ever", 
            "My first (and last time) ever rating a Professor. Very inspirational,kind,humble and such engaging Professor. There's a great deal to learn from him!", 
            "Sooooo cute", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "3", 
            "Gives good feedback ": "2", 
            "Amazing lectures ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "787947": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=787947&showMyProfs=true", 
        "score": "5.0", 
        "name": "Wendy Heller", 
        "comments": [
            "great lectures, very understanding about personal learning needs and conflicts", 
            "awesome", 
            "Excellent professor...would recommend to anyone. Very interesting discussions..."
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Gives good feedback ": "1", 
            "Caring ": "1"
        }
    }, 
    "812251": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=812251&showMyProfs=true", 
        "score": "4.3", 
        "name": "Faruk Gul", 
        "comments": [
            "He is a nice guy.", 
            ""
        ], 
        "tags": {}
    }, 
    "568904": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=568904&showMyProfs=true", 
        "score": "2.5", 
        "name": "Sanjeev Arora", 
        "comments": [
            "Excellent", 
            "No Comments", 
            "ick", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "340943": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=340943&showMyProfs=true", 
        "score": "4.7", 
        "name": "Daniel Marlow", 
        "comments": [
            "Professor Marlow always did a really good job of explaining difficult concepts in lectures, and he included a bit of humor in his lectures, so I genuinely looked forward to them each week.", 
            "No Comments", 
            "No Comments", 
            "Electricity and magnetism was a great course! Marlow was both insightful and interesting."
        ], 
        "tags": {
            "Clear grading criteria ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "340941": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=340941&showMyProfs=true", 
        "score": "3.0", 
        "name": "Michael Gordin", 
        "comments": [
            "Amazing professor! Favorite of my time here.", 
            "He is not at all helpful and does not take arguments and other points of view positively. Lost all my interest in the topic!"
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "507556": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=507556&showMyProfs=true", 
        "score": "4.9", 
        "name": "Miguel Centeno", 
        "comments": [
            "took his class at NYUAD - discipline and his lectures were amazing. He keeps you engaged and you learn ALOT. Just make sure you do the readings or you might be lost in class. On that note, the readings were pretty long - but it was a 7 week class. Highly recommend him.", 
            "Centeno is fantastic in every way. Just don't **** about your grades.", 
            "The best thesis advisor ever! Get him if you can. Just make sure you make a lot of appointments with his secretary :) But seriously, an awesome advisor!", 
            "Lectures very very interesting, lots of reading but interesting & you don't have to do it all. Grading is strict 33%A but not unreasonably hard since many PDF and thus those left don't have to try that hard. Also, no exams, just three fairly short papers", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "445168": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=445168&showMyProfs=true", 
        "score": "4.3", 
        "name": "Kiki Jamison", 
        "comments": [
            "Didn't like.", 
            "Have to agree with the others. In 4 years, she was the best professor I had. Ran her precept beautifully and the lectures were great. Highly recommended.", 
            "Best professor I had at Princeton or anywhere else for that matter. Articulate, educational, dedicated, and charismatic all in one. Definitely a rarity in her department at the University. Should be seen as an example for what should be expected out of the Politics dept. unfortunately she is not recognized as such yet. Yet being the key word", 
            "One of the best classes I took. It was only offered for one semester - I hope they bring it back!", 
            "No Comments", 
            "This is the best class I took at Princeton. Jamison is a dynamic lecturer who chooses her preceptors VERY carefully. You leave this class unable to win an argument with yourself, being able to drive a hard case for both sides of an issue. FANTASTIC CLAS"
        ], 
        "tags": {}
    }, 
    "243005": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=243005&showMyProfs=true", 
        "score": "3.0", 
        "name": "Paul Krugman", 
        "comments": [
            "His lectures are boring and incredibly biased. Much of the class is simply his liberal opinion and very little true economic substance.", 
            "Wasn't a tough class but Krugman is surprisingly boring to listen. Hard to believe he is the #1 economist in the world.", 
            "COOL AWESOME 5 STARS", 
            "Great Class", 
            "VERY NICE", 
            "A pleasure to actually learn from a true scholar and economic genius. Sorry that education has defaulted to a partisan war in education as well. Take his class and see for yourself.", 
            "Obviously these negative comments about Krugman come from outraged conservatives that dont understand their era of greed and indifference is over. Krugman is intelligent and knows what hes talking about. Highly recommended.", 
            "He's great! Newsflash, Conservatives are too stupid to get this far. Chances are that if you're at Princeton, the cons have been weeded out long ago!", 
            "A very disappointing class. Takes the science out of social science. He should stick to an honest presentation of facts and theories. Not good for a science school like Princeton. If I wanted to study Journalism I would have gone to Columbia or Northwestern. (Can't wait to get a better teacher such as Jonathon Parker.)", 
            "Boring lectures, Krugman believes he has the answers to everything and does not encourage open discussion", 
            "He's deadwood, not an active researcher. Princeton students deserve more than a newpaper columnist, no matter what are his political beliefs. This was the home of Einstein and krugman is a disgrace to this legacy", 
            "Paul Krugman taught a great intro class. These comments to the contrary are all about politics, nothing else.", 
            "definitely not a brilliant mind", 
            "One of the few intelligent people in this country.", 
            "Very biased teaching.", 
            "Prof. Krugman offers a brilliant liberal viewpoint in a field dominated by conservatives. Lectures were engaging and informative.", 
            "Absolutely brilliant, though it's easy to tell he can be partisan and sometimes shrill. This man makes me want to be an economist, for when people say only conservatives can be good economists and thinkers, Krugman proves them wrong.", 
            "May sound somewhat intelligent in his NYT columns, but a terrible lecturer."
        ], 
        "tags": {
            "Lecture heavy ": "1", 
            "Get ready to read ": "1"
        }
    }, 
    "791067": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=791067&showMyProfs=true", 
        "score": "5.0", 
        "name": "Hendrik Lorenz", 
        "comments": [
            "He's so hot. Also, he is brilliant and clear and funny. Take his class! Easy.", 
            "Sometimes his lectures were too slow, if anything, but it made sure we knew the material very well. Our precept discussions were fascinating and sometimes very comical.", 
            "Really funny."
        ], 
        "tags": {}
    }, 
    "791066": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=791066&showMyProfs=true", 
        "score": "4.6", 
        "name": "William Bialek", 
        "comments": [
            "Professor Bialek is an incredible lecture! He can be very intimidating, but he is willing to help you if you need it! Every lecture that he gave would leave us all mind blown.", 
            "awesome lecturer.", 
            "Best Lecturer of my 4 years at Princeton! Tough material and course, but he explains his mechanics and wave functions and entropy like the best of them!", 
            "Big man with big brain. Perfomance is funny and extremely good.", 
            "A very charismatic lecturer. Extremely helpful when you approach him personally for specific questions. A very generous grader as well.", 
            "quite good", 
            "Extremely good lecturer. Really knows what he is talking about, which makes for great clarity. His course is difficult, but awesome.", 
            "Awesome lecturer... Teaches some tough material, but very fascinating to listen to and learn from.", 
            "A really great lecturer."
        ], 
        "tags": {}
    }, 
    "1685001": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1685001&showMyProfs=true", 
        "score": "4.8", 
        "name": "Jessica Delgado", 
        "comments": [
            "Probably one of the greatest teachers I've had in a while. She knows how to keep the class interactive and knows and explains the material effectively. Very sweet and naturally very funny as well. You have to do a lot of presentations but it is a speech class", 
            "(-:"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "649834": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=649834&showMyProfs=true", 
        "score": "1.4", 
        "name": "Henry Farber", 
        "comments": [
            "Many people who took Farber's Intro to Micro class didn't like his style, but I did. Clearly knows a lot about Economics. If anything, he's almost too smart to teach the class and goes rather quickly. Often brushes through material and tells you to study it later. 30% of class skips lecture routinely. Told interesting econ-related stories in class", 
            "Absolutely the worst professor I have had at Princeton. He has made me reconsider my major because of his incompetence and complete disinterest in any sort of engagement with the material. He constantly makes mistakes. I don't understand why he is still teaching this course, as everyone complains about him.", 
            "He gets off topic quite frequently. He is completely incompetent when it comes to technology. He almost never finishes his lecture slides, and they have in the past been incorrect without excuse. I do not recommend this professor at all.", 
            "No Comments", 
            "Constantly approval-seeking, generally disorganized, useless overall. Gives very weak and disorganized explanations littered with inappropriate political rhetoric; the only redeeming quality is that his preceptors tend to be decent, and can cover his ass.", 
            "Worst professor I've had at Princeton, doesn't care about students, very unfair, and is simply a jackass to students.", 
            "Biggest **** I've ever met in my life, probably the least concerned about teaching out of all the professors i've ever seen here. Poor grading system. Just an awful experience."
        ], 
        "tags": {
            "Lecture heavy ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "543288": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=543288&showMyProfs=true", 
        "score": "3.4", 
        "name": "John V. Fleming", 
        "comments": [
            "If you showed up, participated, and were a decent writer and thinker you were fine. But this guy had pets and was really cold and unkind to a couple of people who were socially awkward or perhaps just a little different. Very strange to discuss religious hypocrisy in an environment like this.No prof should treat a student as if they're \"less than.\"", 
            "Incredible professor.", 
            "Fleming retired my senior year -- but if he ever comes back for an encore, get yourself into the class IMMEDIATELY. He's the funniest professor alive. And the most important scholar in his field, which doesn't hurt -- but really his classes are all about laughing at his jokes (which are usually so unfunny they're hilarious). He's amazing, amazing, amazing.", 
            "No, Fleming rocks. Whoever gave him a bad rating is either a moron or an impostor.", 
            "this guy is a moron."
        ], 
        "tags": {}
    }, 
    "650497": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=650497&showMyProfs=true", 
        "score": "4.5", 
        "name": "Paul Dimaggio", 
        "comments": [
            "Good"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "So many papers ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "311532": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=311532&showMyProfs=true", 
        "score": "4.5", 
        "name": "Gary Bass", 
        "comments": [
            "Fantastic lecturer. Used to be a journalist for the Economist, really knows his stuff.", 
            "Gary Bass is the best lecturer/informational speaker I have ever heard, bar none. He is a supremely talented orator with extensive expertise in his subject matter. I would encourage friends to attend his classes just so they could hear him speak about war and politics.", 
            "he is great i recomend him", 
            "Best professor at Princeton, in my opinion. Fantastic lecturer. Excellent preceptor.", 
            "Gary Bass is smart, but a little bit of a dick.", 
            "Brilliant", 
            "He's amazing. Really wants his students to learn. And he's funny and smart as hell.", 
            "Great, funny guy who knows his stuff."
        ], 
        "tags": {}
    }, 
    "1364631": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1364631&showMyProfs=true", 
        "score": "4.7", 
        "name": "Brian Zack", 
        "comments": [
            "He is so nice. He does not matter when you come to class.. just listen. Useful classes. Thank you", 
            "I like Basic Vocabulary most and dislike Reading. The teacher Mr. Brian is fantastic and great about the vocabulary.I love it. About reading, I suggest to give us some intensive reading materials in class and some extensive reading materials after class. Thank you so much for your free class!", 
            "Amazing English Class", 
            "Maybe encourage the students to be more involve and do a little more speaking practice will be great", 
            "He is very good, I would prefer he is not too fast", 
            "the lecture gives you the impression you are clever, and it's the first time for me to have a teacher who explain the history of language and it's nice ans very usefull. Thank's a lot for that.", 
            "Very good professor teaching us as much about USA as possible, verz helpful course to get into life in Princeton. Appreciate a lot.", 
            "We are very grateful to Brian for his excellent English teaching!", 
            "This is very good English class for Non-Native Speakers. I like this class very much, I can learn a lot from each lesson, especially for vocabulary with the color picture and Idioms.", 
            "I love these classes. Everything is clear, the atmosphere is qreat, I don't have to be stressed out. I can learn a lot about grammar, volcabulary and many other stuff. Moreover, we're encouraged to ask questions and there is many helpful handouts. I recommend to everyone!", 
            "I'm grateful for the attitude of Professor Brian in providing quality materials in his English classes and for sharing his knowledge.", 
            "Interestinng lectures for English learners - full of practical expressions.", 
            "Enjoying the mix of grammar, reading and pronunciation! I'm impressed by your knowledge about expression and their history, that's interesting! I think it is a good choice to run the class this way because a lot of people, even with babies, get to attend the class without feeling bad for leaving early or coming late. It is really cold in the room!", 
            "Excellent Professor, vocational and very clear english pronunciation.", 
            "I think it is an excellent class, although I think it extends a lot in the province of words and is a bit confusing,should have two classes a week and give information to visitors by The library or municipality, since I went to ask the university and they did not give me any information until a study partnertold me about the course, I attended.", 
            "The class is very useful.", 
            "very interesting", 
            "Brian is really good at and love language I like his English class", 
            "Brian Zack is excelent teacher and it is not just one side listener. He is asking us during class if we understood curriculum and if we didnt he tries to explain to us the different way. I am looking for his class every week.", 
            "He is funny and so smart! He respect every culture and tradition, he avoid political discuss, but always explain a lot of things about american culture. He is an Awesome Teacher!!!!"
        ], 
        "tags": {
            "Respected ": "14", 
            "Gives good feedback ": "13", 
            "Accessible outside class ": "6", 
            "Lecture heavy ": "1", 
            "Participation matters ": "5", 
            "Hilarious ": "7", 
            "EXTRA CREDIT ": "1", 
            "Caring ": "16", 
            "Clear grading criteria ": "1", 
            "Amazing lectures ": "17", 
            "Inspirational ": "16"
        }
    }, 
    "1394628": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1394628&showMyProfs=true", 
        "score": "4.0", 
        "name": "Mihaela Carla Caponegro", 
        "comments": [
            "Took her EAD II, she's humorous and is a very nice person but not a good professor. You have to guess what she wants in a paper therefore very hard to get an A. Also she likes to handwrite unidentifiable comments on your paper which makes them useless until you ask her. Maybe choose her class if you have no better options.", 
            "I had Dr. Caponegro for 101, and found this semester to be easier. Granted, the content increased in difficulty, but the Italian department switched to online exams which made the class overwhelmingly easier throughout. That being said, I had to study much harder for this final because I was basically learning everything at the end.", 
            "Lectures are very interactive which makes class go a lot faster. While she is very thorough and pretty understanding, she does expect a lot for beginners. Having previous knowledge in Italian, I did not find the work difficult, however, there is a decent amount of it. Not an easy A, but definitely doable. The textbook is also a must.", 
            "She is a very nice professor, and truly cares for each student. Participation is weighted the most, so make sure to actively participate during every lecture. Exams are long, but doable. Be sure to memorize all of the vocabulary and grammar rules and do all the assigned homework. You need a 95 for the A, but if you put in the work you will be fine.", 
            "loved the class", 
            "Very rough teacher to have. Don't get me wrong she's not a bad teacher, but she expects way too much out of a beginner. If you don't mind writing entire essays in Italian without the use of a book in your second week of class, this is for you. Don't expect an easy A. She can also be very nasty and snotty. Expect a lot of passive aggressive insults.", 
            "Not easyper se, but understanding and funny. Be ready to work for your sucess, but only because it's a 101 langague class, so there's a lot of material to cover. When I was out sick, she was really sweet and asked how I was doing at the next class. Just be ready to participate a lot. It's 25% of your grade. I wanted her for 102 but alas.", 
            "I didn't like Professoressa Caponegro. As a first time Italian student, I found her to be really tough and driven on participation in class. If you're someone who actively participates, you'll probably be fine albeit a little uncomfortable. When you mess up it's embarrassing, but everyone messes up so you're not alone. I wouldn't recommend her.", 
            "very nice teacher, wants her students to do well and makes class fun. Tests are easy as long as you study and follow along with everything you do in class. Definately would recommend", 
            "Fun class", 
            "Very good professor.", 
            ""
        ], 
        "tags": {
            "Gives good feedback ": "2", 
            "Tough grader ": "3", 
            "Lots of homework ": "1", 
            "Skip class? You won't pass. ": "4", 
            "Hilarious ": "2", 
            "Participation matters ": "7", 
            "Get ready to read ": "1", 
            "Caring ": "1"
        }
    }, 
    "226584": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=226584&showMyProfs=true", 
        "score": "4.1", 
        "name": "Cornel West", 
        "comments": [
            "This professor uses informal language in his books; he has trouble with academic English related to subject verb agreement related to NUMber, as in singular versus plural.", 
            "Unprepared and indifferent. He would come to class and wing it. He'd often let class out 45 minutes into a two-hour lecture when he ran out of material. Did not put any serious effort into the class or in getting to know his students. He was always off campus and reaching him personally was nearly impossible. But he does have a famous name.", 
            "When it comes to knowledge...heres where u come...got an A on everything thats because you just have to agree with his point of view..only bad thing is that he misses class sometimes due to his interest in money and media...other than that great professor", 
            "I've taken his class & he was my thesis advisor. Sometimes he's performative and certainly has his own politics, but the point of learning is that no one is exempt from having politics. He's brilliant and really funny, engaging and critical in 1-on-1 settings.", 
            "one of the best professor's at Princeton.", 
            "One of the most insightful, passionate educators working today.", 
            "I can only assume that the negative ratings below are influenced by right-wing attacks like David Horowitz's *The Professors.* Please, go hang out on Ward Churchill's RMP page; West is actually talented and intelligent. Read *The American Evasion of Philosophy* or just take a damn class if you doubt it.", 
            "WOOOOWWWW, ABSOLUTELY AMAZING!! BEST PHILOSOPHY TALKS I EVER HEARD IN MY LIFE, BY FAR. ALL MEMBERS OF THE PHILO. DEPT. SHOULD BE ATTENDING HIS CLASSES, TO LEARN HOW TO TEACH!! AN AMAZING HUMAN BEING. THANK YOU DOCTOR, FOR THE EXAMPLE YOU SET!! (Gave him 3 on 'easiness', 4 on 'helpfullness' since that was the average. Can only judge his lectures", 
            "No Comments", 
            "Minds like his are the reason you come here.", 
            "Best lectures I have ever had. His numerous, wide-spreading references captures the attention of any listener.", 
            "No Comments", 
            "What can I say about Prof. West? He's the most dynamic lecturer I've had at Princeton - I was actually excited to wake up and attend lecture each morning.", 
            "What a mind! Great, great guy. Make sure you grab a drink with him at the Annex.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "892598": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=892598&showMyProfs=true", 
        "score": "4.8", 
        "name": "Daniel Oppenheimer", 
        "comments": [
            "He is very much interested in the learning of his students and his lectures are by far the most exciting and interesting at Princeton", 
            "Mr. Oppenheimer is quite possibly one of the best teachers at Princeton. He is eager to teach his students, is willing to get involved with their studies and loves his subject. He is funny, caring and overall a very awesome professor."
        ], 
        "tags": {}
    }, 
    "2014097": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2014097&showMyProfs=true", 
        "score": "4.5", 
        "name": "Indiana Jones", 
        "comments": [
            "Dr. Jones is my favorite professor I've taken so far. He often doesn't show up to class, but when he does his lectures are insightful and really make me think.", 
            "Wonderful professor... so adventurous!", 
            "Great Professor Legendary", 
            "Dr. Jones teaches anthro more as a lifestyle than just a class. He tells some really great stories, and has found some incredible things in the field. He always says these things belong in museums, which is cool because you know he really wants to learn and engage with historal artifacts meaningfully. Also, all the ladies love him. #mancrush", 
            "Great professor...", 
            "Such a great professor! His lectures are a little dry, but if you get a chance to join him for a field class, take it! I loved him so much, I named my dog after him!", 
            "I took a class with Dr. Jones because I wanted to be an archaeologist. I continued to take his classes because I had no idea archaeologists could be that hot. He was thorough, but he missed more classes than the tardiest student ever did. The joke of a substitute who took his place said Dr. Jones was \"out of town,\" whatever that means...", 
            "I don't remember the class because I was to busy gazing into the professors' gorgeous eyes. He is sooooo hot. I am in love with him.", 
            "Prof. Jones has quite a bit of field experience but really fails to make anthropology seem exciting. His lectures have a lot of good info but he sometimes lacks concentration. He's constantly absent due to field studies and constantly avoiding office hours. Great guy, but I think they only keep him around cause he's found some things for the museum", 
            "not enough chili peppers to go around for this one", 
            "Great teacher that I have followed since I was a kid. I would like to see him do a 5th class!", 
            "Really interesting guy, great stories, very intelligent, but seemingly never at office hours. He always seems to be off in some foreign country."
        ], 
        "tags": {
            "Respected ": "8", 
            "Graded by few things ": "1", 
            "Beware of pop quizzes ": "1", 
            "Lots of homework ": "1", 
            "Lecture heavy ": "1", 
            "Hilarious ": "2", 
            "Inspirational ": "7", 
            "Get ready to read ": "1", 
            "Amazing lectures ": "5"
        }
    }, 
    "651848": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=651848&showMyProfs=true", 
        "score": "3.9", 
        "name": "Uwe Reinhardt", 
        "comments": [
            "One of the great minds of economics. The lectures were always inspiring. He's a legend.", 
            "Uwe R. is the only professor I had twice at Princeton, and the only one I willing got up before 9 a.m. for. Some 28 years later I still enjoy hearing him on the radio and reading him in the Times. (He was also the first man whose body I truly enjoyed admiring.)", 
            "I had Professor Reinhardt in the early 80s but I still think about him. It was worth getting up insanely early for his classes.", 
            "highly knowledgeable about topic. highly accessible to students. great teaching skills.", 
            "unbelievably dedicated teacher. good sense of humor", 
            "he rocks!", 
            "No Comments", 
            "Been teaching at P-ton for decades. Hes one of the best they have. Always responds to emails quickly, and is very helpful. Interesting, engaging, and funny.", 
            "No Comments"
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "2518190": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2518190&showMyProfs=true", 
        "score": "4.9", 
        "name": "Christopher Brinton", 
        "comments": [
            "Chris's lectures are clear, well-paced, organized. The lecture notes he released are super helpful for homework and revision. He is a generous grader, and as long as you put work into it, you're likely to get the grade you aim for. He is also very approachable and welcomes questions in class.", 
            "This professor cares about his students. If you need any help after class, please ask!", 
            "Super kind professor who really cares about his students. He's always willing to talk outside of class and provide as much help as possible. Chris is not one of those teachers who are always out to get you and honestly just wants his students to succeed. Any class with him should be pretty chill / fun to take!", 
            "Chris genuinely cares about his students, and well after the class ended continued to speak to me whenever I saw him in the halls, and seemed genuinely sad to be leaving our school when he got a new position. The class was tough, but interesting.I wish I'd realized sooner how much Chris values people coming to talk to him outside of class.", 
            "Professor Brinton is one of those Professors who actually really wants to be there. He's a smart guy who has done his fair share of research but still really cares about education.", 
            "He's a really down-to-earth professor and so friendly.", 
            "Chris was a great lecturer. I had him for our introductory signals class at Princeton. He was really easy to reach outside of classes and a very nice person to get to know! In the following semester, I got the chance to work with him as a teaching assistant for a different class. He is thoughtful and cares about students' learning.", 
            "Professor Brinton was an amazing professor and really helped me through the class. He was readily available for questions and puts a lot of time into his courses. I would highly recommend him if you have the opportunity to take one of his classes.", 
            "I took two courses with Prof. Brinton while he was a lecturer at Princeton, and I can confidently say that he is the best instructor I have ever had. Chris teaches clearly and with enthusiasm, but more importantly, he cares deeply about each and every one of his students. It is so easy to connect with him, which makes lectures really enjoyable."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Gives good feedback ": "2", 
            "Lots of homework ": "1", 
            "Lecture heavy ": "1", 
            "Accessible outside class ": "9", 
            "Caring ": "7", 
            "Clear grading criteria ": "1", 
            "Amazing lectures ": "2", 
            "Inspirational ": "2"
        }
    }, 
    "7886": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=7886&showMyProfs=true", 
        "score": "5.0", 
        "name": "Joshua Katz", 
        "comments": [
            "A reason to come to Princeton", 
            "Professor Katz is one of the finest professors Princeton has to offer. This class was not too hard, and every lecture was fascinating.", 
            "Easily the best class I have taken at Princeton.", 
            "This class, although not one I would have taken if I had the choice, was amazing. Katz is a great teacher. Plus he can pinpoint where you come from.", 
            "Brilliant, accessible, loves what he teaches and really cares about his students. Don't miss this man - his enthusiasm for his subject is infectious!", 
            "Don't graduate without taking a class from Katz. He is not only brilliant but dynamic and interesting as well. He will make the most mundane subject fascinating. Go to his office hours--helpful. Will know each person in his 100-person lecture personally.", 
            "This man is brilliant. His upper-level Greek seminars are a lot of work though.", 
            "Easily among the most fabulous profs Princeton has to offer. Guessed where I'm from in about 10 seconds (or two words) -- really. Super helpful. Super interesting. Absolutely Fabulous. :D", 
            "Possibly the coolest teacher I had through all 4 years of college. Wish I had gone to his office hours. Apparently he's very good at guessing where you and your parents are from based on your accent.", 
            "He's the coolest teacher I've had so far"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "626309": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=626309&showMyProfs=true", 
        "score": "4.8", 
        "name": "Janos Kollar", 
        "comments": [
            "Janos is a baller. His office hours are phenomenal and he is more than willing to help with any question whatsoever. Professor Kollar is excellent.", 
            "Such an awesome instructor! Don't fall asleep in class, though. He'll get you for it (well not really, but you'll feel like an idiot).", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1169784": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1169784&showMyProfs=true", 
        "score": "1.7", 
        "name": "Ivy Forbes", 
        "comments": [
            "Shes got an attitude but that's what turns me on! Taking this class is a MUST before graduation!", 
            "Best professor ever! Very easy grader, you don't have to go to class, but most importantly, HOT.", 
            "No Comments", 
            "No Comments", 
            "I don't know if Dr Forbes has trouble with statistical methods or not, but she likes to use questionable data as the basis for those statistics.", 
            "I switched majors because of Dr Forbes. The midterm was horrific and the final was literally a bloodbath. Yes, I mean *literally*. I would be very surprised if she were allowed to teach this class ever again.", 
            "Dr Forbes is the meanest teacher I've ever met. He's wonderful!", 
            "No Comments", 
            "Professor Forbes' smart and sexy style made me feel smart and sexy too. Math doesn't have to be boring! :)", 
            "Lost all hope that I'd get anything out of this course when I went to the bookstore and found out that the text for it was \"Math Is Hard!\" by Barbie.", 
            "Dr Forbes is to teaching what Dr. Bevets is to logic.", 
            "Dr Forbes displayed a shocking lack of basic statistical knowledge."
        ], 
        "tags": {}
    }, 
    "416089": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=416089&showMyProfs=true", 
        "score": "3.9", 
        "name": "Ed Zschau", 
        "comments": [
            "Professor Zschau is a hidden gem. He has a wealth of information and wants all his students to succeed. He spends time to know you as an individual and gets to know you personally. The topics discussed in class were relevant to your success and you always came out of class understanding its relevance. I highly recommend this professor!", 
            "Wonderful professor teaching a wonderful class. If you have any interest in business, you MUST take this class.", 
            "The best business-school courses in Princeton... also the ONLY one... its a waste of time and the only people that look up to him are those that value money more than anything else.", 
            "One of the best classes I've taken at Princeton", 
            "its the most stupid class I took in Princeton.", 
            "One cool dude.", 
            "Ed Zschau, former congressman and one of the leaders in the tech boom, is the most amazing teacher you will ever encounter. Do not graduate from Princeton without taking his class."
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "328729": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=328729&showMyProfs=true", 
        "score": "3.5", 
        "name": "Francois Bovon", 
        "comments": [
            "With a subject like Theology there is a mere interest among students. I do believe Dr. Bovon attempts to make his class as clear as possible. If you are looking for a challenge, as well as enlightenment, this is the class, as well as professor you should take."
        ], 
        "tags": {}
    }, 
    "971629": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=971629&showMyProfs=true", 
        "score": "3.8", 
        "name": "David Huse", 
        "comments": [
            "Same comments as for 105", 
            "A bit boring, but clear to understand and helpful when one is alert enough", 
            "The best Prof for Graduate-level physics courses at Princeton.", 
            "He's a good teacher, easy to understand. Problem sets aren't as bad as 203/205."
        ], 
        "tags": {}
    }, 
    "223454": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=223454&showMyProfs=true", 
        "score": "4.9", 
        "name": "Lyman Page", 
        "comments": [
            "Enthusiastic professor!", 
            "Good", 
            "EASY PROFESSOR!", 
            "Worth every second of the work you will put into this class. Only for those seriously interested however.", 
            "great class, somewhat challenging but worth every second of it.", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "174973": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=174973&showMyProfs=true", 
        "score": "4.9", 
        "name": "Molly Greene", 
        "comments": [
            "easily the best professor i've ever had. she has incredible insight and truly knows the subject. not an easy class but one that will change the way you think about history.", 
            "No Comments", 
            "I love Molly Greene. I think she is the best teacher EVER. And she is SUPER HOTT", 
            "She's very nice and very helpful, but she is a tough grader. And she's definitely NOT hot. But, she is a good teacher, and you'll learn a lot.", 
            "She is the best teacher that I have ever had. But if you want a funny teacher, you're in the wrong place"
        ], 
        "tags": {}
    }, 
    "818560": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=818560&showMyProfs=true", 
        "score": "3.8", 
        "name": "Saul Anton", 
        "comments": [
            "Good guy; can be difficult to understand what he's looking for at times. Very passionate about his subject. Frustrated by immaturity (very understandably). Will challenge you to push yourself.", 
            "nice guy. hard grader. can sometimes be a little abstract and hard to understand exactly what he's looking for but he'll keep trying to answer your question."
        ], 
        "tags": {}
    }, 
    "2055462": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2055462&showMyProfs=true", 
        "score": "4.0", 
        "name": "Andrew M Wassef", 
        "comments": [
            "It's rare to find a professor more attractive than this one.. as an Agnostos, he really is a gem. Tall, dark, & handsome! Would recommend taking this class just to stare at him for the hour honestly.", 
            "unnecessarily hard. He is an ok teacher", 
            "I can truly say he's one of the youngest, but best professors I've had at Princeton. The guy is awesome. He somehow makes genetics less painful and more exciting without you even realizing that youre learning. A class act, with the swag of usher and the brains of Einstein. Take any class you can with him.", 
            "This professor is the best and is very helpful. He is vey caring and understanding of circumstances that may effect performance.", 
            "Not going to lie, Im low key depressed about this class now that I know he's taken, and my GPA has dropped for nothing lol Its extremely tough! Aside from that, he makes the class relevant-ish. Ask questions because he definitely likes to see you're engaged and thinking. Very willing to clarify material and help as much as possible.", 
            "In case any of you were wondering hes taken lol no wedding ring but has a girlfriend Idk what possessed me to say this but we were all telling funny pick up lines inthe beginning of class. He walks in. I raise my hand and say \"If you were a chicken, you'd be impeccable\". He chuckles and says haha my gf would like that joke. my life. Forever alone", 
            "OK here it is. The material is tough, so it helps that he is a good teacher. But the material is still tough so do not go into this class thinking it will be a breeze. He is down to earth and considerate of certain circumstances if you cannot submit assignments on time. Really good with answering questions clearly. He is adorable so it helps too!", 
            "One of the Best teachers Ive had thus far at Princeton. It helps that he's young and understands our generation and the way us students think in general. He's also easy on the eyes, which makes class that much manageable. I normally can't wake up for 9:00am classes but this one I actually look forward to.", 
            "HARD. Don't take.", 
            "No complaints with Disease and Genetics. Exams are tough, just knowing the material isn't enough. His questions are worded to trick you so you have to know the material inside out to do well. Oh and don't suck up! He doesn't like teachers pets. Saw a few of those (mainly girls) get shot down in class real hard lol Overall really funny guy.", 
            "Good class but he's got tricky exams. But I'm you read his lecture notes and ask questions it will Go a long way on the exams. Definitely not a GPA booster but at the very least you learn the material very well. Good for premed students", 
            "Great lecturer. Extremely helpful. Though material but he helps you get it. Highly recommend this class. Only with him though ;)", 
            "Im one of those annoying students that emails like crazy. He's really quick with emails. The material is easy to understand when explained by him, textbook does a terrible job. Rely on his notes in class and record lectures. Ladies! he's a hot young prof so its easy to get distracted by his attractiveness, but if you listen you should be golden.", 
            "The first day of class seemed like it would be easy. He SEEMED like an easy grader. I honestly should have dropped the class because it is way over my head. But he encouraged me to press forward and offered me extra credit so I could lift my grade. To be completely honest his charm is the only reason I stayed in. Tall dark handsome and smart 3", 
            "Cute professor and Great class overall. Im a senior and of a lot of classes Ive taken especially bio based classes were very dry and did not relate to anything useful. This is one of the few classes that takes you back to basics and really gets you to understand how disease and genetics in general really works. Def reccomend"
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "5", 
            "Tough grader ": "5", 
            "Lots of homework ": "2", 
            "Skip class? You won't pass. ": "4", 
            "Participation matters ": "1", 
            "Hilarious ": "4", 
            "EXTRA CREDIT ": "1", 
            "Caring ": "5", 
            "Get ready to read ": "6", 
            "Amazing lectures ": "2"
        }
    }, 
    "1191110": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1191110&showMyProfs=true", 
        "score": "5.0", 
        "name": "Kevin Wayne", 
        "comments": [
            "This was a Coursera course at the first-year grade level (although assuming you can program, and if not they have an amazing book for that too). The course was taught in collaboration with Prof Sedgewick, who did the lectures. Prof Wayne was also participating in the forums, and I found his contribution critically important.", 
            "Kevin Wayne is a really great professor. Lectures are clear and well planned.", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "626013": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=626013&showMyProfs=true", 
        "score": "4.5", 
        "name": "Anne-Marie Slaughter", 
        "comments": [
            "She is very helpful and is genuinely interested in what students have to say during class discussions."
        ], 
        "tags": {}
    }, 
    "199441": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=199441&showMyProfs=true", 
        "score": "3.5", 
        "name": "Robert Kaster", 
        "comments": [
            "Best language teacher I've ever had. Excellent at explaining things and making the language clear. Kaster is an utter champ.", 
            "Dismissive and derogatory toward students.", 
            "Kaster's Da Bomb", 
            "He's the country's authority in Latin prose but he is not helpful at all if you meet with him for help.", 
            "Kaster brings the material to life. He's pretty funny, too."
        ], 
        "tags": {}
    }, 
    "268319": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=268319&showMyProfs=true", 
        "score": "4.2", 
        "name": "Gideon Rosen", 
        "comments": [
            "Outstanding professor and brilliant philosopher. Also a very devoted advisor. Highly recommended.", 
            "He's a great speaker, to be sure; but he's also something of an intellectual charlatan. A lot of rhetorical bark, little philosophical bite.", 
            "While his lectures are well-known for being some of the best on campus, the one thing that I look forward to when attending class is when he takes his graceful hand and fixes his luscious locks of silvery hair woven with the knowledge of centuries of philosophy and sexual enlightenment. My only regret: I didn't sleep with him. Seriously.", 
            "By far the best professor I had at Princeton. Gideon Rosen is the most amazing speaker I've ever heard.", 
            "He taught me nearly 20 years ago at the University of Michigan where he landed a job just after getting his Ph.D. at a ridiculously young age. I can think of few professors whose teaching compared, and his ability to incorporate allusions from his wide reading into lectures was impressive. He also loved to walk campus while reading a book.", 
            "As others have said, a brilliant lecturer--he filled the cavernous McCosh 60 with his jumpy energy. Every time he finished a lecture, I would think about switching my major to philosophy. One of the few Princeton professors about whom you can truly say; you get your (parents') money's worth.", 
            "cool prof, very animated, cuts up during class.", 
            "No Comments", 
            "really, really hot. and, incidentally, a great lecturer.", 
            "One of my favorite Princeton professors--a really spell-binding lecturer.", 
            "Prof. Rosen is animated and compelling. I had a TA who once said of himself that he was \"jumping like a Gideon.\" 'Nuff said."
        ], 
        "tags": {}
    }, 
    "1039930": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1039930&showMyProfs=true", 
        "score": "5.0", 
        "name": "James Marrow", 
        "comments": [
            "Hot", 
            "I luv u!! Emily?"
        ], 
        "tags": {}
    }, 
    "273320": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=273320&showMyProfs=true", 
        "score": "3.2", 
        "name": "Peter Singer", 
        "comments": [
            "The readings are great but Singer is a very weak lecturer. Don't take it. If you're interested in the material, just read stuff on your own instead.", 
            "Singer is an incredible philosopher. He's not an *incredible* professor, but you can still hear his genius when he speaks. There's a reason this guy basically started the animal rights movement. If this class doesn't revolutionize your moral beliefs and practices, you're probably apathetic or not particularly moral", 
            "Intelligent people admire Singer, and usually agree with Singer, unintelligent people usually dislike him and do not agree with his ideas. I dont mean to personally attack those who do not admire him, but that's what I observe. Professor Singer is the best professor and philosopher I know, and I know and have read quite a few.", 
            "Whoa! Dis man be da best teacher i ever done have. Can't say nuff good tings bout dis good sir. He be forever my favorite. He is be a famous man too and not just to me's. I's evens passed his class so dat is a darn good ting also's.", 
            "He's awesome.", 
            "Singer makes his students break away from tradition, to question existing ideas about right and wrong. Take this class if you're prepared to question your belief system and think for yourself.", 
            "I found Singer's idea to be very interesting, and he to be an obviously intelligent person. At the same time I found his class to be extremely boring. He was very diplomatic in his teaching, which sometimes made me lose interest in class.", 
            "No Comments", 
            "Peter Singer has a remarkable honesty when addressing the subject of ethics. He's willing to explicitly come to the conclusions many preceding philosophers only alluded to. His conclusions probably won't sit well with what you were raised to believe but his process is valid and will make you think.", 
            "This man does not belong in Academia. Very wierd ideas. Not recommended", 
            "He is highly overrated. His ideas are pretty radical but you'd never know because he presents them soooo blandly. Don't be fooled by the name...Peter Singer will put you to sleep!", 
            "One of the shining stars.", 
            "Lectures seem to focus on background material unrelated to the philosophical issues at hand.", 
            "Not all he's cracked up to be..but still decent", 
            "His inability to comprehend the logic of Chapter 6 of Francione's \"Introduction to Animal Rights\" indicates a severe weakness in Singer's analytical abilities. Perhaps Singer failed logic class. He lacks solid reasoning skills and should be shun"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Get ready to read ": "1"
        }
    }, 
    "729693": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=729693&showMyProfs=true", 
        "score": "4.5", 
        "name": "Aissata Sidikou", 
        "comments": [
            "INCREDIBLE PROFESSOR - DYNAMIC, SWEET, BRILLIANT, AND TRUTHFUL.", 
            "Really kind, sweet, and easy.", 
            "The Best Teacher you will ever have!!"
        ], 
        "tags": {}
    }, 
    "579664": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=579664&showMyProfs=true", 
        "score": "4.4", 
        "name": "Tom Kelly", 
        "comments": [
            "Prof. Kelly has a great in-class persona. He is very clear, very engaging, makes you see the full implications of ideas and sometimes uses funny examples. He is also very good at answering questions about the content. Loses points for being a harsh grader on papers, providing little feedback, and not being so approachable outside of class.", 
            "What an awesome guy", 
            "Great teacher, extremely clear, very engaging style. Prof. Kelly is very good at capturing the \"so what\" side of big ideas, and is honesty about ideas that don't have so much consequence. Hard grader on papers though with little feedback.", 
            "TK is a great guy; I begged my way into his class last spring. I hope I can take another class with him before I graduate.", 
            "TOO hot for his own good...", 
            "Smart, funny, an engaging lecturer and SO hot -- a killer combination not to be missed.", 
            "kinda cute and SO FUNNY. makes phil fun (usually)", 
            "Tom is here now."
        ], 
        "tags": {}
    }, 
    "700440": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=700440&showMyProfs=true", 
        "score": "4.9", 
        "name": "Eric Gregory", 
        "comments": [
            "Ok. Would be a better class if he weren't so full of himself. Practice what you preach. Humility goes a very long way.", 
            "Best class I've taken at Princeton, hands down.", 
            "Definitely take a class with Professor Gregory before you graduate. I made a mistake by taking his class my senior year, had I taken it earlier, I might have majored in Religion.", 
            "Eric Gregory is an amazing teacher!", 
            "No Comments", 
            "Christian Ethics is an amazing class that everyone should take. Prof. Gregory is the man."
        ], 
        "tags": {}
    }, 
    "424145": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=424145&showMyProfs=true", 
        "score": "3.0", 
        "name": "Mark Rose", 
        "comments": [
            "Professor Rose is very passionate about genetics and it shows - however, the level of difficulty of this course is huge - from the mind-breaking problem sets to the ridiculously long exams (i.e. exams are so long that it feels as if you are not really being tested on your knowledge but rather on how fast you can interpret complex data)", 
            "Nice", 
            "No Comments"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Lecture heavy ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "1707858": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1707858&showMyProfs=true", 
        "score": "4.3", 
        "name": "Mahiri Mwita", 
        "comments": [
            "Mahiri really challenged my preconceived notions about Africa in a way I was not expecting. We read the same literature everyone reads about the continent, but examined how and why those narratives persist to he tshape dominant discourse on Africa. Mahiri is a professor to take if you want the real deal.", 
            "Mahiri is the best."
        ], 
        "tags": {}
    }, 
    "2108908": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2108908&showMyProfs=true", 
        "score": "5.0", 
        "name": "Robert Sedgewick", 
        "comments": [
            "loving his coursera course. very clear, unassuming, and unpretentious.", 
            "bob sedgewick is the only computer scientist you will ever need"
        ], 
        "tags": {
            "Respected ": "1", 
            "Lecture heavy ": "1", 
            "Amazing lectures ": "1", 
            "Caring ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "1980043": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1980043&showMyProfs=true", 
        "score": "5.0", 
        "name": "Anita Husen", 
        "comments": [
            "I really liked that the class wasn't confined to an only speak Arabic rule. English was used sparingly but only when it is was most useful, and that helped me learn a lot more effectively. Anita has a lot of tricks to help students pronounce letters well and remember words. Great class - Anita was always available and very patient. -", 
            "Amazing professor! She makes sure to go over material until students are able to grasp it. Her in-class activities are always very interactive and actually a lot of fun since she interweaves Arabic language with Arabic culture. She also gives feedback on all homework and testsquizzes. She is very helpful and her passion for Arabic is infectious!"
        ], 
        "tags": {}
    }, 
    "650499": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=650499&showMyProfs=true", 
        "score": "5.0", 
        "name": "Smita Brunnermeier", 
        "comments": [
            "very intelegent", 
            "she is very intelegent", 
            "", 
            "Smita is amazing!!!", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "852610": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=852610&showMyProfs=true", 
        "score": "4.0", 
        "name": "M.H. Huet", 
        "comments": [
            "She's great, very knowledgeable & approachable", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "852611": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=852611&showMyProfs=true", 
        "score": "1.6", 
        "name": "Martin Kern", 
        "comments": [
            "cruiously arrogant and self-absorbed", 
            "I think he thinks he's really important, but I haven't seen any kind of proof.", 
            "Seemed kind of confused sometimes. Minor jerk.", 
            "He was a pretty energetic teacher, but he wanted everything done his way."
        ], 
        "tags": {}
    }, 
    "732429": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=732429&showMyProfs=true", 
        "score": "3.5", 
        "name": "David Bellos", 
        "comments": [
            "Great Professor! Even though his class was super early in the morning I looked forward to it.", 
            "Really smart but yeah, mean.", 
            "He can be kind of callous."
        ], 
        "tags": {}
    }, 
    "199384": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=199384&showMyProfs=true", 
        "score": "4.7", 
        "name": "William Jordan", 
        "comments": [
            "This guy is hilarious and arguably the HOTTEST professor at Princeton! (Really, he's a great guy!)", 
            "Amazingly brilliant...makes you want to go to grad school in medieval history for the rest of your freakin life.", 
            "Awesome, Funny, Ridiculously Brilliant", 
            "No Comments", 
            "This prof ROCKS! Incredibly bright, delightfully insightful on broad area of both common and peculiar, arcane subjects", 
            "One of the funniest professors I have had at Princeton."
        ], 
        "tags": {}
    }, 
    "228573": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=228573&showMyProfs=true", 
        "score": "4.0", 
        "name": "Eve Ascheim", 
        "comments": [
            "What a great woman. She is loaded with advice, and has great discussions. Ask her about her family, or her art. She is awesome with lines!", 
            "She is dedicated to teach, gives great feedback, helpful and caring. (Never exaggerates any though on your piece, good or bad, she comments calmly, doesn't feed your ego, doesn't make you feel cheap.) She wants you to feel free and go with your instincts. Within that she helps you to develop yourself as an artist!", 
            "Boring.", 
            "Great course! (Intro to Drawing) It helped me develop my skills. Eve is kind of 'out there' very much a fan of abstract art, so be prepared to interpret. The trips were great, and she's very enthusiastic.", 
            "ONE SEXY TEACHER!!", 
            "Quite the eccentric woman. Keep an eye on her pants, they're wild! Good course, great advice."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Gives good feedback ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "33700": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=33700&showMyProfs=true", 
        "score": "4.5", 
        "name": "Robert Bagley", 
        "comments": [
            "He completely changed the way I look at art and read about art", 
            "Extreme lucidity, great professor", 
            "He's amazing.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "33701": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=33701&showMyProfs=true", 
        "score": "4.3", 
        "name": "Ron Comer", 
        "comments": [
            "Dr. Comer is one of the most enthusiastic professors that I have had at Princeton - His teaching style focuses on intense participation - and what I loved the most was that he would always ask us to answer in a practical yet creative way, making sure to pinpoint why what we are saying is important. Also he explains concepts in an engaging way.", 
            "Had him for abnormal psych and a seminar - loved him!", 
            "Great course, and great guy! He's very chill, funny, easy to talk to, and very well informed. One of the few profs there with a wealth of clinical experience. A course with him is a MUST before graduation!", 
            "this guy actually wrote my abnormal psych textbook. his book is very detailed and clear.", 
            "No Comments", 
            "No Comments", 
            "The best professor ever", 
            "Funny guy!", 
            "No Comments", 
            "fun", 
            "No Comments", 
            "Easily the best professor at Princeton", 
            "One of the best lectures!", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Participation matters ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "1542231": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1542231&showMyProfs=true", 
        "score": "5.0", 
        "name": "Elizabeth Gavis", 
        "comments": [
            "Professor Gavis is a great professor who teaches with clarity and goes at an appropriate pace. Would definitely take a class with her again.", 
            "Professor Gavis is one of the best professors that I have had at Princeton. She delivers amazing lectures that introduce students to the complexity of molecular biology - she expects excellent work from her students and constant critical thinking - All in all, she pushes you to learn and think like a scientist", 
            "she was amazing!"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Amazing lectures ": "1", 
            "Caring ": "2", 
            "Respected ": "1"
        }
    }, 
    "953651": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=953651&showMyProfs=true", 
        "score": "3.4", 
        "name": "Edgar Choueiri", 
        "comments": [
            "Definitely one of the smartest men I have ever met.", 
            "He's quite awesome. You'd be lucky if you had him. Oh and he's super famous now.", 
            "he has no idea what he's talking about", 
            "not surre he understand what he's talking", 
            "A fantastic professor, who does an excellent job representing the Princeton MAE program. He is a prime example of a Lebanese gentleman, and also makes a rather good dish of hummus, (or so the Princeton Lebanese students say). I <3 Ranzi."
        ], 
        "tags": {
            "So many papers ": "1"
        }
    }, 
    "1479819": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1479819&showMyProfs=true", 
        "score": "1.5", 
        "name": "Ana Babus", 
        "comments": [
            "Not good at teaching. Reading off slides in class but her slides are not helpful and not explanatory at all. I can only reference to them to know what are some major terms or issues that I should know when self-studying at home. Be prepared to study a lot by yourself and read books very carefully.", 
            "She is absolutely awful. Extremely rude and unwilling to help. Avoid her at ALL costs."
        ], 
        "tags": {}
    }, 
    "625689": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=625689&showMyProfs=true", 
        "score": "5.0", 
        "name": "Milton Babbitt", 
        "comments": [
            "Absolute genius."
        ], 
        "tags": {}
    }, 
    "697084": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=697084&showMyProfs=true", 
        "score": "3.5", 
        "name": "Martin Scherzinger", 
        "comments": [
            "", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1830942": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1830942&showMyProfs=true", 
        "score": "1.3", 
        "name": "Gerald Buchanan", 
        "comments": [
            "This guy was plain AWFUL!", 
            "Worst professor I've had in my four years at Princeton!!"
        ], 
        "tags": {}
    }, 
    "433335": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=433335&showMyProfs=true", 
        "score": "3.5", 
        "name": "Charlie Gross", 
        "comments": [
            "He cool", 
            "Very smart, very disorganized.", 
            "good thesis adviser"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Gives good feedback ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "2276238": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2276238&showMyProfs=true", 
        "score": "5.0", 
        "name": "Erin Vearncombe", 
        "comments": [
            "Our entire campus is absolutely obsessed with her.", 
            "Dr. V is probably the best thing that has ever happened to me. She's an amazing Professor who doesn't belittle you simply because you're a student. She seeks to understand you ideas rather than shut them down like many other professors. She's a gem, adorable, and introverted which makes her all the more genuine. Her office hours are a great help!!!"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Participation matters ": "1", 
            "Accessible outside class ": "1", 
            "Caring ": "1", 
            "Clear grading criteria ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "908390": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=908390&showMyProfs=true", 
        "score": "5.0", 
        "name": "Dixit Avinash", 
        "comments": [
            "this is from a couple years ago - he no longer teaches. I was just reflecting on how such an insanely gifted and hardworking man still took the time to be a wonderful teacher.", 
            "Professor Avinosh is very helpful. Clarity is apparent in his classroom. But....the best part of being in class is looking at his beautiful face.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "798762": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=798762&showMyProfs=true", 
        "score": "5.0", 
        "name": "Paul Prucnal", 
        "comments": [
            "Kind and generous person who really cares about his students. He's also brilliant.", 
            "He really cares about his students. I would take any class he is teaching.", 
            "A wonderful and engaging lecturer and a relatively easy grader. He wants you to understand the material and is an extremely kind man. Take any classes you can with him, especially if you're interested in optics.", 
            "Professor Prucnal is the best professor ever! He even got me an internship in fibre optics in Hong Kong!", 
            "Professor Prucna's lectures were always interesting and he is extremely approachable. He really cares about the students and is willing to help outside of class.", 
            "Made the subject exciting and relevant!"
        ], 
        "tags": {
            "Respected ": "2", 
            "Inspirational ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "794814": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=794814&showMyProfs=true", 
        "score": "4.8", 
        "name": "Michael Wood", 
        "comments": [
            "Maybe the best professor I've ever had-- each seminar was engaging, and the assignments were tailored to our interests.", 
            "Fantastic.", 
            "Excellent professor, excellent advisor. Can sometimes be difficult to contact, but every meeting is worthwhile. Brilliant!", 
            "Can't say enough good things about this man...he's simply amazing. Has fantastic taste in literature, and his lectures are wonderful--always interesting and insightful. Great sense of humor, too."
        ], 
        "tags": {
            "Respected ": "1", 
            "Participation matters ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "551100": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=551100&showMyProfs=true", 
        "score": "4.8", 
        "name": "Benjamin Widiss", 
        "comments": [
            "In addition to being one of the most challenging and engaging professors I've ever had, BW is also perhaps the kindest individual I've ever met.He's genuinely interested in what you have to say and in helping you to say it more clearly. He understands the social dynamics of the classroom and university. And...have to say it: I effing love that man.", 
            "If you're like me you just Googled B.W. at 2am because he changed how you read books (talk to him on textuality in Z. Smith). Changed how you watch film (see South Park with him sometime and bring up authorial intent.) I'm approaching 350 characters, so I'll close thus: Take as many classes as you can with this guy. I wish I'd taken more. -PU06", 
            "Prof. Widiss is engaging, curious, witty, eloquent, insightful and a pleasure to have. As others have noted, I had never before worked so hard on my writing nor spent so much time and focused energy on the readings, but I also never had had such a wonderful literature professor.", 
            "Professor Widiss is unbelievable. He's so engaging- he works hard in lecture and expects you to work hard in precept. He's genuine and interested in his students (and he gets cute & flustered sometimes). He pushes hard but it's worth it. If he can get me to understand Faulkner, he can teach anyone. Genius.", 
            "Benj is, without question, one of the best professors of anything I have ever had. I worked harder in his class than in any other class I took at Princeton, but I also discovered my JP and thesis topics/life's passion there (which is something I could never have done by simply reading the material on my own -- it required a lot of guidance). He is a bold and brilliant scholar who is way ahead of the game in his still-developing field (post-modern American literature). I can't recommend him highly enough.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1872573": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1872573&showMyProfs=true", 
        "score": "4.9", 
        "name": "Simon Cullen", 
        "comments": [
            "Professor Cullen is the most dedicated prof I've ever had. Thanks to his attention I've made an amazing improvement in my writing and reasoning this sem. His class has also awoken a love for philosophy that I never knew I had! If you're lucky enough to get in, take this class!!", 
            "very helpful and fun", 
            "I'm so glad I got to take this class! I worked harder for Simon than I did for any of my other classes but it was worth it! The skills I gained have been incredibly useful.", 
            "Professor Cullen is funny, brilliant, and incredibly committed. I looked forward to every class session. He went to great lengths to help us understand the course material, including posting videos on YouTube and holding extra office hours. It was evident how much he cared about his students. He is the kind of professor you hope to get!", 
            "Simon is the best teacher I have ever had the chance to learn from.", 
            "Amazing teacher!! Always willing to meet with and help students. Super clear explanations and really really cares about students and their learning. He definitely understands and cares about teaching method, not just the material. Also an awesome guy!", 
            "The mapping technique is useful not only for analyzing others' arguments, but also for planning and critiquing my own. Indispensable tool! Simon was very helpful with learning the mapping.", 
            "Simon is one of the best instructors I have ever had. His approach to teaching us argument mapping was perfect. I left this class with many important skills -- most importantly, the ability to decompose complex arguments into understandable sub-pieces. My ability to write clear and concise papers also significantly improved as well.", 
            "It is clear that Simon genuinely wants you to learn. His innovative teaching style and tools make it possible."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "7", 
            "Lots of homework ": "4", 
            "Participation matters ": "2", 
            "Hilarious ": "1", 
            "Caring ": "3", 
            "Amazing lectures ": "2", 
            "Inspirational ": "2"
        }
    }, 
    "428040": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=428040&showMyProfs=true", 
        "score": "4.4", 
        "name": "Hans Halvorson", 
        "comments": [
            "One of the best professors in the Philosophy Department for sure.", 
            "Prof. Halvorson is great. If you don't like logic, his intro class will be hard, but that's hardly his fault! He's very clear, open to questions, and always well prepared for lectures. The only downside is that he leans too much towards formal math in his more advanced classes.", 
            "Tends to digress, but worth listening to on any topic. Excellent at presenting each argument in its strongest form. Very sincere about his job; takes pains to make sure that everyone understands (almost to a fault). Fascinating guy, nice, funny, brilliant, and interesting. Recommended for any philosophy class.", 
            "No Comments", 
            "basically average in every way (except in intelligence, and with the # of mistakes he makes even that is sometimes doubtful), but he knows it and his self-deprecation is cute - you either love or hate logic, and i think it's worth finding out which"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "572924": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=572924&showMyProfs=true", 
        "score": "2.2", 
        "name": "Edmund White", 
        "comments": [
            "so cool and hip and contemporary & pc", 
            "I dropped White's class after only a week -- it was that painful. His response to every question -- even the most legitimate ones -- was, \"who knows?\" Apparently not him -- don't waste your time on this rubbish.", 
            "Very cosmopolitan; gives feedback pretty gently but informatively. Great lit taste!"
        ], 
        "tags": {}
    }, 
    "840975": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=840975&showMyProfs=true", 
        "score": "5.0", 
        "name": "Simone Marchesi", 
        "comments": [
            "Best professor in the French & Italian department, maybe Princeton.", 
            "Prof. Marchesi is, by far and without exaggeration one of the best professors I have ever encountered. He is incredibly dedicated, and his courses are rigorous, well-taught, extremely interesting and fulfilling.", 
            "No Comments", 
            "No Comments", 
            "Professor Marchesi is a wonderful teacher, very clear and concise, and in a seminar he is suberb at drawing the best from his students, and does not try to impress them with his knowledge which is vast."
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Caring ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "2455361": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2455361&showMyProfs=true", 
        "score": "5.0", 
        "name": "Yecheng (Kent) Cao", 
        "comments": [
            "Interested in discussing both pragmatics and topics of group interest. Natural and professional. Made me consider teaching more rigorously.", 
            "Kent was extraordinary. He always moderated our precepts in a way that made discussions extremely interesting, and was accessible outside of class. He brought humor and a lively demeanor to our precepts that made me excited to come to class, and I think Kent was one of the central reasons as to why I enjoyed this class so much."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "2", 
            "Caring ": "1", 
            "Participation matters ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "13058": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=13058&showMyProfs=true", 
        "score": "2.8", 
        "name": "Morton Kostin", 
        "comments": [
            "Great professor. Takes the time during office hours to guide students to deeper understanding of the material.", 
            "He's very clear, but very very unkind. You will know what you need to know by just attending lecture; I wouldn't advise actually talking to him.", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "240868": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=240868&showMyProfs=true", 
        "score": "4.5", 
        "name": "Francois Rigolot", 
        "comments": [
            "He's the best there is, and incredibly nice too.", 
            "He's hot! You should definitely take his class! 2 thumbs up.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "793809": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=793809&showMyProfs=true", 
        "score": "5.0", 
        "name": "Jason Fleischer", 
        "comments": [
            "The best professor I have had in my career at Princeton! He should teach physics to ALL students!", 
            "Prof. Fleischer is the man! Very smart and cool prof. He moves at a fast pace and expects a lot from you. His tests are challenging, and focus mostly on physical understanding. He's a very fair grader and is always willing to help you. His class is like a complete education in itself!"
        ], 
        "tags": {}
    }, 
    "13057": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=13057&showMyProfs=true", 
        "score": "4.9", 
        "name": "Jennifer Johnson", 
        "comments": [
            "She's a great professor who really tries to teach you the material in more ways than one. She has funny quips at times that make class less boring.", 
            "So funny. She seems a little dry at first, but if you listen she throws in a lot of clever comments. Pretty good at explaining course material. The material is fairly boring, though.", 
            "Really nice, extremely clear lecturer. Will do anything to help you, but wants to see that you are trying your best first. Very very available to meet with etc.", 
            "She's excellent"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Gives good feedback ": "1", 
            "Caring ": "1"
        }
    }, 
    "422768": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=422768&showMyProfs=true", 
        "score": "4.7", 
        "name": "Pablo Debenedetti", 
        "comments": [
            "he is really great", 
            "Brilliant, intelligent, hard working, insightful and extremely helpful. He is the man!", 
            "Stat mech with Pablo was one of the toughest classes I took at Princeton. We had only two problem sets, no exams, and that was still enough to prune away nearly half the class. Those problem sets were beasts. Can't blame him though. I'm not a genius, but he is, so much of what he says will be over my head. Most importantly: I learned some humility.", 
            "Even if you hate and suck at Thermo you love him as a prof.", 
            "omg his guy is sweet he is so nice but hard", 
            "i just started his class and he really knows his stuff and the first day he knew my name!!! All of the other teachers were cluless about our names but he gave an awsome impression by having our names memorized. Also he must spend hours on his lectures that are amazing... props to him... he is awsome!!!", 
            "sexiest person alive!", 
            "he's cool", 
            "I love him! He is so cool sure he is a little hard but come on lighten up a little LIVE! thats to all of you people that don't like them.", 
            "Best prof in the dept."
        ], 
        "tags": {
            "Clear grading criteria ": "1"
        }
    }, 
    "933570": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=933570&showMyProfs=true", 
        "score": "5.0", 
        "name": "Simeon Chavel", 
        "comments": [
            "Prof Chavel is clearly one of the most caring and devoted professors in the field. He is always available, open to talk, interested in how you're processing the material, and such. He is quick to respond as well; He is really a model professor and made learning about the HB exceedingly interesting. HOWEVER, he is NOT easy, and that is a GOOD THING", 
            "This class is enthralling. We are all completely transfixed and enchanted by his lectures. Prof. Chavel is the best professor at Princeton.", 
            "No Comments"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Get ready to read ": "1"
        }
    }, 
    "761834": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=761834&showMyProfs=true", 
        "score": "1.0", 
        "name": "Gilbert Harman", 
        "comments": [
            "As a professor, just restating what the book says, lectures useless. As a review for the final test he told the preceptors that the only thing they were allowed to tell us about the short answer test was that it contained short answers.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1695875": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1695875&showMyProfs=true", 
        "score": "1.8", 
        "name": "Alicia Adsera", 
        "comments": [
            "Extremely boring lectures, poor teaching.", 
            "Made me lose my interest in Economics.. basically self-taught the entire course, going to lecture was pretty pointless.", 
            "strong latin accent and very fast speech requires strict attention but still very very hard to fully understand even with microphone on. Young and very attractive and very smart and prepared."
        ], 
        "tags": {}
    }, 
    "429069": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=429069&showMyProfs=true", 
        "score": "3.7", 
        "name": "Amaney Jamal", 
        "comments": [
            "Very enthusiastic about the subject. I disagree strongly with the first comment that she is biased; I felt she lived up to her moderate point of view. Assigned reading on both sides of any given question. Unafraid to express her own views in class, but makes sure to very clearly label them as such.", 
            "It was a privilege to study under her. Very helpful, informed, considerate, and no, contrary to the previous reviewer, she is not concerned with getting you to like her. An asset to Princeton.", 
            "very bias and too opinionated in lecture courses. i wouldn't call her 'even handed,' and find it surprising that so many people credit her for her moderate point of view - her lectures suggest otherwise. Doran would be a better representation of moderate."
        ], 
        "tags": {}
    }, 
    "482271": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=482271&showMyProfs=true", 
        "score": "3.9", 
        "name": "Michal Cadden", 
        "comments": [
            "He seems more amused by his own stories than actually getting into course content. He was just ok. People are often dazzled by his outgoing personality, but that gets old after a few classes. I was grateful I went through several peer editing sessions before turning in my papers. I did fine in the class, but others suffered.", 
            "Michael is amusing, I'll give him that. His naughty anecdotes are enough to keep any class flying, and he is certainly one of the most erudite living scholars in his field. But be prepared: he plays favorites like no other professor I've ever had.", 
            "No Comments", 
            "It has been a long time since I've taken Michael Cadden's classes, but I can still say, unequivocally, he is the best professor I've ever had. His lectures are works of art, and he is a compelling, brilliant presence in the classroom. The unsung gem (to mix a metaphor) of the English Department."
        ], 
        "tags": {}
    }, 
    "756860": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=756860&showMyProfs=true", 
        "score": "5.0", 
        "name": "Arion Melidonis", 
        "comments": [
            "Dr. Melidonis is, by far, the best teacher I have ever had. His lectures are interesting, his classes are active, and the work that he assigns is insightful. It is impossible to have a conversation with him without learning something, and hes always willing to stop and talk when he can. Have taken 9 units from him and will take more.", 
            "Prof Melidonis' class is a complete cake walk if you care about your grades. Yes you have to come to class and yes you have to keep up with the readings to do well on the test. He really knows the material and is always willing to help students out as long as you are trying to help yourself. A++ PROF!!!", 
            "Mr Melidonis is a professor with Swiftian wit and knowledge honed with an osteodontokaratic precision. A better theoretician one could not find on this side of the Mississippi. When you think of Cypress, think of Mr. Melidonis.", 
            "In a word, he rules. He know what up. Besides, he's got the best kung-fu in the department - by far."
        ], 
        "tags": {
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "136445": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136445&showMyProfs=true", 
        "score": "3.5", 
        "name": "Martin Semmelhack", 
        "comments": [
            "Took semester 1 of Orgo in 2013. VERY frustrated by his course. Pulled off a B+ with great difficulty, and left absolutely HATING chemistry and dropped pre-med. Returned to pre-med 3 years later, took orgo again (as a \"post bacc\") at Columbia with a different professor, and it was AMAZING! LOVE orgo/chem now. Semmelhack almost ruined chem for me.", 
            "Professor Semmelhack is simply a great lecturer. He is extremely well prepared and conveys the material in a very clear and interesting manner. His examples are new and interesting and this course has opened my eyes to the wonders and importance of this field.", 
            "Worst. Class. Ever. Material itself is extremely confusing and Semmelhack just shoots off by himself during lecture, assuming everyone is up to his level and expertise. Not taking him next semester, thank god.", 
            "HE'S AWESOME!!!!!!!!!!!!!", 
            "He is one of the most helpful professors I have had for a course with this many students", 
            "Really good lectures. Very clear and helpful. Great with emails. Lab kind of sucks.", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "813673": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=813673&showMyProfs=true", 
        "score": "4.0", 
        "name": "Lee Mitchell", 
        "comments": [
            "I don't get all the positive reviews. He loved the sound of his own voice and often sidelined student discussion with his own interests and tangents. In my first office hours visit, I outlined my topic through Email and he simply told me \"I don't know about topic\" when I arrived. On the second visit, he was visibly annoyed by my presence.", 
            "One of the most concerned, honest, student-oriented professors I've ever had. Extremely interested in students' comments--capable of not just responding to them but crafting them into revelatory conclusions as well. Knows how to assert differences between arguments in the right way. A rare, actual teacher. A real human. Amazing.", 
            "Professor is a great lecturer, but enamored with the sound of his own voice. Puts on a good show, but trust me, he could care less about the students in his class. Has bait-and-switched several times by making his seminars into lectures when too many people sign up, and only half the class gets to have him as the preceptor.", 
            "he is good", 
            "I am only about a third of the way through this course, and I am a freshman, but Prof Mitchell is inspirational. My other profs seem shallow by comparison--he really listens to us, and while he's sometimes complicated, there's something mad authentic with him.", 
            "one of the nicest, most imformative teachers ive ever had."
        ], 
        "tags": {
            "Participation matters ": "1", 
            "Get ready to read ": "1"
        }
    }, 
    "136447": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136447&showMyProfs=true", 
        "score": "3.7", 
        "name": "Maitland Jones", 
        "comments": [
            "It's a hard class but you will learn. The exams are really hard, but if you put in the work and do problems constantly you will do well. The lectures only cover the basics, which he explains very well. Tests force you to use critical thinking and reasoning skills.", 
            "the Geezer has more to teach than chemistry. He was around before the dinosaurs. Some commenters find him arrogant, I find him honest and sincere. Remember that humor can be a more important lesson than orgo sometimes. Oh, and come hashing!", 
            "HE IS THE BIGGEST BAD-ASS in the world...there isn't a better teacher out there!!!!", 
            "Probably the best professor I have had yet. Interesting approach to teaching the material. Very clear and insightful lectures.", 
            "You won't find a better teacher than MJ. I know that now that i've been in grad school for a while.", 
            "Genius yes, but of what benefit is a professor's genius if he cannot relate to his students? To say that he rambles is an understatement, and he blames the low averages of the exams on the class to boot. Condecending and far from friendly.", 
            "MJ gets a bad reputation because of the difficulty of the course. He is an excellent teacher, and he knows the name of all 150+ students.", 
            "just awful: confusing, arrogant, and mean.", 
            "MJ teaches the course at a very advanced level. You come out with superb analytical skills. Downside: It's VERY easy to miss the basics! You never need to know nomenclature! Lectures: Disjointed, confused, unclear, rambling.", 
            "Professor Jones is great. His course is challenging, but also fun, and teaches the subject (organic chemistry) at a very sophisticated level.", 
            "eccentric, genious, cool", 
            "No Comments"
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1", 
            "Tough grader ": "1", 
            "Get ready to read ": "1"
        }
    }, 
    "136441": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136441&showMyProfs=true", 
        "score": "4.0", 
        "name": "Elizabeth Bogan", 
        "comments": [
            "Her lectures lack any objectivity and balance of both sides of an issue. They are an ongoing, disorganized spewing of her opinions based on outdated references. She doesn't allow questions during class so there is no opportunity for a discussion that could lead to explorations of other ideas than hers. AWFUL", 
            "Professor Bogan is a hero among women. She is the successful lady economist of your dreams. She is a brilliant lecturer and patient and fair in office hours. Take all of her classes, fantastic for Public Economics and American Economic History.", 
            "I took 101 followed by 102, and I devised this strategy: Ignore the textbook. Go to lecture. (Though a friend did the opposite and got OK grades, too.) This was one of the unsung changed-my-life classes, not because it made me scrap my plans and become an economist but because I used it and thought about it every single day from then on.", 
            "This course was better than previous. But she's still horrendous. Cannot believe I took her for this semester and the following.", 
            "Fantastic professor, my favorite in Economics so far!", 
            "Bogan is a good lecturer and a helpful teacher. She's a lovely professor to have, but be ready for some less-than-perfectly written exams and a worthless textbook.", 
            "Professor Bogan is amazing. She inspired me to become an Economics major - even though it was not an easy - and inspired me to pursue a career in business. She is an great professor and advisor, as well as a tremendous role model for women pursuing a career in Economics, Finance and business.", 
            "She was my professor at FDU 28 years ago and was BY FAR the best professor I ever had, left me with a life long passion for economcis", 
            "Love love love Bogan. Favorite Professor of all time. She is seriously smart. Changed my whole outlook in Princeton and after. My thesis was influenced by her love of monetary policy.", 
            "Beth Bogan made me love economics when I was dreading having to take it. Found her lectures crystal clear and interesting, and she's one of the most approachable professors I've ever had. Ended up taking a lot more econ. One of my absolute favorite profs ever.", 
            "Boring but nice", 
            "Took her class 25 years ago at a different school....she is who inspired me to go into economics and finance...", 
            "She's a bit boring, but definately well intentioned. Her lecture slides which are available online are very good so you don't really have to go to class.", 
            "I took her course more than 10 years ago, and I'm still scarred. While she keeps a good front by holding more office hours than most, she doesn't connect with most students. Her lectures are notoriously unstructured, and you'll have a hard time following them if you're a novice. She's well intentioned, but she's not an effective teacher.", 
            "not good", 
            "Clear, but a little dry. Most office hours I've ever seen, from any professor, anywhere. Really cares about students.", 
            "Great course, well taught, excellent lectures, precise and accurate testing", 
            "Fantastic teacher. Has the most office hours on campus", 
            "takes a boring subject and makes it even more boring. zzz....", 
            "While some might describe her lectures as dull, they are right on the mark in terms of what you need to know, and should know, about the subject matter. Makes herself extremely accessible. Very straightforward courses, excellent teaching abilities."
        ], 
        "tags": {
            "Accessible outside class ": "3", 
            "Respected ": "3", 
            "Gives good feedback ": "2", 
            "Graded by few things ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "136442": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136442&showMyProfs=true", 
        "score": "3.1", 
        "name": "James Gould", 
        "comments": [
            "Interesting and very knowledgeable, but didn't seem to care too much about the students or the class.", 
            "Great professor; never had any interest in biology before this class, but by the end of the semester I found myself looking forward to lecture", 
            "Truly an amazing professor. He knows what he's talking about and makes it an engaging experience for students", 
            "Horrible Prof. Horrible person.", 
            "I loved this class!", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "Sarcastic, self-important and arrogant"
        ], 
        "tags": {}
    }, 
    "2016822": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2016822&showMyProfs=true", 
        "score": "3.5", 
        "name": "Andrew Appel", 
        "comments": [
            "very hard lot of homework", 
            "The material is super interesting, but the class is pretty tough."
        ], 
        "tags": {}
    }, 
    "1329006": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1329006&showMyProfs=true", 
        "score": "3.2", 
        "name": "Sergey Norin", 
        "comments": [
            "Not quite as helpful as in MAT 214. Tended to teach clearly but slowly so textbook use was heavy in order to keep up with the homework assignments, which covered topics not yet taught in class", 
            "Relatively clear and approachable as far as math professors go", 
            "Pretty cool person. If you follow what he is doing, he is awesome."
        ], 
        "tags": {}
    }, 
    "543287": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=543287&showMyProfs=true", 
        "score": "3.1", 
        "name": "Sophie Gee", 
        "comments": [
            "u ish good ingrish teekcher. Tanks for all da helps", 
            "Incredibly eloquent. Fantastic at prompting and guiding discussion in small seminars. Her handouts on paper-writing and her writing advice is the most valuable I have ever received, and has clearly improved my grades in all subjects.", 
            "An exceptional talent and very inspiring to have her teach, especially as an expat Aussie myself.", 
            "Smoking hot.", 
            "Awful.", 
            "How could anyone call her awful? She made me completely reconsider my major--her English lectures were so exciting--she brought the authors to life! I went to her classes while sick! And her comments on my papers were extensive, helpful and lucid. I would take anything by her and you should to!", 
            "awful."
        ], 
        "tags": {}
    }, 
    "802583": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=802583&showMyProfs=true", 
        "score": "4.8", 
        "name": "Stephen Kotkin", 
        "comments": [
            "Best class I have ever taken.", 
            "Dr.Kotkin is a great scholar and a historian, I enjoyed his lecture and loved his book, \"Armageddon Averted\".", 
            "I heard Dr. Kotkin lecture once and all I can say is WOW! Imagine the voice of Joe Pesci with the ability to leave you hanging on every word he says. Magnetic Mountain and Armageddon Averted are two of his books that I own and have read. He is truly a great historian and from what I have seen a great professor. Good guy too."
        ], 
        "tags": {
            "Amazing lectures ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "1462638": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1462638&showMyProfs=true", 
        "score": "3.3", 
        "name": "Russell Nieli", 
        "comments": [
            "Very interesting lectures! Manages to explain difficult topics!", 
            "Great at explaining otherwise dense text. Thoroughly enjoyed coming to class with him, and encourage anyone taking a class with him to stay and talk after.", 
            "Really enjoyed Professor Nieli. He was so much fun! I had an awesome Summer experience, and it was a challenging course", 
            "Intelligent, yet has a difficult way of conveying it. Is not smooth in speech, and says \"Umm\" far too often. However, he is all together intelligent, and well read.", 
            "He is smart but the way he speaks isnt the smoothest or most interesting."
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "999616": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=999616&showMyProfs=true", 
        "score": "3.8", 
        "name": "Fei-Fei Li", 
        "comments": [
            "Great class. She makes lectures and references to the textbook clear. Only problem is that it is rather hand-wavy at times but perhaps this is understandable, since it is an introductory class. Good introduction to computer vision. I would recommend this class to new-comers.", 
            "Great class"
        ], 
        "tags": {
            "Respected ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "556516": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=556516&showMyProfs=true", 
        "score": "4.6", 
        "name": "Robert George", 
        "comments": [
            "Brilliant lecturer. Engages students in a large lecture. Examines both sides to arguments and leaves his personal politics outside the classroom. A wonderful experience.", 
            "Amazing teacher. Fair. Honest. Brilliant. Cares about students.", 
            "A must for students who want a real education. The constitutional issues discussed would interest any modern American. This course makes students think with the clarity one should expect to have on leaving college. Professor George is rightly known for his fairness, interest in his students, and his love for lively but respectful debate.", 
            "Professor George's courses on constitutional interpretation and civil liberties are a must for any Princeton student interested in responsible citizenship. I've heard so many people remark that while their personal interests lie outside of politics, George's classes taught them the kind of critical thinking necessary for a democracy to thrive.", 
            "By far one of the best classes I took at Princeton. Professor George does an excellent job of challenging students to articulate both sides of the issue. His classes equipped me with the intellectual tools to critically evaluate controversial issues from all angles.", 
            "One of the best classes I had at Princeton. Professor George challenged us to examine our beliefs, no matter what they were. Talented lecturer and excellent material.", 
            "Professor George was the best teacher I encountered at Princeton. He led terrific class discussions, and really stretched students to consider alternate points of view.", 
            "One of my best professors at Princeton. Hard but fair.", 
            "I suspect that the two hateful comments in this thread weren't written by Princeton students; all the Princeton students I know can express their opinions in a more grownup fashion. Professor George's courses were the two best of my entire time at Princeton. His clarity, civility, and eye-opening insight changed the course of my academic career.", 
            "This is the best professor I ever had. Because of this class, I majored in the Politics department at Princeton, and went on to a top law school. I still remember things he said when he taught. This is THE top Professor at Princeton.", 
            "Congenial, deadly brilliant, unassuming, provocative, necessary for a complete Princeton experience. His liberal colleagues have only the highest respect for him and have given him the country's most respected constitutional law chair. 'Nough said.", 
            "really smart and clear", 
            "As a true-blue liberal, I must say that I LOVED his classes -- what an eye-opener! He's brilliant, probably the best professor I've ever had, and single-handedly impacted my career decisions. Take the course, be prepared to do worse than you might in other classes -- you will definitely benefit.", 
            "Take only if you have the stones to be shocked out of your blue state bigotry. RG is smart and provocative. He will shatter your complacency.", 
            "One of the best reasons to go here. Intelligent and insightful.", 
            "Rocks", 
            "Great.", 
            "Awesome.", 
            "classes and reading are generally thought-provoking and balanced, but he is a bit of a prima donna. a lot depends on your preceptor (avoid oakley)", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1889152": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1889152&showMyProfs=true", 
        "score": "5.0", 
        "name": "Andrew Ford", 
        "comments": [
            "I learned to go from translating to reading", 
            "Outstanding professor. Ford is a blast to have class with: he's helpful and energetic, but he's a difficult grader."
        ], 
        "tags": {
            "Respected ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "327711": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=327711&showMyProfs=true", 
        "score": "3.1", 
        "name": "John Conway", 
        "comments": [
            "I attended a seminar Conway held at West Chester University of PA on surreal numbers. He is a genius, and it shows. He's hard to follow at times, and moves very quickly, but that comes with the brilliance. I recommend math majors/graduates see him any chance you get, it's an unforgettable experience.", 
            "I had this professor during FSI2006, and I'm surprised I passed.", 
            "No Comments", 
            "Conway's very hard to follow, and there was almost no class structure at all. Oddly, this didn't hinder most of the class at all; he's an incredible genius, and a great lecturer besides. Just ASK EVERY QUESTION YOU CAN, and the class'll be the most fun you've ever had.", 
            "Conway's a force to behold. Just make sure you stop him to ask questions, or he'll zip by you and not even realize it.", 
            "He looks like Santa Claus. He invented surreal numbers. He has been to Japan. He is hot. He will have visited the state of Michigan at least twice by the end of the year. TJCG is EXTREME."
        ], 
        "tags": {}
    }, 
    "138362": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=138362&showMyProfs=true", 
        "score": "5.0", 
        "name": "Jamie Rankin", 
        "comments": [
            "Janie Rankin has helped decades of students not only learn German but get excited about it. Its not only his teaching but what he did to establish excellence in teaching of beginner/intermediate German students across the department.", 
            "By far the best language teacher I have ever had. He is knowledgeable, engaging, and sincerely wants to help. You actually want to do all of the homework he assigns because the more time you spend on the homework, the more active you can be in class. If every teacher were like him, students would be way more responsive to college work.", 
            "I had the privilege of taking Prof. Rankin's class while at Binghamton (a long time ago)...my first college class. When I found this site, he's the first prof I looked up, these many years later. That should tell you how highly I think of him. Genuine, passionate, brilliant. jawohl!", 
            "I agree with the other rater - Jamie Rankin was the best professor I had at Princeton in all my four years. Thanks to his teaching, I was proficient in a foreign language in 10 months and I am still highly proficient in German, 8 years later! Vielen dank, Herr Rankin!", 
            "Herr Rankin ist sehr toll! Jamie Rankin is definitely one of the most pedagogically gifted people I've ever met. From the very first class, he's speaking German to you and you're speaking German back. Nothing short of miraculous.", 
            "Without a doubt, the best professor I had during four years at Princeton."
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Caring ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "708485": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=708485&showMyProfs=true", 
        "score": "5.0", 
        "name": "Claire Gmachl", 
        "comments": [
            "Most Students usually find her classes not too hard because she as actually really good at teaching.", 
            "Professor Gmachl is awesome and extremely smart."
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "786473": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=786473&showMyProfs=true", 
        "score": "4.2", 
        "name": "Tomoko Shibata", 
        "comments": [
            "best decision you could ever make", 
            "No Comments", 
            "Funny lady. Good teacher. Very nice."
        ], 
        "tags": {}
    }, 
    "105956": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=105956&showMyProfs=true", 
        "score": "4.3", 
        "name": "Tamsen Wolff", 
        "comments": [
            "Best lectures of my life. This class--Contemporary Drama--is amazing.", 
            "TAMSEN IS A GENIUS", 
            "Amazing. Professor Wolff brings up great points and completely engages the class. She's quirky and funny and her lectures are incredible. I had heard she was brilliant but terrifying, but she's just brilliant. She's a serious grader, but totally fair.", 
            "I had her for contemporary drama and I loved every minute of it (okay maybe one or two of the plays I could have done without, but they were all included for a reason). She's fantastic. Her lectures are smart and funny, and my writing really improved with her help. I loved this class.", 
            "Take a class with her! I liked her so much, I asked her to be my advisor. She's amazing.", 
            "I can't say enough good things about Tamsen. I was excited to come to every class. In fact I don't think anyone was absent all semester. I learned so much, not just about contemporary plays but about theatre and how it works and about writing. Tamsen is tough but fair, she's hilarious and she's really helpful. One of the best classes I've taken.", 
            "If you don't fall in love with plays (or her) you're crazy.", 
            "Hands down, the single best professor I encountered during all four years of college.", 
            "She is overrated in every possible sense. Hottest in the ivy league (you gotta be kidding!) If we want to be in a class where the teacher shamelessly panders to musical theater geeks then take this class. The fact that she got tenure at Princeton is staggering and as utterly incomprehensible and nonsensical as her lectures, which she works hard", 
            "wonderful class, really fun prof. she knows an amazing amount of stuff about theater", 
            "No Comments", 
            "cool young hip", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "1793488": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1793488&showMyProfs=true", 
        "score": "3.9", 
        "name": "Cagan Yalama", 
        "comments": [
            "One of the hardest classes I had last year, but listen to him carefully - he actually tells the final questions in the class.", 
            "very hard physics teacher", 
            "10/10 would take class third time", 
            "I took his Thermodynamics course which was easier than I predicted. He knows a lot about everything but his tests are kinda hard. He doesnt take attendance so come and go as you please", 
            "This is my second time taking Physics, and his class was much more informative and easier to understand. I wish I had him last year."
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Beware of pop quizzes ": "1", 
            "Lecture heavy ": "1", 
            "Hilarious ": "1", 
            "EXTRA CREDIT ": "2", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "1186025": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1186025&showMyProfs=true", 
        "score": "4.4", 
        "name": "Selig Ralph", 
        "comments": [
            "He is one of the best that Princeton has to offer", 
            "Very good Very Patient", 
            "He is very patient,and explains well.", 
            "Explains clearly"
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "2097447": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2097447&showMyProfs=true", 
        "score": "5.0", 
        "name": "Maria Garlock", 
        "comments": [
            "Great Professor that has an amazing family I extremely enjoy hearing stories about!!! :)I strongly recomend", 
            "She was a great professor and anyone interested in the arts and the details in this world and I would recommend you to take her class she was awesome!!!!!"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Group projects ": "1"
        }
    }
}