{
    "545784": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=545784&showMyProfs=true", 
        "score": "4.0", 
        "name": "Andrew Ng", 
        "comments": [
            "I've participated in Andrew Ng's Machine Learning and Deep Learning courses on Coursera. They are really amazing.", 
            "he is a great teacher", 
            "Made a wonderful subject unnecessarily hard because of hurried explanations and VERY sloppy notation. Every method has the term K, so K can mean any number of different things on a given day of the week. Sucks.", 
            "great", 
            "Participated in Coursera MOOC. Excellent course. Highly Recommended. Inspirational and Humble figure. Extreme clarity in deliverance. Relevant and useful assignments, makes you ready to employ the technique to real life problems. Thanks for becoming a hero in ML and AI buy providing your wealth of experience to thousands of underprivileged.", 
            "Greatest professor ever! I am currently in the third week of his Machine Learning course (created by Stanford, offered through Coursera). It's absolutely amazing! Prof. Ng explains pretty advanced topics in understandable ways. His numerous lecture videos are top-notch. Thank you, Prof. Ng! You are the greatest!!", 
            "He is nice to learn fom.", 
            "Wonderful course of Machine Learning!", 
            "Prof. Ng is very polite but he rushes explanations and his notes don't distinguish scalars/vectors/matrices. He overloads the meaning of various notational terms. Homework is very hard (most TAs don't understand it) and requires you to know magic never taught in class. Great subject but absolutely ridiculous course.", 
            "Professional Ng is an amazing lecturer, absolutely top notch. His notes are extremely detailed and refined. But going to his class is still a plus, he's clear, to the point and extremely good with giving examples for anything that might be fuzzy in the notes. The class is not easy however - at least for me, the homework really requires a lot work.", 
            "Best ever teacher", 
            "Absolutely amazing! Genuinely interested in the subject, explains concepts with clarity, uses excellent examples and focuses on what's important. Usually you'd need to meet a professor in person to iron out problems and understanding. He managed to teach via lecture videos and STILL got through to most people. Absolutely amazing!", 
            "A great teacher who always explains hard-to-understand concept in a easy way. The programming exercises really helps me gain deeper understanding about ML. The course is hard, but Prof really really did a good job!", 
            "Very well-organized class on a hard topic. Great lecture notes. Freedom to work on a cutting-edge project.", 
            "I have only watched videos of his course", 
            "This guy's a legend!", 
            "No Comments", 
            "His lecture notes are very clear, but he's a terrible lecturer in person. He mumbles and writes equations on the board without differentiating useful ones from algebraic derivations. I'm very serious when I say that he draws arrows labeled \"magic\" when he gets tired of explaining things.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Beware of pop quizzes ": "1", 
            "Lots of homework ": "1", 
            "Caring ": "2", 
            "Inspirational ": "2", 
            "Amazing lectures ": "1"
        }
    }, 
    "813422": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=813422&showMyProfs=true", 
        "score": "2.7", 
        "name": "Lester Lawrence Lessig", 
        "comments": [
            "Lawrence Lessing or should I say best teacher ever? \"The Law\" is his self-proclaimed nickname. You learn so much in class. He assigns like 200 pages of reading a night, but Law is the most interesting subject ever, so it's fine!", 
            "Not the most personable guy, but very smart, and he really teaches you about how the Supremes go about assessing cases (based on his knowledge as a former clerk an a very close observer of the caselaw).", 
            "I disagree with the others; I think they should consider the whole package, and walk a mile in his shoes. His contributions to law, policy and society are unparalleled. He cares deeply about his students. He cares deeply about the subjects. His lack of slickness (ala Grundfest) or pomposity (ala Brest) are attributes, not limitations.", 
            "Terrible. The worst professor I've had in law school. Brilliant, but arrogant and should not be teaching large classes. Unhelpful, won't meet with students, and cares only about teaching HIS theory.", 
            "Felt like he read the material the night before, and was blessing us with his insights.", 
            "rude and obnoxious to students-- even in class. He's entirely self-absorbed. still, his lectures are interesting even if he's scary."
        ], 
        "tags": {
            "Inspirational ": "1"
        }
    }, 
    "1037619": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1037619&showMyProfs=true", 
        "score": "4.9", 
        "name": "Tim Roughgarden", 
        "comments": [
            "The intuition he builds provides a solid foundation to grasp the mathematically rigorous proof of concepts with ease. He provides great insight into why things are the way they are and kindles huge interest in the subject. Often leaves logical holes in his explanations for you to fill in, which are just within your reach thus will engage you well.", 
            "Amazing professor! He teaches the course content with high clarity and is well organized.", 
            "The second half of the course is way tougher: heck, that was what I petitioned for and what I got: :-) Some people said that was brains against the wall. Very good course though. The professor is inspirational. The homework is EXTREMELY well thought through, and I am a 30 year veteran. There was absolutely no hands holding, a SUPER plus for me.", 
            "I took both Algorithm courses on Coursera last year. I think Prof. Roughgarden is one of the best teachers I've ever had. He explained clearly and in detail quite difficult topics. And he's tons of fun too! I'm going to take both courses again next year. It's the kind of experience worth repeating!", 
            "Awesome free course on youtube.", 
            "This guy is awesome for putting his course videos up on YouTube for free, extremely informative, one of the best professor's I've ever encountered.", 
            "Professor Roughgarden is one of the best, if not the best professor I have ever had. He covers a lot of complex material quickly but he makes it feasible through his clear, concise, and well motivated arguments. His sense of humor and obvious passion for the subject make learning all the easier.", 
            "Great professor, one of the best", 
            "He's amazing! I wish we had someone nearly as good as him at my college. Learned more from watching his videos than I did by going to class here.", 
            "One of the most clear, engaging, interesting teachers I've ever had. I've learned a ton and have enjoyed it.", 
            "Amazing professor. Love his lectures. Also, I'm totally attracted to him. He's just so personable and eloquent. He makes the online course very engaging.", 
            "One of best profesors i've ever had !", 
            "wonderful teacher", 
            "He taught me on coursera. He teaches nice", 
            "Awesome!", 
            "awesome"
        ], 
        "tags": {
            "Respected ": "3", 
            "Gives good feedback ": "1", 
            "Tough grader ": "2", 
            "Lots of homework ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Inspirational ": "3", 
            "Amazing lectures ": "2"
        }
    }, 
    "433670": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=433670&showMyProfs=true", 
        "score": "5.0", 
        "name": "Jody Maxmin", 
        "comments": [
            "Even though I was an Econ major, Jody's Archaic Greek Art class was by far my FAVORITE of all classes I took at Stanford. She is the real deal - amazing, caring, enthusiastic, as genuine as they get! Her students come from all disciplines but all can unequivocally attest to her above amazing qualities. She's a wonderful human being!", 
            "Jody does an incredible job of relating seemingly distant events to the lives of people in the world today. Her lectures on Greek Archaic Art are permeated with modern references which bridge the gap of millenia and help her students to connect with the past.", 
            "Great professor! You'll be glad to take her class", 
            "Most. Amazing. Teacher. Ever.", 
            "Jody Maxmin is the single best teacher I have EVER had. Whether or not you like Art History, take her class! You will doubtlessly walk away a better person for having done so. Jody's enthusiasm and passion for her subject is contagious, and she really cares for her students. She is absolutely amazing, end of story.", 
            "Jody Maxmin is the best teacher ever.", 
            "jody maxmin is fabulous. she takes a great deal of interest in her classes, and her main goal is instructing undergraduates. she can inspire you like no other professor i had at stanford.", 
            "Most amazing professor I ever had, she is passionate and cares a lot about the students...she also brings in vitamins to class for the students!"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Amazing lectures ": "2", 
            "Caring ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "578110": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=578110&showMyProfs=true", 
        "score": "3.6", 
        "name": "Marc Lucianovic", 
        "comments": [
            "Assigned reading and homework on Subject X, THEN a lecture on Subject X. Not effective at all.", 
            "Gives off a cool, relaxed sort of Paul Rudd-ish vibe.", 
            "Best Math teacher I have ever had, and one of the best professors I have had at Stanford. He explains things in a way that makes it easy to understand.", 
            "Mark is hilarious. He has some hilarious comments during lectures. I attend mostly for his jokes. Very clear and great teacher overall.", 
            "Funny, interesting, generally awesome! He was really good at explaining stuff, even integrals. 52 didn't seem quite as hard as I thought it was going to. Take him if you can!", 
            "Amazing prof, can explain complex topics like they're obvious and logical, the textbook just confused me but he was incredible. Great guy.", 
            "super easy, super hot and super helpful. I love Marc. He's so easy going and clear. If you are not techie enough to start with 51 right away, you want to take math 40 series with him for sure.", 
            "Confusing and goes off topic too much", 
            "Awesome, funny. Made a lot of jokes, which made the class fun.", 
            "No Comments", 
            "No Comments", 
            "I've already had some calculus classes in the past, and if you have past experience, then these courses will be very easy. He goes through everything in lecture; if you don't understand, go to lecture! But if you do, then it's just coasting."
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Tough grader ": "1", 
            "Graded by few things ": "1"
        }
    }, 
    "131758": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=131758&showMyProfs=true", 
        "score": "4.6", 
        "name": "Susan Olzak", 
        "comments": [
            "amazingly current social movement information", 
            "Amazing and engaged teacher. I loved this class. I took her grad level course in the 1990s. Still remember it.", 
            "very exciting lectures", 
            "Very engaging", 
            "No Comments", 
            "Prof is hot! She must buy her outfits in Paris! Font of knowledge.", 
            "Brings research alive", 
            "No Comments", 
            "No Comments", 
            "If you go to the first lecture and read the books you're in the clear."
        ], 
        "tags": {}
    }, 
    "262517": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=262517&showMyProfs=true", 
        "score": "3.0", 
        "name": "William Leben", 
        "comments": [
            "I really enjoyed Professor Leben's classes -- so much so that I asked him to be my advisor after I was inspired by him to major in linguistics. Yes, he is hard of hearing, but when you realize how patient he is with his students, you learn also to be patient with him.", 
            "I took this class in the early 90s and his hearing was already shot - I cannot believe that he could still be teaching! A really nice guy, but he's gotta let it go.", 
            "No Comments", 
            "I was going to declare in Linguistics until I took Leben's phonology course -- it was horrible! He was unclear, unhelpful, and, ironically, hard of hearing. In a LINGUISTICS class. That, and he talks like the Mad Hatter in Disney's \"Alice in Wonderland\". His class was a terrible experience.", 
            "An emeritus professor who should officially retire from teaching."
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Gives good feedback ": "1", 
            "Caring ": "1"
        }
    }, 
    "959399": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=959399&showMyProfs=true", 
        "score": "4.1", 
        "name": "Justin Eichenlaub", 
        "comments": [
            "My favorite professor this semester! He's clearly passionate about the material, and had a great time conveying it to us. For once, I found class discussions to be both interesting and helpful, instead of boring and/or useless. Very fun and personable - I had a great time in his class, and learned a lot!", 
            "Wonderful course. Fantastic discussion leader, really listens to students and takes time to explain challenging ideas. I would definitely recommend his class!", 
            "Phenomenal course. Justin has a wonderful lecture style and a knack for conveying sometimes difficult material in a fluid, understandable way.", 
            "Justin is a good teacher but prefers to discuss rather than really lecture... made it a bit difficult to take notes. There were just two exams and one really needs to read and remember the key points of all the assigned readings to do well on these exams. There was also one 5-page paper of your choice due which was pretty simple.", 
            "Really nice and clearly understands what he teaches. Tends to respond to students with an \"ok cool\" rather than providing feedback and facilitating discussion..which was annoying. Readings could be long but they were always interesting and overall I enjoyed the class. He just needs more experience, he looks like my older brother, not a professor.", 
            "This was an AWESOME class. He's a great teacher. So smart and takes an interest in the students. You want to work hard for him because he makes the class super interesting. Do the readings. Hes very helpful and a fair grader. Highly suggest this class!", 
            "Worst Teacher Ever", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "138777": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=138777&showMyProfs=true", 
        "score": "2.1", 
        "name": "Jeff Ullman", 
        "comments": [
            "Jeff Ullman is a fantastic human being, and he is an expert in his field. He literally invented some of the algorithms that he teaches in his class (he wrote the textbook, too), and he peppers his lectures with interesting \"war stories.\" He is also a great research mentor and is 10x better than my real PhD advisor.", 
            "He does not make eye contact and reads from the note. It's just so boring.", 
            "READS OUT NOTES. Fairly useless to listen to his lectures.", 
            "Very difficult to deal with. At times incomprehensible. Not useful to students. Preoccupied w/ other (non-academic) matters and issues.", 
            "bad. very bad. terrible slides/notes ugghh", 
            "just a comment", 
            "He's clearly a leader in his field with broad knowledge applied to specific applications.", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1"
        }
    }, 
    "627763": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=627763&showMyProfs=true", 
        "score": "3.0", 
        "name": "Teresa Lafromboise", 
        "comments": [
            "Cute", 
            "Smokin hot", 
            "Dr. Lafromboise barely taught this class - every session there was a student presentation. I thought the readings were disconnected, boring, and not helpful. There was barely an overall class structure or any strong themes or messages. I would not take this class if I could go back and do it again.", 
            "I found much of this class a waste of my time. We are asked to read about a dozen different theories of adolescent development and force fit them to a case study student. Prof Lafromboise did a poor job of linking the various theories together and a terrible job of explaining how the material might be useful to us as future teachers.", 
            "Great role model"
        ], 
        "tags": {}
    }, 
    "203930": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=203930&showMyProfs=true", 
        "score": "4.5", 
        "name": "Eric Roberts", 
        "comments": [
            "It was such an honor to take a course with Professor Roberts, he helped me see how cool the concepts like recursion are. His books are terrific too!", 
            "This Professor embodies computer science as we know it today.", 
            "So excited to be taking a class with him, his books are so good and he represents the best in the history of computer science", 
            "Genius teacher", 
            "Roberts is the master! Great ability to explain ALL important computer science concepts you need to know! Be sure to talk to him after class --there's always more to the lectures.", 
            "rarely does a reputation live up to expectations, but Professor Roberts is truly amazing. I hope he doesn't completely retire, he's one of a kind professor who knows both arts and sciences. His books are amazing too", 
            "Legendary", 
            "Reason why I understood recursion and algorithm!!", 
            "Eric Roberts is a great teacher, and his textbooks are top notch.", 
            "Smart guy! Very passionate about teaching and you can really sense he actually likes teaching undergrads. Programming assignments are fun - they can get rather time consuming towards the end of the quarter.", 
            "Eric Roberts really did a good job in this class. He managed to make the class fun and interactive and I enjoyed his lectures. He tought me the IHUM Technological Visions of Utopia.", 
            "Loved this class! Very dedicated to teaching, willing to help students. Also took 201 - Computers, Ethics, and Social Responsibility from him, loved that as well.", 
            "Extremely nice man - interesting lecturer with a warm personality.", 
            "I took his \"visions of utopia\" introsem and it was tons of fun. there was a lot of reading, but eric is really cool and always structured class well. not to mention, he invited us over to his house to watch the movie of 1984 and eat a full home-cooked dinner. it was greatly appreciated, especially as a rest from dining hall food. he's just a really cool guy.", 
            "Great professor, committed guy. The reason I'm a CS major.", 
            "Eric Roberts is an amazing professor!", 
            "terrible course once you get past a certain point; for me it was like hitting a conceptual wall, and he just couldn't explain it anymore. he's a really nice guy tho.", 
            "His lectures are very clear and helpful. Class wasn't a transformative experience or anything, but was reasonably fun and interesting.", 
            "He lectures well, but when you ask him for help, he talks in metaphors and high-level language. I JUST WANT TO KNOW HOW TO DO MY ASSIGNMENT", 
            "What a crazy beard"
        ], 
        "tags": {
            "Respected ": "5", 
            "Amazing lectures ": "4", 
            "Caring ": "2", 
            "Inspirational ": "6"
        }
    }, 
    "213145": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=213145&showMyProfs=true", 
        "score": "4.0", 
        "name": "Robert Huw Morgan", 
        "comments": [
            "The most inspirational faculty I encountered in my 4 years at Stanford. Changed the course of my life toward music.", 
            "Robert is fabulous, makes choir so much fun!", 
            "University Singers is tons of fun.", 
            "Robert makes u. singers a lot of fun!", 
            "Robert is so much fun!", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "94610": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=94610&showMyProfs=true", 
        "score": "3.6", 
        "name": "Pierre Khuri-Yakub", 
        "comments": [
            "Amazing", 
            "Khuri-Yakub, \"Kirchoff is never wrong\" THE MAN", 
            "I took his class last year and I just had to respond. If you thought it was hard, you probably didn't put in any of your own work. This guy \"is\" the man, he's always available at office hours and he knows his stuff. If you thought he was a bad prof, I'm willing to bet you didn't put in any time or effort on your own. Good luck in the future.", 
            "KY is the man!!! no doubt about that. His teaching style is great, but get to know him outside of lectures and that's when you'll realize he's simply THE MAN.", 
            "Not an easy class or material to learn but he knows his stuff.", 
            "Terrible prof.", 
            "One can't help but fall asleep in his lectures. The worst lecturer I have ever seen.", 
            "One of the best lecturers at Stanford", 
            "No Comments", 
            "One of the worst lecturers at Stanford."
        ], 
        "tags": {}
    }, 
    "2103274": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2103274&showMyProfs=true", 
        "score": "5.0", 
        "name": "Dominik L Michels", 
        "comments": [
            "awesome ... learned a lot!", 
            "A lot of work, but perfect internship. :))", 
            "Inspirational professor!", 
            "Great professor, challenging class.", 
            "Great class!!", 
            "Very well-organized class on hard topics. Great lecture notes! Freedom to work on a final project. Fair grading.", 
            "Amazing Professor. Very clear and consistent. Lectures are extremely interesting."
        ], 
        "tags": {
            "Respected ": "4", 
            "Gives good feedback ": "1", 
            "Group projects ": "2", 
            "Caring ": "1", 
            "Inspirational ": "3", 
            "Amazing lectures ": "3"
        }
    }, 
    "463175": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=463175&showMyProfs=true", 
        "score": "3.3", 
        "name": "Bruce Lusignan", 
        "comments": [
            "I attended Bruce's Systems Engineering Classes in 1968 ansd 1969 and it was the best course I ever did ever (graduate of Cambridge in agriculture, post grad economics, project evaluation and stats). His approach is what I have used during the whole of my professional life as a consultant working for leading agencies... and still going strong.", 
            "Bruce is a flaming liberal. Be prepared to get a low grade if you try to make a conservative argument. This class is known as an easy A for jocks, but I got a B since I tried to propose social security reform. Unbelievable.", 
            "One of the best professors I had during 4 years at Stanford!", 
            "I would advise against taking any classes with Bruce. He has only the most limited understanding of course concepts, and when someone points out that he's done something wrong, he often says that students are \"too stupid\" to understand the material.", 
            "Best professor I ever had!", 
            "I disagree, Bruce Lusignan is willing to go to considerable lengths to help his students, truly a caring professor amidst self-absorbed colleagues who could care less about a student.", 
            "the WORST ****ING TEACHER EVER. WORST CLASS, WORST PERSON. NOT PROFESSIONAL AT ANYTHING, DOES NOT KNOW ENGINEERING FROM THE HOLE IN HIS ASS. AVOID AT ALL COSTS, AT ALL COSTS!"
        ], 
        "tags": {}
    }, 
    "2350272": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2350272&showMyProfs=true", 
        "score": "4.9", 
        "name": "Steven O. Roberts", 
        "comments": [
            "Dr. Steven Roberts' lectures were phenomenal. Not only were they very entertaining (by far the most enjoyable lectures I've had), but they also beautifully connected the material to the real world. He was also incredibly flexible when it came to meeting outside of class, and he stayed after every single lecture to answer questions. Take his class.", 
            "A wonderful teacher, definitely the best professor and class Ive had so far at Stanford. Really cares about all his students and wants them to take something significant / meaningful away from his class.", 
            "Steven is an exceptional mentor, professor, and individual. The amount of dedication and effort he puts into setting up a inclusive and engaging environment for his students is astounding. Definitely recommend taking a class with him or even just getting to know him :)", 
            "Professor Roberts is quite possible the best teacher I could have in my first quarter at Stanford. Going into the class, I was worried I would be overwhelmed by the serious topic of racism. His lectures and the discussions he leads get the whole class engaged and creates an atmosphere in which everyone can share their opinions and learn. Amazing!!!", 
            "Genuinely a great guy. Bless up.", 
            "This course is a must take! It will change your perspective on race, racism, and yourself. The class is discussion based and participation is mandatory! The more that you put in to discussion, the more you will get out of it. Sections are always interesting and the work load is very manageable. Highly recommend taking a class with this professor!!", 
            "Steven Roberts is an AMAZING professor and really dedicates his time into making this class the most informative experience that it can be. This class truly opens your eyes to the intricacies of building racism in America and definitely recommend it to all people. Amazing class and don't miss out on a chance to take from him!", 
            "Professor Roberts makes an incredibly important and difficult subject approachable and powerful. Take this class if you care at all about your role in a racial hierarchy no matter your skin tone. These are the most important lessons you can learn in college and beyond.", 
            "Great introductory race class from a professor who clearly cares about the subject matter. Definitely recommend.", 
            "Steven is an absolutely amazing professor. Every day he pushed me to reconsider what I thought I knew about race and racism, and upon finishing his class, I feel more prepared to take on the world around me. I would recommend him and his class to anyone. Thank you, Steven!!!", 
            "Amazing class, amazing environment.", 
            "Amazing course! I learned so much, and Steven is an incredible professor who genuinely cares about his students learning. The class itself is a space that welcomes vulnerability and genuine discussion about highly relevant issues regarding race, racial identity, and discrimination. I'd take this course again if I could.", 
            "Professor Roberts really makes this course what it is. The passion and level of organization put into this class deserves way more recognition. It's a great class that expanded my intellectual curiosity. Switched my PWR to take it. Don't regret it one bit.", 
            "Amazing guy! Super invested in his students and what they take away from the class. Have a blast!", 
            "Steven is so far the best professor I've had at Stanford. He truly cares about the class and the well-being of his students. You'll learn so many life lessons in HTMAR, plus make great friends! He gives great feedback, challenges your beliefs, and is always willing to help. 100% recommend taking this class and any other class that he teaches.", 
            "Professor Roberts is the best professor I have ever had. I learned more than I ever could have imagined, both about myself, and my peers. He's an extremely caring and compassionate person, who was always there for me when I needed a bit of extra help. He is truly one of the best people I have ever met, as well as the best professor.", 
            "This is my favorite class all-time. I learn so much and the professor was really good at making an open class environment where we could share and learn from each other. The class was so relevant to life today, and I learned so much about the world that I live in. If you have a chance, don't pass up taking this class!", 
            "Really great professor.", 
            "Wonderful professor who makes his classes relevant and engaging to the world we live in today, brings a great energy to the classroom and truly wants to hear students' perspectives on the topic rather than just lecturing at you", 
            "Very personable, understanding, open, and engaging"
        ], 
        "tags": {
            "Respected ": "9", 
            "Gives good feedback ": "11", 
            "Accessible outside class ": "8", 
            "Skip class? You won't pass. ": "2", 
            "Amazing lectures ": "7", 
            "Hilarious ": "9", 
            "Participation matters ": "12", 
            "Clear grading criteria ": "4", 
            "Inspirational ": "20", 
            "Caring ": "25"
        }
    }, 
    "468770": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=468770&showMyProfs=true", 
        "score": "3.2", 
        "name": "Steve Block", 
        "comments": [
            "Um, no.", 
            "Prof Block is brilliant and very clear, but lacks empathy and a moral core. He seems driven to act in a way that is best described as evil. Stay out of this man's orbit.", 
            "I'm not fond of this rating system; although Block wasn't necessarily \"crystal clear\" or \"extremely helpful,\" he was still awesome! He was so enthusiastic about the subject and thrilled with teaching it to us! I don't know how he would be with more dry material (we studied Mythbusters and the scientific process), but he was great for this class.", 
            "awesome!", 
            "a nice guy, expects alot, just make sure you've thought about your question seriously before you go asking for help.", 
            "Evil. Very harsh and demoralizing."
        ], 
        "tags": {}
    }, 
    "134687": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=134687&showMyProfs=true", 
        "score": "4.0", 
        "name": "Dan Boneh", 
        "comments": [
            "Dan Boneh is one of teachers with the highest \"information per hour\" ratio I ever saw. To the ones who likes information and not side topics, a straight to the knowledge professor, he's the guy you are looking for. I took three courses with him and I'm glad to have the opportunity to find professors like him.", 
            "Fun class", 
            "Loved the class.", 
            "Dan is amazingly smart and very good at conveying information in class. I learned a lot in the the class. The class takes a lot of time but it is well spent.", 
            "Brilliant. Tons of information. Very clear. Not an easy class.", 
            "Great passionate teacher. Really got me interested in cryptography", 
            "Good Teacher", 
            "If you really want to pass , better read more about cryptography and prepare for hard tests and assignment. His lectures are amazing and clear. I understand cryptography more now.", 
            "Boneh is not inspirational. Saying \"clearly\" and \"obviously\", while providing math proofs, is not teaching. I can get that from a book. His Coursera Cryptography 1 video lectures are very efficient but intense. 50% of homework is not covered in lectures. He takes the fun out of learning & tarnishes Stanford's image. You will not enjoy his course.", 
            "He's an incredible professor. It's truly a privilege to sit in his lectures.", 
            "Boneh may be good in his field but he is horrible at teaching.", 
            "Mr. Dan clearly knows what he is talking about, but I don't. I got the hang of his lectures but the first homework questions came out of left field; it feels like I didn't even listen to the lectures. He frequently claims that this of that material is clear, or obvious or often says this or that is not necessary to explain when it SO is necessary", 
            "Dan Boneh is the man. That is all.", 
            "A brilliant guy, but not the best teacher, and not really interested in teaching.", 
            "boneh is the freakin man. that class was hard but he is such a genius and funny", 
            "No Comments", 
            "Excellent lecturer, but homeworks are HARD"
        ], 
        "tags": {
            "Respected ": "2", 
            "Tough grader ": "5", 
            "Lots of homework ": "2", 
            "Skip class? You won't pass. ": "1", 
            "Group projects ": "1", 
            "Participation matters ": "1", 
            "Amazing lectures ": "5", 
            "Get ready to read ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "264149": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=264149&showMyProfs=true", 
        "score": "2.8", 
        "name": "Scott Sagan", 
        "comments": [
            "Professor Sagan is very intelligent, and his passion for non-proliferation is inspiring. However his arrogance pushes students away. 3 other reviewers have mentioned his \"arrogance\" and \"hubris\". I sadly cannot agree more. Very intelligent. But little respect for students who are just getting interested in his subject.", 
            "Prof. Sagan is knowlegeable but suffers from scholastic hubris. Like many others I am sure that he would like to be the next Kissinger or Condi.", 
            "Brilliant lecturer, very clear, well-structured presentations, good insight. He expects analytic rigor from his students. It is unsurprising that some people bear a grudge when they don't get to coast through the class. The ratings don't really reflect how good an instructor he is. Better to trust the high enrollment for non-required classes.", 
            "Professor Sagan is quite knowledgeable and seriously committed to international security.However,he is like other policy wonk types who belong to the CFR--namely, full of hubris and set in his ideological ways.", 
            "No Comments", 
            "A serious professor with a low level of tolerance for student error. Kind of arrogant despite his knowledge of the material and certainly not too keen about Bush or the Republicans."
        ], 
        "tags": {}
    }, 
    "366784": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=366784&showMyProfs=true", 
        "score": "4.2", 
        "name": "Marcus Skinner", 
        "comments": [
            "In the depths of hell is where you'll find this man, drinking a vat of students' tears. He's unbelievably pompous, and, worse, he thinks because he's \"hot\" students should just love him and his boring lectures.", 
            "His novel totally captured what it's like to be a teenager.", 
            "Fantastic man. Too bad about the smell.", 
            "Mr. Skinner is an amazing instructor. His lessons extend beyond the classroom environment. Mr. Skinner fo' Life", 
            "Really great guy.", 
            "He is absolutely awesome. Pay him more money!", 
            "he is amazing. his book made me become a writer. thank you Mr. Skinner.", 
            "Great Professor! He changed my life.", 
            "Great teacher. Very well spoken. Knowledge of books is astounding. One of the greatest writers of our time. He has inspired millions to become writers, including myself.", 
            "Brilliant. Absolutely brilliant", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1", 
            "Tough grader ": "1", 
            "Group projects ": "1"
        }
    }, 
    "242820": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=242820&showMyProfs=true", 
        "score": "4.5", 
        "name": "Ewart Thomas", 
        "comments": [
            "Super unclear lecturer and even more unclear assignments.", 
            "I learn a lot in class.", 
            "Awesome", 
            "amazing professor! i highly recommend him to everyone. even if stats isn't your \"thing\", he makes it interesting AND relevant. rock on, ewart! :)", 
            "Awesome!", 
            "good winter quarter class. no final or midterm", 
            "Prof Thomas is one of the best professors I have had at Stanford. If you apply yourself *a little*, you will lean a *whole lot* from him. What I like most about his classes, both the undergrad and the grad, is that you learn how to practically apply the skills that you learn.", 
            "Don't buy the book. His handouts are awesome and quite legendary. He makes things simple and easy to understand. :) Definately take stats with this guy no matter what!", 
            "No Comments", 
            "Great Professor and Academic Advisor!!!!!", 
            "Prof. Ewart is very passionate about Stats. You will learn a lot from him.", 
            "If you need to take Stats, be sure and take it with Prof.Thomas. He explains concepts well, his exams are straight forward and follow his course notes, and he is very helpful during his office hours. Don't be afraid to get help from him if you're finding things confusing. He is a great teacher.", 
            "Thomas is a great lecturer, but Psych 10/Stats 60 is for Psych majors, so it should be an easy class for anyone."
        ], 
        "tags": {
            "Amazing lectures ": "1"
        }
    }, 
    "131769": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=131769&showMyProfs=true", 
        "score": "3.9", 
        "name": "Benoit Monin", 
        "comments": [
            "brightened my day !", 
            "Creative slides and follows the lecture outline", 
            "No Comments", 
            "GREAT GUY", 
            "Not very clear teaching.", 
            "really takes an interest in students", 
            "Great French accent - enthusiastic about material"
        ], 
        "tags": {}
    }, 
    "1038150": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1038150&showMyProfs=true", 
        "score": "4.3", 
        "name": "Brad Osgood", 
        "comments": [
            "A phony. What a phony from math department who sneaked in due playing politics. Lot of people say his lecture is good, but that probably means you have never taken a class on this topic before elsewhere. Everything in the class was undergraduate level. But he uses complicated notations, which make everything so much more difficult.", 
            "One of the best lectures I've ever had at Stanford. Not only did he explain concepts (and pitfalls) clearly, but the lecture notes were very well-written and organized. More importantly, his lectures and notes motivated me to learn by giving interesting applications to Fourier Transform. To top that off, he was a really humorous person.", 
            "Brad is really such a nice guy and always willing to explain concepts further. Go and visit him during office hours too, because he writes a lot and moves fast in lecture. Would recommend!", 
            "He's an outstanding teacher.", 
            "Very good big picture explanations. Great notes. Good sense of humor.", 
            "good prof", 
            "Great Lectures!!!", 
            "Excellent instructor with a great writing style. His notes bring great clarity to the subject of signal processing. Also has a good sense of humor.", 
            "really cool prof. clear teaching. intresting classes, but lots of homeworks."
        ], 
        "tags": {
            "Hilarious ": "2", 
            "Respected ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "580291": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=580291&showMyProfs=true", 
        "score": "3.4", 
        "name": "Dan Stack", 
        "comments": [
            "Excellent teacher!", 
            "I think..he puts forward his ideas quite clearly.And he tries to make the lectures more interesting . However,dunno whether it's his selection of timing of class , early in the morning like 9:00 ,listening to 2 hours of lecture is definitely not very enjoyable...That's the reason why I drop to 31X which is a relatively a more flexible class .", 
            "I had no desire to take 151, but it ended up being one of my favorite classes at stanford. Stack is a really great professor; he explains things very well. Problem sets and exams are hard; but he's fairly lenient on the final grades. If you've only had organic chem, then you should definitely take this class.", 
            "Chem 33 is hard, that's for sure. One thing though, Stack is cool. Lectures are fun and engaging and very easy to follow. I dont really like his teaching with slideshow but other than that, extremely helpful and friendly. One thing to note is that his exams are tricky, pay attention in class!", 
            "Dr. Stack knows there's something seriously wrong with the chemistry department, and as director of undergraduate studies, he does all he can to discourage students from majoring in chem. I wish I'd been turned off by his outright rudeness - I wish I hadn't majored in chemistry, since the teaching quality in the chem department is terrible.", 
            "The lectures are not bad - although I have certainly encountered better. The worse aspect of this class is that the book, lecture, problem sets and tests do not have anything to do with one another. The profs hate the book - and tell you that it's crap: talk about encouragement.", 
            "Very uptight about rules; Sort of annoying in class although very energetic. Tries to make the class engaging and interesting, but fails in my opinion.", 
            "An alright lecturer. Too bad the tests aren't about the lectures & that he's patronizing to students."
        ], 
        "tags": {}
    }, 
    "133712": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=133712&showMyProfs=true", 
        "score": "3.8", 
        "name": "Michael Klausner", 
        "comments": [
            "Amazing teacher -- rare one that doesn't just focus on black letter but gets to what actually happens in REAL LIFE.", 
            "Very laid-back. Knows what he is doing from real-world experience. The powerpoints are very good. You can skip class and just follow along on the ppt slides and get the gist of things (although probably not a great grade). Hot daughter.", 
            "Not recommend at all. Poor teaching skill, too laid back, does not prepare well for the class,", 
            "My favorite professor!", 
            "disorganized; not very compelling lectures.", 
            "Excellent teacher. I love the way he utilizes Powerpoint slides to enhance our learning experience. Not too bad looking either ; )."
        ], 
        "tags": {}
    }, 
    "2220138": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2220138&showMyProfs=true", 
        "score": "4.7", 
        "name": "Chris Gregg", 
        "comments": [
            "This is a pretty good teacher who lectures clearly and tries really hard to be nice. But he's defensive, assumes you already know all kinds of stuff to be in his class, then gets frustrated if what he said isn't totally obvious to you right away.", 
            "great!", 
            "106B is a great class and Chris Gregg filled in so many holes in my CS understanding. This is the key course to move forward, and this teacher totally gets it!", 
            "This teacher may come off as a bit conservative and rigid, but when you get used to his teaching style you see he's very consistent and wants you to be too. Super nice, really wants you to succeed and have a solid CS foundation.", 
            "He is a very good lecturer, but doesn't like to live code in class and sometimes can't understand if you can't understand.", 
            "Awesome prof! Super clear, helpful, and sooooo patient and caring with students.", 
            "Makes even the obscure and ugly math parts of CS interesting"
        ], 
        "tags": {
            "Respected ": "3", 
            "Gives good feedback ": "1", 
            "Test heavy ": "2", 
            "Lecture heavy ": "1", 
            "Accessible outside class ": "2", 
            "Clear grading criteria ": "2", 
            "Amazing lectures ": "4", 
            "Inspirational ": "2"
        }
    }, 
    "138156": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=138156&showMyProfs=true", 
        "score": "4.2", 
        "name": "James Sheehan", 
        "comments": [
            "He's incredible. He has this gift for making these pithy comments that get at the heart of things and really help you out. If you can take a seminar with him, DO IT.", 
            "Sheehan is nothing short of incredible - thoughtful, incisive, and attentive to student interests. Take his seminars if you can get in!", 
            "Imperious. Kaiser James. Occasionally deigns to speak to mortals, including gifted former high school students who somehow were permitted to pollute his beloved Stanford.", 
            "One of the most amazing lecturers I've ever heard. He's engaging and doesn't need to constantly refer to notes. Very few people ever fall asleep when he's talking.", 
            "This guy goes though an entire lecture as though it's a rehearsed speech - amazing."
        ], 
        "tags": {}
    }, 
    "618987": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=618987&showMyProfs=true", 
        "score": "4.3", 
        "name": "Vadim Khayms", 
        "comments": [
            "Hilarious guy with dry Russian wit, but also fair and caring. Decent lecturer with very good course readers (no note-taking!). Do your own reading in textbook and course reader or you won't be able to work the HW problems. The CME 104 text (Greenberg) is excellent and covers CME 100/102/104 material; buy it before CME 100 and thank me later.", 
            "one of the best profs I've had", 
            "He is a nice guy", 
            "Definitely in my top three for teachers at Stanford. Pretty hilarious and his accent makes everything a bit more fun. Very willing to explain and the textbooks he writes are much better than standard published ones. Very strong emphasis on actual use in industry, which makes his problem sets feel a lot more relevant. CME 104 was ridiculously hard", 
            "He likes to make jokes, and he often completely changes the problem when explaining it so students are forced to think outside the box.", 
            "Funny professor but difficult class. Be prepared to devote at least 8 hrs a week to one problem set", 
            "Funny. Humor is a bit on the dry side, but it's quirky good. Lectures are really really helpful. Really willing to stay after and answer your questions. Makes psets hard but tests easier. AMAZING at teaching a concept, really receptive towards you interrupting and answering questions. Definitely taking him for future classes.", 
            "Great class. The workload is very intense, but very rewarding in the end. The teacher is very nice and helpful. I look forward to having him as a professor for my upcoming math classes.", 
            "Great teacher. Hard class, but very good.", 
            "Awesome teacher. Looking forward to taking the next few classes he teaches in my math series.", 
            "Great lecturer, clear and well-paced. Funny without effort.", 
            "One of the best courses I have attended at Stan so far is CME 106 and the fact the Prof Vadim teaches it is the icing on the cake. He makes the class real fun to learn. And has the ability to explain the difficult stuff in simple terms. Overall a great Prof teaching a great course!", 
            "One of the best courses I have taken at Stan so far. And that too taught by Vadim is like an icing on the cake. He explains in such a way that even the most \"difficult\" topic is easy to understand", 
            "Too Hard! Good sense of humor but too much work...it dominates my life! However, a very good professor, his material is very real-world and he is very comprehensive in lectures.", 
            "Nice.", 
            "Very Good.", 
            "His classes are the hardest I've ever taken, but they really are the most rewarding. You will walk out of that class knowing all the material, and it will stay with you", 
            "Vadim gives a heavy workload, but his lectures are very comprehensive and he is always willing to help students get a better grasp of the materials. He definitely showed me the application of mathematics in engineering in the real world.", 
            "No Comments", 
            "Vadim is awesome! His class is really hard, but everything you do is useful and helps you learn, and he's very clear at explaning things, and quite funny in a deadpan way too!"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Tough grader ": "1", 
            "Hilarious ": "2", 
            "So many papers ": "1", 
            "Caring ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "605397": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=605397&showMyProfs=true", 
        "score": "2.6", 
        "name": "John Bender", 
        "comments": [
            "One of the kindest, most knowledgeable professors. Prof Bender is super well-read and really encourages attendance at his office hours. The workload was incredibly manageable (light, even), and he is open to adjusting the course in order to improve student experiences with it. Amazing!", 
            "He really knows his stuff. An excellent teacher, who works hard and expects you to work hard in return. I guess people don't like him much because he expects a degree of maturity.", 
            "wow, i think this is what they have in mind when they refer to the \"ivory tower.\" this man is a HUGE SNOB. i would rather break my arm than have him sneering at me for my intellectual inferiority ever again...if you like your self-esteem, then stay away...far away!!", 
            "this guy had weed in his desk when i whent to ask him somthing hes a****dont get this crappy teacher", 
            "can do.. do. cannot do.. teach. what kind of people teach \"english\" not till class was over did i realize all is a waste of time. \"humanities\" useless degree. useless classes.", 
            "I bet you no word in the history of english can describe all i have to say is \"a plague on both his houses.\"", 
            "snore", 
            "don't take anything with this man unless you like being sneered at and made to feel intellectually inferior to him. he is a total jerk and entirely unapproachable."
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Participation matters ": "1", 
            "Caring ": "1"
        }
    }, 
    "1307371": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1307371&showMyProfs=true", 
        "score": "4.9", 
        "name": "Kurt Carrasquilla", 
        "comments": [
            "Great teacher and amazing course!", 
            "Kurt is extremely knowledgable about investment, wealth management, and provided a very origranized approach, and platform, for developing effective wealth management strategies. He clearly enjoys teaching, and wants his students to do well. Hioghly recommend this short session summer class (SCS BUS 195)", 
            "Kurt's class gave a good overview of wealth management and gave me the high level tools to go do more. He was very accessible and gave good advice when asked.", 
            "Professor Kurt is always very care about every student and always gives good feed back for our questions right away. And he and the text are very professional and very helpful for our wealth management. Specially how to care taxes and how risk or safe we taking to choice. Thank you so much.", 
            "He is super knowledgable and caring. He has the best presentation skill I've ever seen. Great interaction, great examples, great class material.", 
            "Kurt was an excellent listener. This is often overlooked by professors as talented as himself. He listens to peoples questions and gives thoughtful responses. He uses clear language that is applicable to the audience and doesn't attempt to overwhelm them with his knowledge. Highly recommend the wealth management course taught by him.", 
            "Kurt is amazing! He explains the different concepts of personal wealth really comprehensively and gave real-life examples. Also, he's available after class, allowing opportunities for individual conversations and questions!", 
            "I will definitely take another course given by Kurt. His communication is very clear and understandable. He give the students chance to ask questions and does his best to explain it in a way that everyone understands. He gives us handouts to help us understand the course better and also he uses real life examples to put everything in perspective.", 
            "Overall, Professor Carrasquilla's Essentials of Wealth Management's class was inspirational, informational, and well organized. The one main thing that stood out in Professor Carrasquilla 's class is his caring and positive attitude in answering our questions. The handouts and emails were very helpful. Thank you for a wonderful class!", 
            "Professor Kurt gave us not only an overall yet detailed guided tour through wealth management but also some inspirations thats I have never thought of before concerning finance. It is definitely a great course. Students can ask questions in the class and will get clear answers right away.", 
            "I thoroughly enjoyed Kurt Carrasquilla's class ESSENTIALS OF WEALTH MANAGEMENT. I found his presentation of the more complex concepts to be amazingly simple. I'm certain that every member of our class gained a great deal from his expertise and teaching style!", 
            "Kurt was a great teacher, he has so much knowledge about wealth management. He explained the material very well and tied it to concrete examples. Great class he kept the lectures interesting and made it fun and easy to participate.", 
            "Same after the course, I have sure that I will use the topics that I had been learn at class, on my work in Brazil. Kurt demonstrated a big knowledge about wealth management, market in a macroeconomics context, I have no doubt that was one of the best teachers for me. As a conclusion, kurt helped me to achieve my goals at 2017.", 
            "Professor Kurt is one of those teachers you will come to realize truly cares about his students well-being. He was helpful throughout the entire 5 week course, and I highly recommend taking a class with him.", 
            "Kurt is a very friendly professor to discuss openly with!", 
            "Kurt is a clear teacher, helpful, and always ready to help. He really wants us to learn and is always being motivational.", 
            "Such a wonderful and rewarding class. I truly enjoyed his presentations and he made the concepts easier to understand. Highly recommend this professor and taking this excellent course!", 
            "I took Kurt's 5 week wealth management class in summer 2017 and loved it. Wealth management is obviously a broad topic, but he did a great job of distilling the information into 5 interesting lectures. He also helped me develop a sense of \"vision\" for my finances. I would recommend this class to anyone with low confidence managing their money.", 
            "After taking this class, there is a clear framework of wealth management tools in my mind. I strongly recommend this professor. In his class, I learn a lot!", 
            "Great course and great professor. Would like to take more of Kurt's courses in the future."
        ], 
        "tags": {
            "Respected ": "16", 
            "Gives good feedback ": "15", 
            "Lots of homework ": "1", 
            "Participation matters ": "1", 
            "Accessible outside class ": "11", 
            "Caring ": "18", 
            "Clear grading criteria ": "2", 
            "Hilarious ": "1", 
            "Amazing lectures ": "20", 
            "Inspirational ": "18"
        }
    }, 
    "183250": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=183250&showMyProfs=true", 
        "score": "4.1", 
        "name": "Julie Zelenski", 
        "comments": [
            "Rude and unhelpful. Tried approaching her outside class and was snubbed. There are better professors.", 
            "Julie Zelenski is a strong teacher. Knows what she's talking about", 
            "Julie is an awesome teacher. She knows the subject deeply and the TA's (particularly Michael Chang) are outstanding. Many other students are also very helpful. One of the best classes I've taken. Understand that unless you are gifted at computer programming you will need to work very hard on this course.", 
            "107 is a really hard class but Julie makes you understand all the work is so important if you want to be a programmer", 
            "Julie is a great professor, and the CS107 topics are very interesting (even if tough at times). If you're at all interested in what happens under the hood when you run a program (or if you just need to satisfy a requirement), take this class. Make sure to leave time for this class if you want to get the most out of it.", 
            "Incredible professor, really cares about how much students learn.", 
            "concepts are not taught in thorough way", 
            "Superb.", 
            "She can be a bit much with her fake enthusiasm and like the guy before me said is not very helpful if you have any questions. If you're expecting a Mehran Sahami, Jerry Cain, or Eric Roberts caliber teacher, you'll be disappointed. Oh well.", 
            "Not helpful", 
            "Awesome lecturer, fun lectures", 
            "Great teacher!", 
            "She was a great prof. and renewed my interest in Computer Science. Is a great speaker, and helps imensely in after hours.", 
            "She's actually on maternity leave now, but I think she'll be back. She was a very good, clear lecturer. Received a standing ovation at her last class.", 
            "Looking back (I took the class years ago) she's one of the best profs I had at Stanford. Given her work outside the University, it lends good perspective in the world of academia.", 
            "A stellar lecturer, always eager to help students learn the material - but the midterm had its way with me.", 
            "No Comments", 
            "Enthusiastic teacher and knowledgeble - tends to be a bit irritating at times. Interruped my final midway to tell the class to stretch!!", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Lots of homework ": "3", 
            "Respected ": "3", 
            "Gives good feedback ": "1", 
            "Tough grader ": "2", 
            "EXTRA CREDIT ": "1"
        }
    }, 
    "488874": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=488874&showMyProfs=true", 
        "score": "5.0", 
        "name": "Stan Christensen", 
        "comments": [
            "I took Stan's Negotiation class in 2016 and it was an amazing experience for me. Stan does a fantastic job of founding philosophical frameworks with pertinent anecdotal evidence in such a captivating speaking style, that you just can't help but be engaged! I also appreciated his challenges to speak up and voice opinions on class conversations.", 
            "Great professor teaching a fantastic and unique course - Stan is very personable and makes his content relatable to everyone in the class (which is incredible given the diversity of students) and really strives to makes sure we have personal takeaways.", 
            "Amazing class, I have been using what I learned in this A LOT in my professional life. Very entertaining as well, and got a chance to meet great students.", 
            "I took Stan's Negotiations class in 2015. Stan is well-known to be a phenomenal teacher; he gets 200+ applications for 50 spots, with students applying across all majors and degrees at Stanford. Of all the classes I took in my 4 years at Stanford, this is the class I most frequently think about and reference in my day-to-day.", 
            "I certainly fell in love with the art of negotiation. Stan has a persuasive teaching capability. When I took this class I only wanted to learn some negotiation skills, but after this class, I really want this to become one of the core skills. Thanks to Stan.", 
            "Stan is an amazing professor, very easy to talk to and always concerned about the the students. He taught 'real world' skills which I use everyday in my personal & professional life. I highly recommend any course taught by Stan esp. Negotiation (MS&E 285). I am sure people's life will change forever after learning from Stan.", 
            "This class is so worth it, across majors. You learn negotiating process skills that will help you with a lifetime of people-interactions.", 
            "This was the best class I took at Stanford. Stan is an amazing person. The things I learned in his class are not just academic, but are also valuable and practical for life in general.", 
            "Stan is a great professor! He is intelligent, funny, and totally easy!"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "2", 
            "Lots of homework ": "1", 
            "Hilarious ": "1", 
            "Participation matters ": "3", 
            "Inspirational ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "28392": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=28392&showMyProfs=true", 
        "score": "3.0", 
        "name": "Jack Rakove", 
        "comments": [
            "Impossible to understand during lecture", 
            "By far the meanest professor, I have ever had at this university. He was also unhelpful during office hours.", 
            "Best professor I ever had", 
            "Could care less about his students, and mean during office hours", 
            "This man is incoherent, mean-spirited, and does not care if his students learn anything. Any student thinking about taking his courses needs to consider other options", 
            "By far one of the worst professors I have had at Stanford. If you have any other options - and I do mean any - run!", 
            "Every other word that comes out of this mans mouth is an insult to a racial minority. The only thing worse than Rakoves in-class behavior, is the universitys unwillingness to do anything about it.", 
            "One of the two best professors I had at Stanford. Rakove is a great lecturer, and a very good writer. Take his classes.", 
            "\"you know, you know, you know, euh... well... you know, you know, you know, well, euh... \"", 
            "Dr. Rakove is really one of our best resources at Stanford University. Between him and Dr. Lawrence Friedman at the Law School, Stanford offers wonderful opportunities for studies in US legal history. This class was my first inn history, and also a major change of direction in my academic career - persuaded me to abandon chemistry.", 
            "Prof. Rakove is arrogant, self-aggrandizing, and indulgent. However, he is brilliant, and only subtly reminds you of his Pulitzer every now and again. He's a phenomenal resource on the Revolution and Constitutionalism. In class, don't just bend over and take it, put up a fight and you'll have a great time.", 
            "Excellent, conversational, engaging lecturer - makes the material really interesting. Clearly very passionate about what he does.", 
            "He was my advisor during his first year (1980). My only two C's came from him. The most articulate lecuture I've ever heard. Just the lectures are worth the prices of admission. Kind of caught of in grammar and kind of stuffy -- fits that \"east coast prep\" stereotype. But then again, that's the charm! Easily my favorite at Stanford.GoCubs RW R", 
            "Very sharp, fair, but \"his way or the highway\"...."
        ], 
        "tags": {}
    }, 
    "538811": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=538811&showMyProfs=true", 
        "score": "3.7", 
        "name": "Michael Boskin", 
        "comments": [
            "He knows what he's talking about...think Bush's economic policy advisor, but his Econ1B class is pretty boring. He's a nice guy, though, and loves talking to students.", 
            "Public Finance, this guy is awesome", 
            "Professor Boskin is very knowledgeable about public finance. He tells many interesting anecdotes about his work in government. He lecture style is very clear. He also invites every student to have lunch with him once the semester. One negative thing about his class is that it is quite easy and light on math....", 
            "Excellent class, interesting subject matter. Brought the subject to life with videos and examples.", 
            "I really liked Boskin... He was conservative, but it was a nice change. He knows his stuff, has interesting stories, and seemed excited about teaching.", 
            "Boskin doesn't so much teach Econ 1 as tell the class about his personal biases in economics. He is a very smart guy and he knows the field, but not great at telling the students about econ.", 
            "Boskin is one of the least compelling professors I have ever come across. He is exceptionally arrogant and it was clear that he wished he was somewhere else.", 
            "Nice guy, super conservative, overall a good class."
        ], 
        "tags": {}
    }, 
    "2406214": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2406214&showMyProfs=true", 
        "score": "4.0", 
        "name": "Jacob Vo", 
        "comments": [
            "Prof Vo does a great job at presenting the material and relating it back to the students. He puts effort into his lectures, which makes the class that much more enjoyable. Don't be afraid to ask him questions and the TA's are extremely helpful as an added support.", 
            "Professor Vo definitely knows his stuff. Would definitely recommend to do readings prior to every class.", 
            "One of my favorite professors of all time. Textbook needed to pass the class. The class is pretty straightforward and attendance is highly recommended to pass the course.", 
            "Great lecturer but I would not take him again. He lectures the whole time and moves fast with the slide decks, I could not follow to write down everything.", 
            "I'm usually not a good test taker but he makes his exams very clear to understand and straightforward. There was a study guide given two weeks before the final exam, which was definitely helpful. One thing to keep mind is that he gives a lot of short essay questions so make sure you are thorough on your study guide.", 
            "great professor", 
            "Would take him again if possible.", 
            "He's really good at helping you articulate your own ideas on paper, just make sure you do all the writing assignments, esp the weekly ones, these add up a lot and really affect your grade", 
            "He's cool. I would take his class again. Be prepared for lecture every class and you should good.", 
            "Get yourself an attractive professor who can really get down at an EDM concert. Definitely one of my favorite professors so far. Not only is he incredibly intelligent but he can also be very laid back and relatable to all this students.", 
            "Great professor! Very caring and accommodating.", 
            "Awesome professor and incredibly understanding.", 
            "Definitely one of my favorite professors so far. Truly knowledgeable and he's a cutie too.", 
            "Probably one of the youngest professors I've had so far. He has an awkward personality, which makes him really cute and personable. Highly recommend taking his class.", 
            "He's very young! Enjoyed his class for his personality and charm. Enjoyed learning more about Education through his teaching methods. He will crack a joke here and there to make sure the class stays engaged. Also, who wouldn't appreciate a good looking professor, right?", 
            "So genuine and kind, really enjoyed taking his class! Explains things very well and clearly. Is very accessible and approachable.", 
            "Most humanistic lecturer in Education-- very charismatic, animates the material very well.", 
            "Interesting course to take. Probably won't take it again since he mostly relies on his TA's to grade and answer discussion questions.", 
            "HE'S A TRUE GEM! He's hilarious and awkward at the same time but he knows his stuff. I would take his class again if I could. Definitely the highlight of all my classes at Stanford so far.", 
            "This is his first year teaching at Stanford and he did an amazing job. The stuff I learned in his class will help me advance in my major."
        ], 
        "tags": {
            "Respected ": "12", 
            "Gives good feedback ": "11", 
            "So many papers ": "3", 
            "Lots of homework ": "2", 
            "Skip class? You won't pass. ": "6", 
            "Lecture heavy ": "11", 
            "Group projects ": "1", 
            "Participation matters ": "5", 
            "Hilarious ": "9", 
            "Tough grader ": "2", 
            "Caring ": "6", 
            "Clear grading criteria ": "2", 
            "Inspirational ": "1", 
            "Get ready to read ": "11", 
            "Amazing lectures ": "6"
        }
    }, 
    "363648": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=363648&showMyProfs=true", 
        "score": "4.9", 
        "name": "John McCaskey", 
        "comments": [
            "Moral Foundations of Capitalism was a great class! Professor McCaskey is very passionate and engaging. But be warned: he will cold call on you and if he suspects that you haven't kept up on the reading he will send you an email entitled \"Are you keeping up?\" Very very worth it though.", 
            "Moral Foundations of Capitalism with Prof. McCaskey is a wonderful class. I ended up changing my views about many of the authors we read and learned a lot about both the supporters and detractors of capitalism. Definitely one of the most interesting classes at Stanford. I would recommend this to anyone regardless of political persuasion.", 
            "Professor McCaskey has lots of energy and enthusiasm for the class, which made me much more excited about the subject. He is incredibly helpful and always willing to work with students outside of class to make sure they understand the material. He also gave great essay feedback and helped us outside of class to improve our writing.", 
            "Phenomenal teacher. I learned more in this class than I have in any other class at Stanford. Really challenges students to think critically and to thoroughly understand concepts. Very approachable. Was determined to schedule time with students outside of class if he felt they weren't fully grasping the concepts.", 
            "Moral Foundations of Capitalism with Prof. McCaskey is an excellent class. Prof. McCaskey challenges every student to challenge and formulate her personal economic and political philosophy or at least understand and challenge those of the writers we read. He is readily available to help and is a great asset to his students academic careers.", 
            "I took the Moral Foundations of Capitalism with Professor McCaskey, and it was a great class. Professor McCaskey is all you could ask for and them some: smart, fun, helpful, and caring. I looked forward to going to his class because it was fun and I learned so much. He is also a fine writer; your writing will improve if you take his class.", 
            "Professor McCaskey is good at helping students think about the course concepts. He did this by relating the readings to each other, providing readings with different moral arguments, and giving us detailed feedback on completed papers and drafts. The class environment made it easy for students who weren't familiar with the material to participate.", 
            "Professor McCaskey is everything a college class needs. His course provides a variety of viewpoints on ideas that are important to students and demands nothing but the best thinking from all. Best professor at Stanford thus far.", 
            "Professor McCaskey opened my eyes to an entirely new world of that that I had not previously explored. He did of incredible job of helping grasp complex philosophical concepts and begin to formulate my owns opinions and judgments on the subject. He shared a genuine excitement for the material that was infectious and inspiring.", 
            "Professor McCaskey is an amazing professor. I took Moral Foundations of Capitalism, and it helped me formulate my own beliefs much more coherently. He handles discussions well, he brings a lot of passion to class, and his explanations are crystal clear. It was the best class I've taken so far, and I recommend that everyone try his classes.", 
            "Professor McCaskey is a talented educator. I looked forward everyday to attending his class and sharing the excitement he brings to learning. He did an incredible job of teaching a difficult subject and addressing the variety of student backgrounds and needs in the course. I highly recommend that everyone studies with McCaskey during college.", 
            "Professor McCaskey's enthusiasm for course material was contagious. The course was well designed with a clear progression and development of central themes. I took a lot away from the course and highly recommend Dr. McCaskey to other students. He's one of the best professors I've had at Stanford.", 
            "Professor McCaskey is everything higher education needs: a teacher who cares about his students, incorporates a wide variety of viewpoints, and thoughtfully prepares the course.", 
            "This class was great. McCaskey knows his subject, and his enthusiasm is infectious. Even students who had no prior interest in 19th century philosophy of science seemed engaged and excited. Overall, a great experience. Take a class from this guy.", 
            "Professor McCaskey is by far and away the best professor at Stanford university. I have never taken such an enjoyable and interesting class. He is thoroughly devoted to teaching and every section is an exciting opportunity to hear his brilliant insights and learn from excellently lead discussions with your peers. He is an incredible professor!", 
            "Prof. McCaskey is amazing. This class was one of the best classes I've ever taken, and most of that is due to his way of teaching and engaging students in meaningful and insightful discussions. Awesome!", 
            "the class was very enjoyable, largely due to Dr. McCaskey's charisma and an excellent reading list.", 
            "this man was enthusiastic and passionate about the course. the course covered 2500 years of the history of science and logic, and he was versed in every topic of discussion. he is as likable as he is intelligent. if you like the history of science and want to read Newton, Galileo, Aristotle, Heisenberg, Copernicus, and others, this is the course!!", 
            "He is a great teacher whose enthusiasm is contagious. This was the most enjoyable class I have taken at Stanford or anywhere else for that matter.", 
            "Prof McCaskey was awesome, especially with the small discussion class we had he was great at leading our talks and really emphasized student involvement. The class got really passionate, in large part because he relayed his own enthusiasm to us. I'd love to take another class with him, or just the same one again!"
        ], 
        "tags": {}
    }, 
    "803088": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=803088&showMyProfs=true", 
        "score": "2.8", 
        "name": "Dimitry Yandulov", 
        "comments": [
            "I took this class with him at SCC. You could tell he knew what he was talking and loved chemistry. But, he was so boring that I would run out the door when we started to go to the Lab after lecture. I've taken 3 chem teachers before him and he was the most confusing. I ended up teaching myself from the book.", 
            "In lab, this Dima is helpful in that he'll help you with setup and understand what is going on. However, in lecture, this guy is really boring to the point where most of the class falls asleep. In fact, I ended up studying in the library rather than attending lecture and my grade improved.", 
            "Excellent knowledge base. Lacks social skills. Whenever someone asks him a question, he ALWAYS answers back with a question. I'm like, \"why do I even ask in the first place?\" Not helpful. Boring. Too fast. For people who aren't fast learners don't take him.", 
            "He is a good person that lives for his work. He needs to enjoy life more. He is very caring under his serious look.", 
            "He is the most useful of all the Professors. He actually stays around during class and makes sure you do everything right. I would not want to work for him though because he is such a hard @$$. Everything needs to be done perfectly.", 
            "Dima is one of the best three professors in the chem dept. His social skills are lacking, and he has trouble retaining graduate students, but he does show serious concern about whether his undergrad students are learning. He came to lab for a couple hours every day, and personally instructed us on lab technique. A real asset to Stanford chem.", 
            "Dima was really good; He really cared about how students were doing.He stayed around lab usually to answer any questions we had; he was really helpful in teaching us technique and lab skills. Assignments were reasonable; they weren't too hard and didn't take too much time.People I know like him a lot; he was by far the best lab prof. we'v had.", 
            "this guy is a jerk."
        ], 
        "tags": {}
    }, 
    "247367": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=247367&showMyProfs=true", 
        "score": "4.6", 
        "name": "Nick Parlante", 
        "comments": [
            "He made CodingBat website. Its amazing how his efforts helped thousands of students taking computer science like the AP Computer Science to other college intro to CS (Java) courses. Also thanks to Stanford Professor Marty Stepp.", 
            "he's great", 
            "Really good at breaking down complex topics into its simple components.", 
            "Easy to pay attention to !", 
            "This class was awesome. A beginner like me that has never done anything further than facebook on a computer, Professor Nick was very clear and easy to listen to. I very much enjoyed the lectures and how easy it was to learn from such a great teacher. Thank you for all that you do", 
            "Nick Parlante is user-friednly!. He is a brilliant lecturer, funny, and easy to listen to. Has an incredible ability to present complex material in clear, concise, and engaging manner. My mind is blown!", 
            "Great professor! Explains rudimentary ideas slowly so that learning more complex ideas is easy. Such a joy to learn from.", 
            "Exceptional clarity and step-by-step teaching practice.", 
            "Great Instructor! Made the subject incredibly interesting and has a real passion for computers. I love his teaching style, its very adaptable and flexible enough to reach out to all types of learners. I highly recommend!", 
            "Makes the subject interesting. Energy comes through, even online. Nice to look at too.", 
            "He is awesome! He helped me cross the mental barrier I had towards Computer Science and has created an interest in me for Programming. He is great! He is the Best! Thank you Sir!", 
            "I knew nothing when I started taking his courses online. He made everything crystal clear and everything seemed easier. He is perfect at what he does. I thank him with all my heart.", 
            "Look at this guy on youtube, very thorough and energetic. Makes complex topics simple. One of the best teachers you will EVER have.", 
            "I'm an Asian from and living in a non English speaking country and he could make me understand the whole concept, how cool is that?!", 
            "Took programming as career just because of him", 
            "Best CS Professor Ever. PERFECT", 
            "Nick is awesome! I took this Stanford course through Coursera.org. His way of explaining computer science was crystal clear. I enjoyed every lecture and feel like I took a lot away from the course! Thanks Nick!", 
            "Excellent teacher! I never thought I will be able to understand Computer Science as it is. But now I do. Thank you Nick Parlante!", 
            "A great teacher that can explain the most difficult concepts in a very easy-to-understand way.", 
            "YOU ROCK!!! \\m/ :D"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "4", 
            "Inspirational ": "4", 
            "Caring ": "1", 
            "Amazing lectures ": "5"
        }
    }, 
    "440100": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=440100&showMyProfs=true", 
        "score": "1.6", 
        "name": "Peter Michelson", 
        "comments": [
            "ugh... dreaded going to class", 
            "nice", 
            "Hes horrible. Awful. Practice exams have no relation to actual exams. probably because he typically teaches the 40s series. Also extremely dull.", 
            "Extraordinarily boring, disorganized, disheveled professor who gives muddled lectures and difficult exams. His granddaddy was supposedly kinda a big deal, though.", 
            "Not the most interesting guy... class is hard to sit through.", 
            "None to good. Good for insomnia.", 
            "He was the worst teacher I have ever had.", 
            "A horrible teacher, just sits there and clicks through inscrutable powerpoint slides. Avoid him at all costs.", 
            "boring and unclear", 
            "Bad", 
            "Lectures are so boring and useless, no point in going to class.", 
            "lectures are totally useless, you essentially have to teach yourself everything", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Tough grader ": "1", 
            "Participation matters ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "2229376": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2229376&showMyProfs=true", 
        "score": "5.0", 
        "name": "Sam Hinkie", 
        "comments": [
            "Trust the process", 
            "Hinkie taught me how to process. Lots of Homework though, and ya gotta buy the book. Otherwise, great guy!!!!! Take him for Process101", 
            "Of all the years we could have been alive to see, we were all granted the privilege of witnessing Sam Hinkie heal the wounds of millions. Trust the Process.", 
            "Sam Hinkie is personally one of the most forward thinking men I have ever encountered in my life. He has the longest view in the room. Encountering him was a major turning point that led me to embrace the process.", 
            "Professor Hinkie taught me many important life values that I hold dear. He taught me that patience and trust are necessary to achieve any goal in life. He taught me how to maximize the value of any assets in my life. Most importantly, he taught me how to draft the NBA's next dynasty from the ground up. I will forever be grateful to Mr. Sam Hinkie", 
            "Professor Hinkie is an absolute legend, as his sacrifices have lifted Philadelphia basketball above .500 again and towards NBA dominance once again, through the assets he helped acquire like Joel Embiid and Ben Simmons. #TrustTheProcess... always.", 
            "Thank you Mr. Hinkie for everything you did for Philadelphia basketball... #TrustTheProcess", 
            "He is one of the most forward thinking and intelligent professors i have ever had. He was willing to die for the sins of those beneath him."
        ], 
        "tags": {
            "Respected ": "4", 
            "Tough grader ": "1", 
            "Caring ": "4", 
            "Participation matters ": "1", 
            "Inspirational ": "6", 
            "Amazing lectures ": "2"
        }
    }, 
    "67388": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=67388&showMyProfs=true", 
        "score": "1.9", 
        "name": "Herb Clark", 
        "comments": [
            "Went in to talk with him during office hours. Very frustrating, no attempt to actually engage in a real conversation, very arrogant. I would put this class in the bottom 10% of the classes I've had in my major.", 
            "bad teacher", 
            "Avoid this prof at all costs.", 
            "skip this prof, if at all possible", 
            "Could be an interesting subject, but the lectures are really boring. Not really a good teacher.", 
            "No Comments", 
            "lectures were sooo boring and his notes were incomprehensible; painful class"
        ], 
        "tags": {}
    }, 
    "424827": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=424827&showMyProfs=true", 
        "score": "3.9", 
        "name": "Sanjay Lall", 
        "comments": [
            "Professor Lall was amazing. definite take again", 
            "Finally understood Kalman filtering from this class", 
            "very clear, fun lectures", 
            "very useful material and clearly explained", 
            "very useful material clearly explained", 
            "great class, fun lectures", 
            "Excellent. I still keep his lecture notes for reference. What he teaches is not particularly simple, but he does a great job!", 
            "Hard to understand. Unnecessary stress on math while too little useful material covered. Can be fun if you love math, otherwise it is way too much pain for the material learnt.", 
            "very soft spoken and hard to hear in lecture. would be better if he taught at a more prestigious school like one of the uc's. but since he is teaching here, dont take him.", 
            "No Comments", 
            "Hmmm. Don't really like him as a prof. Nothing in particular. tests are usually 24hr take home. Difficult but doable. Gives a lot of homework solutions in problem sessions. Always easy to talk to.", 
            "Excellent course notes. Good lecture style. Generally friendly. E207A & B highly recommended."
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "796614": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=796614&showMyProfs=true", 
        "score": "1.4", 
        "name": "Fouad Tobagi", 
        "comments": [
            "He was not an inspiring professor.", 
            "Uninspiring teacher. When I dipped my toes back in to graduate school in the 90's, I was recommended to try his network class as the Internet was a hot topic Did try and attended his class; didn't touch another network class for 15 years.", 
            "Boring classes. Good at telling stories but not at teaching. A waste of time.", 
            "Very poor, uninspiring.", 
            "He was a person who didn´t care at all about his Teaching Assistants...", 
            "He's much more of a \"discovery\" method teacher. He will give you partial information and then homework assignments which force you to \"discover\" the answer. In other classes, teachers probably tell you this is why this method is better than that and then do the math proof for you. In this class you figure it out yourself."
        ], 
        "tags": {}
    }, 
    "776354": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=776354&showMyProfs=true", 
        "score": "4.8", 
        "name": "Wray Huestis", 
        "comments": [
            "Best teacher I've ever had in high school, college, graduate school, and medical school. She is simply awesome!", 
            "She was the very best professor I had in college. I fell in love with chemistry because of her and she has totally inspired my teaching style.", 
            "Fabulous course reader; lectures can get a bit dry and she can be hard to hear at times, but she does a great job teaching some pretty tough material.", 
            "She is extremely helpful. Her course reader is the most useful chemistry book ever. She is very matronly.", 
            "Very clear; provides notes that are very helpful. Tests were fair.", 
            "Basically an amazing prof. Actually made me like chemistry.", 
            "She's pretty clear about things and teaches with a straight-forward style. Boring at times though. Really boring at times...", 
            "Absolutely fabulous professor. Very helpful and provides wonderful notes!"
        ], 
        "tags": {}
    }, 
    "1895707": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1895707&showMyProfs=true", 
        "score": "4.7", 
        "name": "Marty Stepp", 
        "comments": [
            "He is awesome", 
            "- He gives very clear idea of the problem . - Explains hard problems in easy terms . - Explained recursion with interesting examples like printAllBinary, palindrome etc", 
            "Great professor who explains things clearly. I like his humor actually. His class is slow-paced but he made everything easy to understand. Sometimes make silly mistakes and waste some time, but you will definitely not blame him.", 
            "Good", 
            "Marty is a phenomenal instructor. I had him for both 106 courses, and he made CS accessible to everyone. He is great at what he does, and is one of the most dedicated professors/lecturers I've had at Stanford. His lectures are extremely clear and engaging, and Marty is just a funny, slightly awkward guy. Couldn't ask for a better instructor.", 
            "He made most of Practice It! Its amazing how his efforts helped thousands of students taking computer science like the AP Computer Science to other college intro to CS (Java) courses. Without PracticeIt I wouldn't have taken Computer Science. Also thanks to Stanford Professor Nick Parlante.", 
            "Marty is a great professor teaching a difficult subject", 
            "Honestly considering becoming a CS major. Marty explains the material really well and does so in a funny and engaging manner.", 
            "Very good lecturer. Knows how to assemble an informative presentation. Somewhat profane, but incredibly funny. 1010 would recommend.", 
            "Marty Stepp is an extremely engaging instructor. He is quite clear and makes the material very appealing.", 
            "Great lecturer really fun, not as awesome as Mehran but still great."
        ], 
        "tags": {
            "Respected ": "6", 
            "Tough grader ": "1", 
            "Lots of homework ": "2", 
            "Hilarious ": "7", 
            "Caring ": "3", 
            "Amazing lectures ": "6", 
            "Inspirational ": "4"
        }
    }, 
    "216855": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=216855&showMyProfs=true", 
        "score": "4.2", 
        "name": "Marcelo Clerici-Arias", 
        "comments": [
            "Marcelo has definitely been my favorite teacher while at Stanford - he is very engaging (even at 9 am) and is extremely clear. He explains concepts very well - after all I was a freshman with no experience in Economics and still did well in his class (and enjoyed it) even though there were plenty of people who had taken AP before this class!", 
            "Great class, must take. Amazing professor and the nicest guy", 
            "My biggest issues with him is he is not very clear and doesn't get to the point. Also his droning voice makes me want to leave. Felt more like him talking aimlessly w/ the class just sitting there and self-studying for tests.", 
            "Material was interesting, but his accent was annoying. Teaching style wasn't very clear, and he is pretty arrogant. Not a difficult class if you study. I would recommend a different professor.", 
            "He's the sweetest man in the world.", 
            "I love Marcelo. He was an awesome teacher.", 
            "Awesome prof.", 
            "Very good lecturer, especially for freshman. Easy to talk to and was very concerned about students learning material. Both prof. and class recommended.", 
            "Very good lecturer for the basic econ class I took. Some times took a lot of questions which made the class go slow.", 
            "He explains everything clearly and is really friendly", 
            "Very nice guy and pretty good lecturer.", 
            "He's a very nice and helpful man, but often is not as clear as I think he could be", 
            "No Comments", 
            "Incredible! Always willing to help you out. Oh, and he'll remember your name.", 
            "I took him back in 2000, he was cool cat taught iternational and money and banking well. I got a job trading on wall st. and his stuff actually helped. Brooklyn Stand up!", 
            "Awesome teaching!. Makes material really clear.", 
            "Mildly entertaining... loves PowerPoint. Does a good job of bringing current events to lecture, but the lectures themselves go by sooo slowly.", 
            "Great teachning!", 
            "He wasn't a very good teacher, although he is a nice person. His accent got on my nerves.", 
            "Completely loved his Econ 1 course. It was packed from beginning to end. Highly recommended!"
        ], 
        "tags": {
            "Lots of homework ": "1", 
            "Respected ": "1", 
            "EXTRA CREDIT ": "1", 
            "Caring ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "216856": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=216856&showMyProfs=true", 
        "score": "3.7", 
        "name": "Mark Tendall", 
        "comments": [
            "\"We know in our hearts\" This guy is a great lecturer; he's very clear. But, he's also quirky. One of the best lecturers I've had at Stanford, up there with Scott McKeon", 
            "ok lecturer.", 
            "Prof. Tendall teaches you the mathematical steps to solve very specific types of problems. Of course, no one actually learns what anything means, but at least you can get a good grade without understanding \"hard\" concepts!", 
            "Great professor.", 
            "Mark is a nice guy and is clearer than many professors, but his teaching style is terrible. Rather than helping students understand concepts, he focuses on simple computational rote learning. If you want a very straightforward class where you *don't really learn anything*, you will like this class.", 
            "good at explaining things and pretty funny", 
            "Wonderful Professor. A brilliant academic whose enthusiasm for economics is contagious. He is interesting, funny, and nice. He genuinely cares about his students and their success. I am happy to have taken a class from him.", 
            "Really clear and concise. Great, funny guy.", 
            "Solid professor, and a good guy too", 
            "Really funny and likes teaching. Exams and problem sets are straightforward.", 
            "very confusing. i understood this stats in 9th grade but can't remember any of it now.. his lectures are sleep-inducing and perplexing.", 
            "Horrible teacher.", 
            "Such a nice professor. He really cares about his students and wants them to learn. Psets and exams are generally straightforward. No surprises there.", 
            "super clear, very easy to do well if you just pay attention. no tricks on his tests.", 
            "very funny, lectures were good, exams fair, but problem sets were intense", 
            "Funny in lecture, very student-oriented. Always available outside of class for help. Fair exams.", 
            "Great professor. One of the best I've had so far.", 
            "Absolutely amazing. Turns some people off because of delivery but has very clear and helpful lectures. Also the nicest guy in the department.", 
            "Has weird speech delivery. Should be more direct.", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "738631": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=738631&showMyProfs=true", 
        "score": "3.7", 
        "name": "Lenny Susskind", 
        "comments": [
            "Leonard Susskind makes physics fun and simple. It is still hardest subject you will ever encounter, but Lenny makes it possible! Without doubt, best teacher in my life.", 
            "What a Neato Professor, i saw him on Nova the other day, he was explaining about these Multi Verse Theories,,, Can't wait to see one.... Celeste", 
            "If you don't like Susskind, you don't like objectivity being spread clearly. Everybody entitled to their opinions, nobody entitled to their facts.", 
            "The lectures and the problem sets were on completely different topics which was interesting, but did not help me learn the material at all. The textbook was good and had good examples which helped a lot. The midterm was fine but the final was perhaps too difficult. If you have an open book open notes test be prepared for a very long 3 hours.", 
            "Although the subject material itslef was difficult, the difficulty of the class wasn't helped by the fact that there was no syllabus, and office hours were frequently cancelled. Yes, he is very smart, and for those students who wish to go beyond the material he is very helpful. But to the rest of the class he is dissmissive and condecending.", 
            "He's an entertaining maverick; impressive, some would say.", 
            "Everyone agrees that the class is very hard. But I think it's the class, not the prof. I like Susskind a lot; I find his lectures very interesting and helpful. He approaches the material from unique and interesting perspectives (at least in 60 series) that are good for learning the reasons behind the way physics works.", 
            "this guy might as well be speaking chinese during lecture. the very few people who understand him, I suspect, have been exposed to the materials before.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "151978": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=151978&showMyProfs=true", 
        "score": "3.8", 
        "name": "Clifford Nass", 
        "comments": [
            "I quit my job to go to grad school and work with Cliff. His lectures were a little scattered, but chock full of interesting ideas and theories, well-sourced by the assigned reading. He taught me to tell a story with my research and papers. His quick wit, quick brain, and warm heart made for a great man.", 
            "Hilarious and very passionate! Super helpful too!", 
            "really funny, nice teacher; class was random and all over the place. not very useful or impressive...dum class, aight proff", 
            "Hilarious. SO passionate about Communication. He makes the class entertaining and concepts memorable.", 
            "Very energetic lecturing style, very interested in his students and his studies.", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "808495": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=808495&showMyProfs=true", 
        "score": "4.6", 
        "name": "Ran Abramizky", 
        "comments": [
            "Excellent professor. Makes a rather dry technical class entertaining", 
            "he was really a gd teacher, very helpful", 
            "You really cannot complain about Ran, who is so energetic and nice. Yes,he does have an accent, but there are much much worse cases in the econ department at Stanford. Ran paces himself reasonably that it is easy to follow. His lecture slides are very clear.", 
            "Really clear, and really cares about whether students are learning.", 
            "Extremely clear teaching style. Made concepts really easy to understand. Midterm and final were definitely easy but it was kind of nice not to come out feeling like you had failed.", 
            "He's really nice but this econ course in general was ambiguous and I didn't enjoy it. He's probably better than the other profs though. Another thing that bugged me--he would take all qns from students and try to remember everyone's names. It was a waste of lecture time, esp since students would ask stupid qns just to be noticed.", 
            "Excellent teacher; really clear. Final was too easy though, so the curve could hit you hard.", 
            "No Comments", 
            "Excellent. Clearly taught; watch for exams though; they are easy, so the curve is high.", 
            "Ran is a great professor. He really cares abour students and it shows. Also, he has a wonderful sly sense of humor. He says that his exams are fair, and it's true-- he only sticks to what was covered in lecture or homework. He'll also give advice on anything econ-related. Thumbs-up!"
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1"
        }
    }, 
    "1256446": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1256446&showMyProfs=true", 
        "score": "4.2", 
        "name": "Fu Kuo Chang", 
        "comments": [
            "Best professor I ever had at Stanford, in my honest opinion. Lots of creative ways of teaching which sparks intelligent minds to really think and engage.", 
            "Practical with hands on experience. An inspirational course which motivates independent thinking.", 
            "Practical with much hands on experience. An inspirational course which motivates independent thinking.", 
            "extremely knowledgable with highly conductive reasoning. Highly recommend for any engineering major.", 
            "not a bad class. helpful and reasonably efficient teaching. grades are easy.", 
            "lack of textbook makes it a little hard and he's sometimes difficult to follow, but he's willing to help and the grades are not hard to come by.", 
            "Disorganized and poorly prepared for lecture. Does not have a course textbook, instead makes you buy course readers, one of which is in illegible, incomprehensible longhand, the other which is inconsistent in notation, error-prone and impossible to follow due to huge gaps in logic and explanation. The worst course in my educational career."
        ], 
        "tags": {}
    }, 
    "13890": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=13890&showMyProfs=true", 
        "score": "4.5", 
        "name": "Jerry Cain", 
        "comments": [
            "Not much teaching, content is typed up more clearly than lectures, class is mostly autograded", 
            "good sir and teach from basic on programming", 
            "very good professor.", 
            "No doubts, one of the best. Very good combination of theory and practice.", 
            "I've taught this stuff for decades and Jerry explained it better, and way, way faster, than I ever have. Inspirational.", 
            "Great teacher, great lecturer super clear and helpful!", 
            "Jerry is the boss! Explains Computer Systems very clearly and really cares about his students.", 
            "Jerry always makes the class significantly harder. His lectures go very quickly, if you don't pay attention for 1 second, you're lost for the rest of the class. He's good at explaining, but I feel goes too quickly in lecture and doesn't stop enough to make sure students are getting it. Explanations could be less code heavy and more visual.", 
            "He is one of the best teachers out there.", 
            "One of the best teachers I have ever had. He explains everything very well, makes it fun, and is also super helpful. If you have him you are lucky!", 
            "Very nice one.", 
            "He is a genius", 
            "Tough, but fair. Great teacher, excellent explanations", 
            "Awesome SUPER Awesome", 
            "Good dedicated prof.Looks arrogant but is good.", 
            "good lecture; sometime too fast", 
            "Great lecturer, demanding and makes sure his students learn significantly more than with other teachers in the same course. His manner seems a bit arrogant and unapproachable, but is actually helpful when asked. His classes are a CS boot-camp, do expect quite a bit of work.", 
            "Great and intelligent.", 
            "The best one. CS143 is really really i been was very nice. I learnt a lot.", 
            "Oh man, Cain is the bomb."
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Tough grader ": "2", 
            "Caring ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "896034": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=896034&showMyProfs=true", 
        "score": "4.3", 
        "name": "Russell Berman", 
        "comments": [
            "SOOO NICE! Professor Berman is a deep guy with a really subtle approach to ideological problems, except when he's trying to provoke a response, but don't be fooled by that, he just wants students to engage.", 
            "Professor Berman's Zionism and the Novel course is A LOT more work than most write2 courses, but worth it. Two oral presentations, student discussion leads , he keeps his politics out of the class and lets us debate the real issues. Papers are hard, he reads every word, gives tons of feedback. He doesn't say much--ever, talk at him to get help.", 
            "Professor Berman is profound, caring and helpful, best feedback of any professor I've had.", 
            "Wonderful professor and mentor. Very low-key, but consistently supportive and helpful. He's a bit of a tough conversation though, both in class and out. He makes you do the talking, so be prepared to do that!", 
            "LOVE HIM, so cool, calm and helpful, best ever!", 
            "Easy, nice helpful if you go out of your way to ask for help.", 
            "Nobody else shows up at all the department events and talks to students. True sometimes he can be a grumpy old walrus, but if you ask him for help he can be great. He's not hard on grades and will edit your stuff pretty well if you ASK!", 
            "really helpful, nice old guy, good advice and helps you figure admin stuff out.", 
            "v. nice, like an old teddy bear not that hard to understand either", 
            "boring stuff he teaches, not easy to figure out what he wants or is saying, but once you get to know him he's great, and kinda hot too lol!", 
            "really brilliant, once you get used to the way he thinks and what he has to say about literature and poltiics, surprisingly old fashioned and conservative, but interesting.", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "4", 
            "Amazing lectures ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "3"
        }
    }, 
    "882284": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=882284&showMyProfs=true", 
        "score": "2.5", 
        "name": "Robert Leeson", 
        "comments": [
            "He is cool.", 
            "Lectured straight from the textbook, even sometimes ranting off subject into an unrelated history lesson. You'd be able to pass the class easily by reading the textbook and researching by yourself, which is what the majority of his students do.", 
            "you're better off reading textbooks on your own than showing up to any lectures. He often runs off topic and repeats the same few concepts.", 
            "None of his lectures make sense, you're better off watching European history crash courses then showing up to class because that's what he seems to think he teaches. By far one of the WORST educators I've ever encountered.", 
            "Robert Leeson is by far, one of the best and most inspirational men I have ever had the honor of studying with. He is extremely attractive, my only complain is his outfits were revealing and distracting in nature. I recommend any student to take Econ 1 with him, as it will open a gateway in your life you never knew existed. God Bless Rob", 
            "super super easy going. Econ 1 was kind of a joke with him. doent teach much so dont expect to learn anything from lectures. great way to boost your GPA and satisfy your Social Science GER"
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Graded by few things ": "2", 
            "Lots of homework ": "1", 
            "Accessible outside class ": "1", 
            "Amazing lectures ": "1", 
            "Get ready to read ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "136971": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136971&showMyProfs=true", 
        "score": "4.5", 
        "name": "John L'Heureux", 
        "comments": [
            "Took a seminar with him, and then subsequently asked him to be my advisor. You either love him, or don't understand him. He's challenging, abstruse, sardonic, and hands down my favorite professor at the Farm.", 
            "Years ago I took a sophomore seminar from him. Amazing class. Came back here 13 years later just to rave. I can't recommend him highly enough.", 
            "Great teacher with a good heart.", 
            "He was my prof of modern American poetry at Tufts. I thought he was absolutely extraordinary and now, years later, I realize how great his influence was on me and what a wonderful teacher he was. I still remember how well he read Yeats.", 
            "Took a sophomore seminar on contemporary American short fiction. One of the best classes I've ever taken. Very hard, but the expansion of my views on literature was amazing. Extremely challenging, in a good way.", 
            "I think that this professor tends to be biased in his treatment of students and quite narrow-minded. If the student writes in a style that appeals to his ego, he encourages, if not, disparages. A terrible judge of character and potential.", 
            "He's completely different one-on-one than he is in lecture, and still great. Doesn't take himself too seriously. Take his classes.", 
            "Brilliant and witty - our class seemed to amuse him. Graded generously but was still hard on ideas.", 
            "You're either going to love him or hate him. He's witty, a great educator who takes no prisoners!", 
            "He gave me personal help with my writing, and taught me how to analyze literature. A really caring and accessible teacher.", 
            "Tough but helped me improve my writing."
        ], 
        "tags": {}
    }, 
    "1787737": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1787737&showMyProfs=true", 
        "score": "4.4", 
        "name": "Keith Schwarz", 
        "comments": [
            "avoid.", 
            "Favorite professor", 
            "a well meaning teacher, totally unfair class. proofs graded subjectively. TAs and teacher contradict each other and get salty when you ask questions.", 
            "Keith's great and this material is super cool! Just too much of it to learn all at once.", 
            "Love him!!! 103 has been such an interesting class! Wish I could take a seminar with him and learn more!", 
            "Keith Schwarz is an extremely talented CS teacher. He is organized, clear, and loves his material. His lectures inspire you to love computer theory too. But he and his TAs have an extremely punitive grading style that makes one dread this course. Learning should not be punishment. Computer Science should not be about gatekeeping.", 
            "Good professor, but makes nearly any class ultra hard", 
            "Simply one of the best teachers I've ever had! He never gives up trying to help you understand.", 
            "So great, wonderful lectures, totally caring and helpful. he really helps you understand computer science", 
            "Hands down one of the best professors at Stanford. He's totally organized, clear, and super interesting to listen to. Keith really inspires you to be great and helps so many people make sense of computer science.", 
            "Caring, clear, and really passionate - I can't recommend Keith more highly. He is extremely available in office hours and takes time out of lectures to answer student questions. He's really adamant about taking questions, and that's part of why he's such a good teacher.", 
            "Easily the best instructor I have ever had in my 8 years of college and graduate studies. Difficult class but there is no better place to take it or instructor to take it from. Course taken through SCPD.", 
            "CS 103: Keith is a great speaker/motivator. Class started off with wonderful lectures; very clear theorems, proofs, and explanations. Near the end of the course, some important concepts (PNP, R, RE, etc.) may not have been explained clearly enough, as many of my peers were lost. Midterms/final not graded leniently so be very, very specific.", 
            "Really well prepared. Does everything he could to make you succeed.", 
            "Inspirational. Well prepared. To the point.", 
            "I never review any professor. Keith, however, is the best professor I've ever had. I'm short on ways by which I can give him the recognition he deserves.", 
            "Best professor I've ever had!", 
            "Extremely engaging lecturer. Keith might actually be the best lecturer at Stanford. He moves at a lightning pace, yet somehow manages to be clear. Take his classes.", 
            "Keith is the greatest! He explains everything really clearly, is incredibly helpful, and clearly loves what he's teaching. Definitely take a class with him!", 
            "just a great teacher. you can tell he loves his job and wants students to learn"
        ], 
        "tags": {
            "Respected ": "7", 
            "Gives good feedback ": "4", 
            "Tough grader ": "3", 
            "Accessible outside class ": "1", 
            "Test heavy ": "5", 
            "Lecture heavy ": "3", 
            "Hilarious ": "4", 
            "Lots of homework ": "2", 
            "Caring ": "2", 
            "Amazing lectures ": "11", 
            "Inspirational ": "9"
        }
    }, 
    "136817": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136817&showMyProfs=true", 
        "score": "3.8", 
        "name": "Scott Bukatman", 
        "comments": [
            "scott is the best teacher i have ever had in my entire life and i seriously regret not majoring in film or taking more than 1 class with him", 
            "Great energy & enthusiasm for film. Valuable industry & analysis insights. Terrific sense of humor - but not a goofball, made learning fun. I want to study more about film after taking his class", 
            "Engaging, dynamic lecturer. Smart. Witty. Bit immature, but its endearing. Approachable.", 
            "scott is a really amazing and engaging prof", 
            "awesome", 
            "awesome", 
            "Scott is just amazing.", 
            "Funny guy, but not always clear in his purpose.", 
            "runs hot, runs cold. what's up? who knows..."
        ], 
        "tags": {}
    }, 
    "671900": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=671900&showMyProfs=true", 
        "score": "3.2", 
        "name": "Andy Rutten", 
        "comments": [
            "He is very good and I enjoy going to class. I would highly recommend taking a class from him.", 
            "As other posters have noted, Rutten's teaching methods are unique, but very effective. What really sets him apart, though, is that he actually cares that his students are learning. He is always available to meet outside of class, and takes a true interest in students. I've learned more in Rutten's classes than my other PoliSci classes combined.", 
            "These other people just can't appreciate Rutten's teaching methods. He tries to connect overall themes in Political Science to everyday occurrences, shedding new light on why exactly the machine functions the way it does. Definitely a professor you need to take more than one class to get appreciation for.", 
            "While I think he has good intentions, Rutten probably shouldn't be a professor. The entire quarter consisted of discussions about nothing substantive. While they were interesting, they ultimately led nowhere. I don't know what I learned this quarter. Not recommended.", 
            "Horrible. He has one of the biggest egos and doesn't have a clue about what he's trying to teach. He spends most of his time picking on students...", 
            "No Comments", 
            "I can't remember what the exact name of the class is, but Rutten rocks, hes extremely eclectic and kind of out there but he's def. entertaining"
        ], 
        "tags": {}
    }, 
    "161491": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=161491&showMyProfs=true", 
        "score": "4.1", 
        "name": "Thomas Sheehan", 
        "comments": [
            "Amazing professor with inspiring perspectives on life and philosophy. He also cares a lot about students. The seminar is very well designed.", 
            "No Comments", 
            "Woot!", 
            "Great lecturer, very interesting - I learned a lot", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "awsome, mesmerizing lecturer, intelligent, interesting.", 
            "Living proof that sanity is not required for professorship."
        ], 
        "tags": {}
    }, 
    "583269": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=583269&showMyProfs=true", 
        "score": "3.5", 
        "name": "Mendel Rosenblum", 
        "comments": [
            "Classic programmer that was NOT born to teach. Speaks with a very nasal-y mumble while pacing around. Reads off slides crowded with code or trivial points that are probably on the test. No live coding demos, real-world connections, or information actually needed for projects. Rude in his Piazza answers. I've seen better community college professors", 
            "He clearly knows his stuff. A little bit mumbling in speech.", 
            "he liked to wear crocs before they were cool", 
            "Good at answering questions via email and after class, but not in office hour. Lecture is not interesting but clear enough. He speaks fast. His tone is too flat to make you sleepy. Final exam questions are interesting.", 
            "Could be more enthusiastic, not the best teacher, but not the worst.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "463574": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=463574&showMyProfs=true", 
        "score": "4.6", 
        "name": "Brett Bourbon", 
        "comments": [
            "He is really helpful and knows what he's talking about!!!!!!", 
            "actually, he teaches at the University of Dallas now and he is great. there is a lack of structure however, his philosophical based lit classes are awesome!", 
            "Brett was a champ. I ended up taking a four or more classes with him. By focusing on what literature can tell us about the meaning of a good life and so forth, Brett's classes are less English literature, and more philosophy of literature, philosophy of mind, trending towards linguistics and neuroscience. Highly, highly recommended.", 
            "Brett is everybody's hero, for all the right reasons.", 
            "Brett is a genius. His class is poorly structured at times, but you should take it just for the offhand insights he'll throw at you. I can't stop thinking about what he talks about in class.", 
            "Brett is a real gem on the Stanford Campus. Don't leave without a class with him.", 
            "No Comments", 
            "Don't be put off by the t-shirts or the rapidly recited abstractions. He makes every other English class seem boring and pretentious and empty of meaning."
        ], 
        "tags": {}
    }, 
    "693288": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=693288&showMyProfs=true", 
        "score": "4.2", 
        "name": "Michael Ramscar", 
        "comments": [
            "weird how these keep getting deleted, but as with my rating for jurafsky in the same seminar -- great class, great prof, great learning experience. why does stanford always let the good ones go?", 
            "currently taking birds to words, and it's a great class. fernald and ramscar don't always get along, but they complement each other's teaching styles very well. he talks fast sometimes, but the content of the lectures is great and you can learn a lot from them. it's nice to have a psych class that isn't a re-hashing of psych-1 material...", 
            "He has a brilliant mind, and genuine soul, he is funny, kind, and a generous, caring teacher, he is also so humble and honest, and this is so refreshing from the ususal professors at stanford, I really hope he gets tenure.", 
            "Inspiring class. Pace was fast.", 
            "awesome prof. smart, quick, enthusiastic. great accent.", 
            "Very interesting class. The Prof is a cool guy, or bloke, I should say.", 
            "Awesome professor! I learned so much from his class! He truly cares about his students!", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "366800": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=366800&showMyProfs=true", 
        "score": "2.9", 
        "name": "Razvan Fetecau", 
        "comments": [
            "Nice guy , uses AT THE END OF THE DAY alot ; you can have fun too", 
            "Nice guy but everything is somehow somewhat basic and trivial", 
            "Heavy accent, yet writing is very clear, notes are extremely useful.", 
            "He is gorgeous. Don't believe me, check out his personal website (linked to the math department's). His lectures were utterly incomprehensable during class, but if I wrote down everything he said, they were very helpful when I read them over (after reading the book). His accent was also very difficult to understand.", 
            "Hard class. All the Math 50 series profs are hard but Math 52 is especially hard. They seem to be geniuses who don't understand that we're newbies trying to learn what they've already understood a million times over.", 
            "His lectures are difficult; they are all long proofs and he starts 5 minutes before class! He is however, clear if you read ahead of time. He can be (very) condescending but is helpful in office hours. Despite his harsh standards, Fetecau is personable and kind - not to mention brilliant."
        ], 
        "tags": {
            "Lots of homework ": "2", 
            "Skip class? You won't pass. ": "1", 
            "Gives good feedback ": "2", 
            "Get ready to read ": "1"
        }
    }, 
    "236142": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=236142&showMyProfs=true", 
        "score": "3.4", 
        "name": "Abbas El Gamal", 
        "comments": [
            "He has excellent command of the material and teaches very well. Extremely well prepared lecture notes and homework and exam problems that aid learning. He is a great teacher.", 
            "It expects a lot from his students, but once finished they will be able to publish in the field of information theory.", 
            "Very clear. Immense intuition on the subject. Extremely well-prepared notes. Explains central points with accuracy and emphasis. Very good homework problems, too, the kind that is not tedious, but really aids understanding.", 
            "One of the best courses I have ever taken. He has such a good grasp of the context and describes the subject with such a mastery that is unparalleled with other classes. If you want to get a first grade education, he is your guy.", 
            "Views students as a nuisance. I think he is just here to do research. Avoid.", 
            "Really horrible lecturer, likes to berate students who ask stupid questions and make fun of the class. Seems to really hate teaching and/or views undergraduates and masters students as a burden. Not much useful content in the course.", 
            "Look around the lecture hall and you'll see many students asleep. Has a tendency to chuckle to himself at jokes no one understands or even knew were told. Nasty quizzes and exams."
        ], 
        "tags": {}
    }, 
    "2229740": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2229740&showMyProfs=true", 
        "score": "4.5", 
        "name": "Cynthia Lee", 
        "comments": [
            "This is one of the best courses I've taken at Stanford and Cynthia Lee totally understands all the issues, she has a vision of how Silicon Valley needs to change, but more importantly she's willing to hear all of our ideas. This is true leadership", 
            "Professor Lee is amazing! I'm so grateful to be in a systems course taught by a woman, who understanding how bad CS pedagogy has been in the past and how much it needs to change! She's my hero!", 
            "Cynthia Lee really goes the distance for her students. She cares about making CS education inclusive and works very hard to help students continue even when they feel overwhelmed by the competition and difficulty of the assignments and test.", 
            "Cynthia is an inspiration to women in CS! It's super hard to take on a new class, she's doing a great job making 103 more accessible and fair.", 
            "Cynthia Lee is super caring, inspirational and giving. The haters don't like her lecturing style, because she's hard to follow, too excited about details before we've gotten the larger concepts, and it's just too easy tune out and get lost.", 
            "Terrible lecturer, doesn't explain things well compared to her colleagues (Stanford intro CS lecturers). Speaks so slowly that lectures are boring. Doesn't provide motivating examples for material she's teaching. Nice person, but ineffective teacher.", 
            "Dr. Cynthia Lee is my hero! Such a great role model, so dedicated to teaching us! The material is hard and super important, but the lecture format in her courses makes it hard to get all the ideas and make sense of them.", 
            "Cynthia's doing an awesome job with 107. A TON of work, but not as terrible as I'd heard and you learn important stuff.", 
            "Cynthia Lee is a great prof and role model. The material is super interesting and important but there's just too much of it for one quarter.", 
            "Cynthia Lee has done so much to make this very stressful, high stakes course CS107 accessible. She explains the material well and offered a lot of preparation for exams and homework.", 
            "Very nice prof. But this class causes extreme sadness.", 
            "it's so wonderful to have a great, enthusiastic, understanding computer science Professor teach one of Stanford's notorious killer courses, where only the privileged bros seemed to have done well in the past. So inspiring to have a WOMAN prof who supports diversity in CS teaching this course!! YAY!!"
        ], 
        "tags": {
            "Respected ": "5", 
            "Gives good feedback ": "2", 
            "Tough grader ": "1", 
            "Test heavy ": "3", 
            "Lecture heavy ": "3", 
            "Accessible outside class ": "1", 
            "Lots of homework ": "1", 
            "Caring ": "7", 
            "Clear grading criteria ": "2", 
            "Inspirational ": "5"
        }
    }, 
    "308694": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=308694&showMyProfs=true", 
        "score": "4.0", 
        "name": "Stephen Boyd", 
        "comments": [
            "great teacher", 
            "Super awesome professor. Is able to given intuitive interpretations to very complicated mathematical concepts. Gives good explanation of the theory, and focuses on how to apply it to real world problems. I feel priveledged to have been able to take this course from this professor.", 
            "Very crisp material and delivery. Very impressive personality and knowledge of the subject.", 
            "Extremely application oriented classes. First time I thought learning linear algebra is going to be useful. Brings in a variety of applications. Home works go well in helping understand the concepts. They are realistic and complete with matlab programs we have to write and observe. Best prof in EE!", 
            "A lot of reviews have mentioned that Boyd is full of himself--I don't get that impression at all. He does like to rag on other fields, but most of his criticism is warranted. He has a slightly cheesy sense of humor, knows the subject well, and tries to keep the lectures entertaining. HWs are long but not bad if you're a math person.", 
            "Really fun to go to classes.", 
            "Always elaborate on the really easy points, and skip the difficult ones that most need explaining. Rather read lecture notes than going to lectures.", 
            "I think that 263 has (almost) reached perfection. Great material and useful and enjoyable class. I don't know if his behavior is arrogant or if it's related to his sense of humour (which I like). He's also very witty. I think that it would be a pity to leave EE and not have taken a class from Prof. Boyd.", 
            "I've taken EE263, 363, and 364 from Boyd. Probably the best teacher I've had at Stanford. The classes are all quite applied, in my opinion; there is theory but it's always brought back down to earth with plenty of scientific computing. Just an outstanding teacher whose problem sets will let you master some challenging material.", 
            "He made easy things harder. Not a honest guy.", 
            "Very smart, but he knows it. His lectures are some of the most entertaining, but they take a lot of work. Deffinately recomend any of his classes!", 
            "huge ego. listening to him dis other profs is always entertaining. Material is fast paced, general requires strong math background. easy to get left behind. He great at presenting theory - but skips out on how to apply it. (Examples might be nice)", 
            "Is really full of himself and has a silly smile frozen on his face (would make a great politician)... other than that, a great teacher who exposes the hidden insights behind the subject material. The foundation he reveals will stay with you for the rest of your life.", 
            "Great, great teacher and great class. Highly recommend EE263 to anyone."
        ], 
        "tags": {}
    }, 
    "12875": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=12875&showMyProfs=true", 
        "score": "4.2", 
        "name": "Lee Yearley", 
        "comments": [
            "Can be aloof and enigmatic, but hes a tremendously perceptive and thoughtful teacher. Worth stopping by his (usually crowded) office hourshe will chat about almost anything and is genuinely interested in his students. His classes on Dante and Zhuangzi are both excellent, well-organized, well-paced.", 
            "Prof Yearley is scary sharp. Very hard to argue with. Expert in the history of ideas and Confucian social psychology. Teaching style: Felt pretentious to me. He relies a lot on metaphors. It disconcerted me sometimes when he alluded to his family/social life or gave out personal advice in class or OH. Sometimes he totally ignored questions.", 
            "My favorite undergrad prof. In Religious Studies. Also my advisor. He can be a bit intimidating because of his wealth of knowledge, and at times elusive and difficult to get ahold of...however his style and mere presence can enthrall even non-RS students. A great man if I might, an inestimable influence to me personallym. Check out his seminar!", 
            "Simply amazing; personally, my favorite professor of all time. Brilliant, astoundingly well-read, skilled pedagogue, a little arrogant, but whatever. You will not only learn a lot about the subject of the class/seminar, but probably about yourself, too. You owe it to yourself to take at least one of his classes.", 
            "Fantastic in a seminar, very intelligent. Shows a genuine interest not only in your learning the material but also in your development as a person (may be a good or bad thing for you depending on what you want out of a professor)", 
            "extremely intelligent and knowledgable, but can seem to be extremely arrogant and cynical. dont let my personal feelings put you off however, cos he's a great professor.", 
            "One of the wisest men you will ever meet.", 
            "Articulate and thoughtful, makes IHUM enjoyable (which would seem to be a paradox).", 
            "No Comments", 
            "awesome!"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Respected ": "1", 
            "Caring ": "1"
        }
    }, 
    "12873": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=12873&showMyProfs=true", 
        "score": "4.4", 
        "name": "David Kennedy", 
        "comments": [
            "Excellent!", 
            "Even for a Stanford professor, this dude is very smart.", 
            "He is a great lecturer and definitely knows what he's talking about inside and out. I just saw him on a public television documentary on President Wilson - his knowledge of that period is extensive. Definitely recommended as a prof!", 
            "One of the very best on WWII and Great Depression. Thinks highly of himself, but he's earned it.", 
            "very interesting guy; he could really explain a coherent theory of 20th c. american history. however, he assigned WAY too much reading and the paper topics weren't very good.", 
            "Very good lecturer who managed to keep most people awake during IHUM. Knows his stuff and explains it well, too!", 
            "Aw, I thought the cheezy humor in his book was awesome! Cool guy, knows his stuff.", 
            "The sense of humor in his book is so lame!!!!!!!"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Caring ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "12872": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=12872&showMyProfs=true", 
        "score": "3.3", 
        "name": "Philip Zimbardo", 
        "comments": [
            "terrible - nothing has needs to be said.", 
            "he is very good something", 
            "What a beast, he is the all time greates teach Eva!!!", 
            "The greates", 
            "A brilliant intellectual and gifted mentor! One need only read his 'The Lucifer Effect' to understand why he is among the foremost leaders in the field of Psychology. His students should be honored to be a part of his academic conversation.", 
            "He is his best promoter. Left wing to our detriment.", 
            "A mixed bag. Zimbardo is entertaining and insightful, but also highly egocentric and arrogant. Seems more interested in demonstrating how brilliant he is than in really teaching—more of a showman than an educator.", 
            "Passion: 28% F", 
            "No Comments", 
            "Kind of full of himself, but hell, he's the****.", 
            "funny, interesting, likes to talk about himself a lot", 
            "I love his movies! Especially the talking picnic basket! He's double hot! I love his approch to studying 'UMANITY.", 
            "He was always helpful and interested and made a personal commitment to undergraduate students.", 
            "No Comments", 
            "Awesome teacher; very interesting lecturer and hilarious stunts. learned a lot", 
            "No Comments", 
            "No Comments", 
            "Class is easy and entertaining. Unfortunately, Zimbardo is more of a showman than a teacher. Take it if you're looking for a fun class and an easy A.", 
            "Zimbardo gave me back my faith in Stanford. Psych 1 redefined my academic trajectory.", 
            "hes an amazing psychologist. i loved him as a teaher"
        ], 
        "tags": {
            "Skip class? You won't pass. ": "1", 
            "Tough grader ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "105632": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=105632&showMyProfs=true", 
        "score": "3.1", 
        "name": "Douglas Osheroff", 
        "comments": [
            "Lectures and textbooks were bad. lecture notes were good.", 
            "he's a grandfatherly professor who means well, but he's totally incomprehensible and his lecture is just babbling/regurgitating lecture notes. at least for me, it was really rough, plus 43/e&m is the toughest of the 40s series... i'd really avoid him if you can", 
            "Great speaker, kept material interesting.", 
            "Very nice, caring, helpful person--very smart--thank you", 
            "Really nice. His enthusiasm in lecture makes physics actually bearable. He loves doing demos and gives u lecture notes every class, huge bonus.", 
            "Notes are incomprehensible. Did not make sense in any of the lectures at all. The class only made sense once I did my problem sets, otherwise was completely useless. Has a strange sense of humor though, has a flair for being theatrical and goofy. The final was suprisingly easy, said it was his \"christmas present\" for us.", 
            "great great man", 
            "he reminds me of my grandfather. i loved it", 
            "he is unaware of his own arrogance", 
            "Shows a lot of concern for students if you approach him, though that's made rather difficult by the horde of students fawning over him during office hours... dare I call them Nobel groupies?", 
            "pompous, arrogant, uncool", 
            "difficult class, made more so due to confusing, diffuclt, arrogant professor.", 
            "His lecture notes are kind of illegible and his lecture can wander off. Likes to mention his award in class a lot. Approachable, though.", 
            "a pompous little man.", 
            "This guy really loves teaching, and it shows.", 
            "No Comments", 
            "Interesting, but kinda hard to understand.", 
            "Nice guy, but has a tendency to confuse during lecture.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "925287": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=925287&showMyProfs=true", 
        "score": "4.8", 
        "name": "William Abrams", 
        "comments": [
            "love Abrams!! He's very thought provoking and the grading is lenient if you are thoughtful in your papers. He let me do the work and be interested without having to worry about my grade too much.", 
            "While the class wasn't particularly hard to do well in, it didn't need to be. Professor Abrams inspires his students to be better at everything they do, including in this class. I thoroughly enjoyed both classes I took with him, and I would highly recommend anything he is teaching, even if it is not in your area of study.", 
            "Wonderful teacher, very passionate about what he teaches...go visit and talk with him if you get the chance.", 
            ":)", 
            "Great professor, engaging class. He wouldn't just lecture, he'd get conversations and debates started. The class is pretty easy-- it's easy to get away with not doing the reading, and he practically tells you how to pass the final, but it was a fantastic class. More than any other class at Stanford, this one taught me a new way to think.", 
            "Excellent Professor. Easy class. Too much work for 3 units though. 12 Page research paper, group project and a Final."
        ], 
        "tags": {
            "Respected ": "1", 
            "So many papers ": "1"
        }
    }, 
    "550077": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=550077&showMyProfs=true", 
        "score": "4.9", 
        "name": "Chris Bobonich", 
        "comments": [
            "Great teacher, great material, great ideas, challenging assignments", 
            "I have to admit that I really enjoyed this IHUM. It's easily the best winter/spring IHUM. He is crazy yet brilliant, clear, and very entertaining. The reading was very interesting and the course tied together well. I very highly recommend both Bobonich as a prof and the Fate of Reason as an IHUM in general.", 
            "Very entertaining, and he teaches the material very well, too. His lectures tend to include some kind of example or thought experiment that results in the gruesome death of an unsuspecting student.", 
            "Bobonich is crazy but extremely clear and good at making complex ideas simple. Going to lecture is like going to a play. He's amazing...a gem.", 
            "uses very unusual & funny examples to illustrate moral dilemmas. like candy bars laced with arsenic. very kooky, super engaging, walks down the aisles while speaking, hardly ever just \"reads\" from the notes. every lecture's like a miniature performance. pretty awesome.", 
            "No Comments", 
            "Very entertaining in class- uses all sorts of crazy analogies and hypothetical situations about chandeliers falling on people and violence involving maces, shotguns, and burning oil. He is also a vegan, which is cool because it means he takes his philosophy seriously."
        ], 
        "tags": {
            "Respected ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "641640": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=641640&showMyProfs=true", 
        "score": "2.7", 
        "name": "Mark Applebaum", 
        "comments": [
            "Satisfactory.", 
            "If you enjoyed how your high school teachers taught you (think busy work, stupid attendance mechanisms, and sarcasm attempting wit) you'll love Applebaum.", 
            "Very funny guy! Made learning fun and interesting.", 
            "Mark Applebaum is one of my favorite teachers of all time. Engaged, entertaining, brilliant, kind. Love love love him!", 
            "i'd sooner switch places with judas with mephistophales than listen to his muic", 
            "Narcissus would find him egotistical.", 
            "No Comments", 
            "Incredibly poor teacher. The size of his hair is only surpassed by the size of his ego.", 
            "Pretentious and full of it/ himself. Avoid at all costs if you aren't exactly the same.", 
            "No Comments", 
            "It just doesn't get any better than Applebaum. Truly amazing."
        ], 
        "tags": {
            "Tough grader ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "204719": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=204719&showMyProfs=true", 
        "score": "4.7", 
        "name": "James Gross", 
        "comments": [
            "Loved this class! He was very entertaining and was able to always explain the material clearly.", 
            "really good", 
            "Definitely take Psych 1 with him!", 
            "amazing.", 
            "james gross is my hero!", 
            "He has a great sense of humor! Really entertaining. Class is extremely well organized. He's also the author of the textbook used in the class. Although, the book is kind of a pain to get through, Prof. Gross is worth it. I've heard the other two Psych1 professors guest lecture and Gross is definitely the best out of the 3. Take this class!!", 
            "awesome", 
            "AWESOME", 
            "Awesome teacher! Always funny and entertaining. Book is important for picky exam questions and there are always a few questions from lecture. So do both, but lecture is fun so you won't mind. ^^ Class easy to get an A in tho.", 
            "one of the best professors ever. i was never bored during his lectures b/c he always made everything really entertaining and funny! i highly recommend taking any class he teaches, especially psych 101", 
            "Great teacher! :) Going to class is like watching a one man show. I was rarly if ever bored. And make sure you go to lecture, because there are always questions he covers that the book doesn't.", 
            "Funny guy! During the class, you feel like he's a peer...a peer who knows what he's talkiong about.", 
            "This guy just loves himself. If you ask him about anything that he's not directly interested in (ie memory, devo, social) he turns it back onto himself or tells you it's unimportant. Going to class is like watching him intellectually ****--funny in the abstract, miserable in practice.", 
            "One of the best profs I've had.", 
            "No Comments", 
            "Professor Gross is one of the greatest professors I've had at Stanford. He is an extremely enthusiastic and knowledgeable professor who cares about his students and has a wonderful sense of humor. His class made me wish I had majored in psychology!", 
            "No Comments", 
            "Very approachable and enjoyable."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Get ready to read ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "503861": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=503861&showMyProfs=true", 
        "score": "2.0", 
        "name": "Chris Moylan", 
        "comments": [
            "Don't know why everyone is giving this guy a bad review. He's the easiest professor I've ever taken. Basically paid money to get free A+. I showed up to syllabus day and left halfway through and haven't been to class since.", 
            "This guy goes to my high school in san jose. He thinks hes better than everyone just because he went to standford. If he calls on you and you dont know the answer, he waits and humiliates you. If you have the wrong answer, he rolls his eyes back. Other teachers also dont like him. Overall, drop chemistry if you are going to have this teacher.", 
            "You can never feel comfortable to ask questions in his class or else he will tend to make you look bad or say something sarcastic", 
            "Most knowledge professor", 
            "Honestly, Dr. Moylan is the worst teacher to ever step on my high school campus. His snobby and arrogant attitude, accompanied with his unwillingness to help his own students, creates an aura of negative tension throughout the class. His tendency to purposely fail anyone whenever possible is due to his anemic attitude of thinking he was successful.", 
            "He as a resource was completely unhelpful. TAs didn't seem to know what was going on either. His tests tend to be almost exactly the same, so check previous terms' tests. This was the first science class I'd ever been in where the entire lecture hall unanimously responded \"NO\" when a professor asked, \"Did that make sense?\"", 
            "this class is pretty alright. the lectures by moylan are really great, but the lab TAs are confused and there are extremely unclear directions and expectations for the lab period. they grade the labs way too tough, but know what you're doing and you'll be fine.", 
            "If you listen in class, do your work, and have half a brain, you'll do fine in Moylan's class. Many of my classmates were whiny pre-med students who wanted to learn ONLY what's on the exams and nothing more. If you're so lazy and want everything spelled out and spoon fed to you, why the hell did you apply to Stanford??? A's are EARNED,you whiners!", 
            "By far, the worst professor that I have had at Stanford. I am no longer interested in chemistry at all as a profession.", 
            "Moylan is extremely high on himself and was didn't seem to care at all about the students in this class.", 
            "The class is too much work. You do learn a lot though and in the end it is worth it. I liked it. This must be taken with a grain of salt because I also enjoy dressing up in latex and being whipped. He is not a bad lecturer. Unfortunately he does not lecture on everything you need to know to complete the lab reports, the rationale being that you nee", 
            "Way too many assignments: 3 10pg lab reports, 4 20min orals, 2 midterms, 2 5pg lab tour reports. One or two assignments due per week - made it hard to keep up in other classes. On the plus side, he is a better teacher than our other chem profs, and the grading wasn't impossible: the curve was: 1 A+, 7 A's, 1 A-, 7 B's, 1 C, 1 F.", 
            "Moylan is a terrible teacher; avoid him and this class if at all possible. First, the class is a ridiculous amount of work - more like 10 units, not 4 - and second, he doesn't teach anything. So you're expected to teach yourself all the theory for everything. And you're at a major disadvantage if you haven't taken 153 - so be warned!", 
            "Moylan is the worst teacher the world has ever seen. He gets pissed off if you ask him a question.", 
            "CHEM 36 isn't that bad, but 130 is hell. Moylan is the worst teacher I have ever had. If you try to ask him anything he will get pissed off.", 
            "Avoid this teacher AT ALL COSTS.", 
            "This class was pretty easy. I did my work and got an A period. The exams are super easy. Great lecturer, dressed up as Harry Potter first day.", 
            "Although did do this cool Snape-impersonation thing at the beginning of Chem 36 last year, he's annoying.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Gives good feedback ": "1", 
            "Tough grader ": "2", 
            "Lots of homework ": "2", 
            "Skip class? You won't pass. ": "3", 
            "Lecture heavy ": "1", 
            "Group projects ": "1", 
            "Hilarious ": "1", 
            "EXTRA CREDIT ": "1", 
            "Participation matters ": "2", 
            "Amazing lectures ": "1"
        }
    }, 
    "594081": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=594081&showMyProfs=true", 
        "score": "4.7", 
        "name": "Dan Edelstein", 
        "comments": [
            "Professor Edelstein is a joy to learn under. His lectures are engaging, and he is easy to approach outside of class. I highly recommend Professor Edelstein to any prospective students!", 
            "Love him!", 
            "Best ESF class, great discussions, adorable guy with cutest dog", 
            "Kind of funny, but his lectures where a load of****. I like it when he played the piano.", 
            "I must second the previous two opinions; what a delightful man. What a great teacher - so helpful, so patient. His humor is so sweetly funny - nothing sarcastic about it (maybe he's being extra-gentle with the undergrads). Adorable, adorable, adorable.", 
            "No Comments", 
            "Adorable. Bright, funny, fuzzy-haired, polymathic, informal, w/kind smile."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Amazing lectures ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "105542": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=105542&showMyProfs=true", 
        "score": "3.2", 
        "name": "Carolyn Ross", 
        "comments": [
            "She's so unorganized. She didn't give us any grades, until the end of the quarter when you suddenly get a grade with no explanation. She only gave feedback on one of the four projects for the class ( and even that didn't get a grade).", 
            "This class tried to incorporate both the CWP and CCR formats. This wasted a ton of time and Ms. Ross was herself very disorganized. She never evaluated anyone's work, nor provided any feedback, she simply provided a grade at the end of the quarter. Avoid taking a class from her at all costs. Avoid CWPs at all costs, for fear of getting a dud!", 
            "so frustratingly bad- horrible time management- blabs on and on", 
            "great", 
            "Don't ever take a class from this woman. Straight up.", 
            "Carolyn Ross is the most amazing writing teacher. She definitely made me look at community service in a whole new way- the topic of her writing course became an object of analysis in its own right. I can actually say her class changed my life!", 
            "Good teacher, helpful, approachable, friendly", 
            "good", 
            "great teacher! I loved her class"
        ], 
        "tags": {}
    }, 
    "766349": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=766349&showMyProfs=true", 
        "score": "4.4", 
        "name": "Marta Baldocchi", 
        "comments": [
            "She's the consummate language teacher: she demands copious participation and offers ample cultural context. A native of Milan and strict yet understanding in times of illness, she is perfect for her position and a great instructor.", 
            "Outstanding!!!", 
            "No Comments", 
            "Nice class: I learnt moltissimo!", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Gives good feedback ": "2", 
            "Caring ": "2", 
            "Participation matters ": "2"
        }
    }, 
    "1094185": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1094185&showMyProfs=true", 
        "score": "4.9", 
        "name": "Tom Kosnik", 
        "comments": [
            "One of the best courses I have attended during this Fall", 
            "hands on experience, energetic, real life examples, my favorite professor, inspiring", 
            "Awesome instructor, super useful material.", 
            "Dr. TomK changed my perspective about everything, and made me believe in myself more. He wasn't only an amazing professor; he was also someone I could turn to whenever I needed someone to give me advice about school, career, and life in general. BTW, he introduced me to people (mostly CEOs) who made my goals and dreams even more possible. :)", 
            "He is my hero. He is the one of the best professors in the world.", 
            "Energetic, inspiring, talkative, Digresses with stories."
        ], 
        "tags": {
            "Gives good feedback ": "2", 
            "Group projects ": "1", 
            "Participation matters ": "2", 
            "Accessible outside class ": "1", 
            "Caring ": "1", 
            "Inspirational ": "3", 
            "Amazing lectures ": "2"
        }
    }, 
    "308685": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=308685&showMyProfs=true", 
        "score": "2.4", 
        "name": "Steve Rock", 
        "comments": [
            "Great professor who cares about students. Uses great analogies to explain concepts.", 
            "Barely introduces topics, and then assigns problems that require he taught well (which is rarely the case).", 
            "I was hoping to learn a lot from this class but trying to get clear explanations from this guy is next to impossible!", 
            "I have to agree with the other guy. Its weird he makes simple topics like conservation of momentum or energy seem way harder and complex then they should be. Grading in fine and fair...but don't expect to be wowed by him", 
            "Well-meaning, but not very clear. Ironically, has difficulty teaching the fundamentals on which he likes to focus. Tests are OK."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1"
        }
    }, 
    "874208": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=874208&showMyProfs=true", 
        "score": "5.0", 
        "name": "Giovanni Tempesta", 
        "comments": [
            "Great professor - very knowledgeable and enthusiastic.", 
            "The way he explains each and every concept is excellent .", 
            "Professor Tempesta is simply a brilliant teacher.", 
            "Prof Tempesta is one of the best professors I have ever had. He explains everything very well, makes learning fun, and is also super helpful. If you have him you are lucky!", 
            "Professore Tempesta is an amazing teacher, incredibly kind and patient. His enthusiasm for the Italian language and culture made me look forward to coming to class everyday!", 
            "Professore Tempesta is an amazing teacher, incredibly kind and patient. His enthusiasm for the subject made me look forward to attending this class everyday!", 
            "Absolutely great teacher.", 
            "Great experience. Loved the class.", 
            "He is an amazing professor, I have taken three quarters of italian from him and I absolutely love him!!", 
            "totally agree with other comments", 
            "Agreed completely", 
            "If you want to take a class that you will truly love... TAKE THIS PROFESSOR! He is the coolest teacher in the entire university. Your a fool if you don't have have the privlage of taking a class with him!"
        ], 
        "tags": {}
    }, 
    "137847": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=137847&showMyProfs=true", 
        "score": "4.5", 
        "name": "John Bravman", 
        "comments": [
            "One of Stanford's finest educators and university leaders. The man is a legend in his own time.", 
            "Very engaging, cares about students.", 
            "He's an amazingly committed teacher.", 
            "I took this class from him back in 1996 and thought he was one of the best professors in the Engineering program. He uses a lot of experiments, is witty, very clear, and also very fair and nice to his students. Overall a fantastic professor.", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "227578": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=227578&showMyProfs=true", 
        "score": "4.0", 
        "name": "Hong Zeng", 
        "comments": [
            "Zeng Laoshi is notoriously hard but if you work hard she will reward you with her beautiful smile and also you'll feel hella godo about yourself.", 
            "Terrible. Horrible personality. Impossible to work with", 
            "I had Zeng Laoshi when I studied Chinese 1 my senior year at Stanford. I live in China now and constantly get compliments on my clear pronunciation and solid grammar, which I credit to the solid foundation I received in her course. She's tough, but the results are amazing.", 
            "Tough but you learn a lot from her. Keep up with her high expectations and both you and Zeng laoshi will be happy with the results.", 
            "SO MEAN. SWTICH out! you have options, get out quick!", 
            "Best teacher ever- she is very committed to student success and wants every student to do well. Tough, but her high expectations pay off with how well you'll be able to speak Chinese at the end...", 
            "good", 
            "Firm and fair. She's not afraid to tell you that you were lazy on a homework assignment, but she'll go out of her way to answer questions if you ask. She's no nonsense, exactly how a good language teacher should be. A phenomenal teacher!", 
            "mean mean woman. she likes to shout and students and make fun of them. do not take it from her. put her in her place", 
            "She's very strict and yells at students so many times, but she's indeed very kind and helpful. She wanted us to get serious about learning Chinese. If you do the work and get serious, she will be very kind to you. otherwise, you might get killed in class.:-)", 
            "pretty much made coming to class a torturous experience. i think i cried after class on a weekly basis because she's so harsh. if you're not brilliant (or you dont have parents who speak chinese) expect to get chewed out regularly. i regret to say that her harshness sort of killed my interest in the subject.", 
            "a good teacher, but she expects a lot from you. you'll do well in the class if you work at it consistently every day, but if you're not prepared, watch out. She's strict and won't hesitate to scold you in front of all your classmates.", 
            "No Comments", 
            "She's a very good language teacher, but a tad harsh. She yelled at a senior for being late to the oral.", 
            "Strict, but great teacher."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "Tough grader ": "1"
        }
    }, 
    "1894904": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1894904&showMyProfs=true", 
        "score": "4.8", 
        "name": "Jerry Batteh E Batteh", 
        "comments": [
            "Doc is fantastic. He made this class so much fun and I thoroughly enjoyed his lectures. If you skip his class you will be in some serious trouble.", 
            "WOW.. TOUGH CLASS BUT FANTASTIC LECTURES THAT MAKE THE ASSIGNMENTS EASY TO FOLLOW", 
            "Great Professor but tough.", 
            "Dr. Batteh is one my favorite Professors. I recommend him to anyone! His exams are a \"B\"", 
            "TOUGH AS HELL", 
            "Dr. Batteh's class fills up so fast. I was on a waiting list to get in. He has a way of making complex Mathematical concepts easy to unravel", 
            "You know what they say? it is always easier the second time around. I failed Doc's class and had to repeat it!", 
            "Doc is known for being an energetic and fun instructor. However, they forgot to mention that his exams are hard as hell", 
            "Dr. Batteh was very helpful. His exams are rigorous to say the least. I am just thankful I got through the course", 
            "One of the BEST PROFESSORS here at Stanford!", 
            "Dr. Batteh's class was my best class.", 
            "Dr. Batteh was an amazing Professor. He made the subject matter easy to understand. His exams are a rough but fair.", 
            "Dr. Batteh's exams are rough. I enjoyed his class. I recommend taking is class.", 
            "TOUGH TOUGH TOUGH"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Gives good feedback ": "2", 
            "Tough grader ": "2", 
            "Respected ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Lecture heavy ": "1", 
            "Hilarious ": "1", 
            "Amazing lectures ": "2", 
            "Inspirational ": "1"
        }
    }, 
    "332959": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=332959&showMyProfs=true", 
        "score": "4.2", 
        "name": "Lanier Anderson", 
        "comments": [
            "Great philosophy professor really helps you grasp the big picture", 
            "One of the best profs at Stanford. Clear, great lectures, very inspirational", 
            "Awesome, smart, helpful, hot", 
            "Best professor I ever had at Stanford. His class on existentialism changed my life.", 
            "Lanier Anderson is the most obviously brilliant person I've ever met, and likely the best professor as well. He clearly puts a lot of effort into writing and rehearsing his lectures, and it pays off; they are fascinating. I am stunned that there are people who don't recognize how amazing this guy is.", 
            "Passion: 28% F", 
            "Best teacher of my life! And totally HOT! :)", 
            "No Comments", 
            "lanier has this awesome way of knowing your name and referring to your point and how it fits into the discussion", 
            "Insightful, eloquent, wonderful at engaging a great discussion", 
            "Very good class, but his co-professor (J. Landy) takes the spotlight.", 
            "****!!!!!!!!!!!", 
            "Co-teaches an excellent class on Phil and Lit with Joshua Landy", 
            "This dude was unintelligible. My dad came to visit (he's a college professor), and he said it was the worst lecture he'd ever heard. Lanier's smart as hell, and I think an interesting guy, dedicated to teaching, but talks too damn fast, and reads too much from lecture notes. I think I'd dig him in office hours, but lectures? SNORE.", 
            "HARD AS HELL", 
            "No Comments", 
            "Read from lecture notes too often.", 
            "HE IS VERY HOT!! BUT DONT LET HIM FOOL YOU!", 
            "He was a good, solid professor. I enjoyed how wrapped up he was in BEING professorly and performing the role well. It really felt like one was studying philosophy in the grand traditions of the discipline.", 
            "Who cares how he teaches? He's hot!"
        ], 
        "tags": {
            "Respected ": "1", 
            "Inspirational ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "474492": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=474492&showMyProfs=true", 
        "score": "4.2", 
        "name": "Keith Baker", 
        "comments": [
            "He's insanely smart and famous, but he also has a wicked dry sense of humor, and he really does care about his students.", 
            "professor baker is one of the smartest people on the planet", 
            "Absolutely well learned and knowledgeable on all aspects of history throughout this century. Incredibly dedicated to the applications of historic actions in todays globe including the bestowing of animation within the classroom. Excellent and wise choice to sit in his room and absorb his lectures. Not really! This guy is a lunatic!", 
            "It has been a while but I recall very good lectures; very learned professor. I recommend taking his classes, if possible", 
            "Total snob in denial."
        ], 
        "tags": {}
    }, 
    "658957": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=658957&showMyProfs=true", 
        "score": "3.0", 
        "name": "Guadalupe Valdes", 
        "comments": [
            "She is an excellent lecturer and mentor. She is still exploring a theory on the development of US heritage languages. The presentations available on the www are useful to understand that there is indeed the need to pull the common thread in this field and go beyond personal anecdotes. It is clear to us that empirical studies are needed too.", 
            "Excellent professor, mentor, and teacher. Highly recommend if you are passionate about studying/researching language. Not sure about the comment below since we literally read about super-diversity and language rights.", 
            "I wish we would have covered models of bilingualism in the United States and elsewhere. In the age of post-globalization, things do change fast , and we should be better informed about super-diversity and language rights.", 
            "I had a great time in her course about bilingualism- learned a lot and was part of interesting in-class discussions. Is she old-fashioned in class? Maybe. But if you talk to her outside of class she's forward-thinking and wise", 
            "Ms. Valdes gives good feedback about the content that has to do with English learners. She is less interested or not at all interested in promoting Spanish and the Spanish speakers. A real disappointment.", 
            "The teaching methodology and the content of some of these Ed. courses are outdated.", 
            "She is one of the best professors I have had at Stanford. She is knowledgeable about the field and is an amazing lecturer.", 
            "No comments.", 
            "One knows more about a class after several years. In the end some courses are useless in real life and work. I have to begin to de-learn what I thought was inspirational but it isn't", 
            "Very easy classes overall. Smart students should look for someone else with real content and solid educational theories that could enlighten us in the real world of public education. Easy grader 'cz she does not want to make waves. But it would be better to make waves and teach something challenging ro begin with.", 
            "I was not impressed with the content of this class. Theories of education are neither solid nor persuasive. Readings are way too easy for grad students who have more potential than what prof. Valdes has perceived. If you don't have to take this instructor, please don't.", 
            "I'm not impressed with this prof, because her theories of education are based on anecdotes or personal stories. There is not anything scientific that as educators we can use when we go to the real world of educational leadership. A real disappointment.", 
            "She talks and talks and talks, and it is hard to get the gist of what she said in one whole hour. If you don't have to take this class, please don't. It's a major waste of time.", 
            "She isn't that bad, but she could be better if she could impress smarter students. Her thing is about English and learning or not learning it. A real disappointment.", 
            "One of the best profs I had at Stanford!", 
            "Very knowledgeable about her field of study, she knows everything about the Spanish language. Also, she is extremely articulate in both English and Spanish. However, sometimes her lecture are too verbose.", 
            "Wonderful professor. Very experienced and thought provoking. Dr. Valdez keeps it real.", 
            "Great class, great professor - very knowledgable, friendly. Easy grader", 
            "Very interesting class, especially for those who are interested in exploring the future of Spanish in the US and in the language angle of Latin culture. Only thing that keeps me from rating it higher is lack of free student discussion. Some, not enough."
        ], 
        "tags": {
            "Accessible outside class ": "5", 
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Caring ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "931515": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=931515&showMyProfs=true", 
        "score": "4.8", 
        "name": "Giancarlo Aquilanti", 
        "comments": [
            "Fantastic professor.", 
            "Took conducting with Giancarlo. His individualized feedback is great, and it's really helpful to learn from such a competent conductor who can model what he's looking for. Great sense of humor and faith in students who put the work in.", 
            "I took music 21, 22 and 23 with Professor Aquilanti. He is a superb teacher.", 
            "Can't imagine taking music theory with any other prof.", 
            "I love Giancarlo. He's one of the best teachers I've ever come across.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Caring ": "1", 
            "Hilarious ": "1"
        }
    }, 
    "138111": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=138111&showMyProfs=true", 
        "score": "4.0", 
        "name": "Daphne Koller", 
        "comments": [
            "Excellent Professor that does not suffer fools gladly.", 
            "I must say CS228 was way over my head and I decided not to do AI as a field based on the class. The weekly assignments took 8-9 days to do on average (at least to my team). From what I could gather (before dropping the class) Daphne is a decent teacher for people who have the brainpower and background to follow her.", 
            "Daphne is awesome. She likes what she does, and makes you like it too! By the way, I think she's hot too ;)", 
            "Friendly but deadly.", 
            "clear teaching style but tendency to drastically overload coursework.", 
            "Makes her course interesting", 
            "The bottom line is you learn a lot.", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "363551": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=363551&showMyProfs=true", 
        "score": "1.8", 
        "name": "Daniel Schwartz", 
        "comments": [
            "The best class at Stanford, ever.", 
            "Great Teacher", 
            "No Comments", 
            "No Comments", 
            "Dan likes to make students feel unhappy being in his class."
        ], 
        "tags": {}
    }, 
    "450003": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=450003&showMyProfs=true", 
        "score": "2.5", 
        "name": "Serge Plotkin", 
        "comments": [
            "Horrible teacher, Can't explain. TAs are just for \"moral support\", and it makes this class harder.", 
            "He is a good Professor. He knows the material and he cares to teach them right. The material itself is not easy though.", 
            "Belittles students' questions during class.", 
            "Horrible instructor, avoid like the plague.", 
            "One of the best theory classes I have ever had (and I had quite a few). Though material is not trevial, he managed to retain my attention throughout entire class. I took the follow-up class as well. Very, very good!", 
            "Plotkin can't explain anything. He should resign from teaching.", 
            "An ok teacher, doesn't really sympathize with students."
        ], 
        "tags": {}
    }, 
    "1951412": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1951412&showMyProfs=true", 
        "score": "4.7", 
        "name": "Kenneth Allen Taylor", 
        "comments": [
            "Professor Taylor is truly inspirational. He's a brilliant role model for young philosophers, especially young men of color. HOWEVER, he has little patience for those who've never learned how to argue philosophically, so basically if you've gone to a high end school you are at an advantage in his courses.", 
            "Professor Taylor is an incredibly profound teacher whose courses will change your life. You will never look at the world the same. You will never make empty assertions again. You will own the books you read. He's also hilarious and kind and a total role model.", 
            "Your jaw will drop when you're in seminar with Professor Taylor. He's brilliant and real, funny and totally serious. He makes you be real too. He's a tough grader and expects a lot, the oral exam is pretty intimidating, but you learn much you will be ready to argue with anyone.", 
            "Professor Taylor's ESF8/8A is the best ESF course. Great readings and discussions. Inspiring vision. Really wants students to think and learn. Can't wait to take Phil 80 with him!", 
            "What a great class with Professor Taylor, he makes me want to be a philosophy major except that I really prefer math. He's wise, funny, and helps you find your way with difficult readings.", 
            "This is the one professor I can always get out of bed to hear. He's brilliant, serious, and leads the way to important ideas. I'm so glad I took his class. The readings are mixed, some great, some meh, but he makes it all worthwhile.", 
            "Having a background in philosophy is a must for ESF8. Taylor didn't really _teach_ it, but instead guided and commented on the discussions in a way that brought up points he wanted us to take note of. You can skipskim a reading or two, but make sure you've got a good understanding of almost everything else."
        ], 
        "tags": {
            "Respected ": "4", 
            "Graded by few things ": "1", 
            "Participation matters ": "3", 
            "Inspirational ": "6", 
            "Get ready to read ": "2", 
            "Amazing lectures ": "2"
        }
    }, 
    "67584": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=67584&showMyProfs=true", 
        "score": "4.0", 
        "name": "Ian Morris", 
        "comments": [
            "An amazing, riveting lecturer who does cool stuff", 
            "Morris is awesome. Take this class you'll love it.", 
            "an Amazing Professor! Certainly the best professor I ever had.", 
            "Professor Morris has this amazing way of telling stories about Greek History that makes it extremely engaging. He also does a great job covering important issues. His accent is also cool.", 
            "awesome accent", 
            "Very entertaining and very focused on his work", 
            "No Comments", 
            "funny guy...expects a lot from the students", 
            "No Comments"
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "1", 
            "Inspirational ": "1", 
            "Amazing lectures ": "2"
        }
    }, 
    "67582": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=67582&showMyProfs=true", 
        "score": "4.4", 
        "name": "Mike Tomz", 
        "comments": [
            "Awesome teacher. When I first took this class, I thought I would be turned off from IR. How wrong I was. Besides that he's an influential guy in the field, he's extremely clear and helpful. The tests are hard and you have to do a lot of work, but it's worth it.", 
            "tests too hard. class too strict. turned me off from IR, and i'm an IR major.", 
            "test", 
            "Very clear teaching, engaging.", 
            "Excellent class; its painful during the process but it provides a foundation for any PoliSci class you'll take after it.", 
            "Arrogant weasel, writes 'gotcha' exams (relevance of Annie Oakley to international relations? if she'd accidentally shot some German politician, WWI might not have happened.... Is this really something that should be on a test?), uses and abuses his research assistant gophers.", 
            "Nice guy", 
            "Very clear, structured, nice and easy going", 
            "Clear and concise. Refreshingly cheesy.", 
            "Very helpful, organized, a good class", 
            "RICK! The lazy eye, the meticulously organized slides, the way he says cheese", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "824987": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=824987&showMyProfs=true", 
        "score": "4.4", 
        "name": "Patrick Young", 
        "comments": [
            "Great", 
            "Took CS108, the intro to object-oriented programming. The first few lectures put me to sleep. The rest weren't necessary, apparently; I didn't go. I got an A in this otherwise useful project class, and my only interaction with Prof. Young worth mentioning was a question he couldn't answer.", 
            "Dr. Young is way cool. CS105 changed my life. Made me want to drop out of school and just design webpages.", 
            "Tries to make lectures entertaining, but because they are online there is little incentive to go.", 
            "Really enjoyed this class, Patrick really makes sure that you understand the material. He wrote the book, so he lectures in a similar \"straight forward\" manner. Very nice guy, more people should laugh at his dry humor.", 
            "No Comments", 
            "Extremely friendly once you get to know him. Come to his office hour and chat with him. Knowledgable and understand what it's like to be an undergraduate. Great lecturer. His exams can be challenging but study and you'll be fine.", 
            "explained concepts so that the average person with no comp experience would understand, fair exams and projects"
        ], 
        "tags": {
            "Respected ": "1", 
            "Caring ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "132743": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=132743&showMyProfs=true", 
        "score": "4.8", 
        "name": "Channing Robertson", 
        "comments": [
            "I watched his lectures on youtube. I'm not a stanford student, but looking at what he does in class, he loves to mess around with people, but he's good.", 
            "Great professor, presents good lectures and has a great sense of humor!", 
            "Amazing professor. Take Intro to ChemE even if you aren't majoring in engineering.", 
            "Probably the best professor at Stanford. After taking his class, I am completely dedicated to the Chemical Engineering major. His teaching style is exceptionally engaging, his lectures are laced with lots of funny stories. I can't wait to TA for him this spring.", 
            "No Comments", 
            "Best Teacher at stanford!!"
        ], 
        "tags": {}
    }, 
    "1789039": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1789039&showMyProfs=true", 
        "score": "3.7", 
        "name": "Brajesh Samarth", 
        "comments": [
            "I am taking class with Dr. Brajesh at Emory University right now. Simply the best professor. He cares so much about his students and so friendly.I would love to take his class again.", 
            "I had this professor a number of years ago. He contextualized Hindi within its social, cultural and political contexts. He makes you feel at ease speaking, which is especially important for beginning-level language learners.", 
            "Really awesome professor. Tries to make a community out of the classroom. He listens to students' issues/requests and actually responds to them in how he chooses to structure the class. Laidback but also pushes everyone in their language ability.", 
            "Disappointing class.", 
            "Nice guy. Disappointing class.", 
            "Graduate students beware: This lecturer definitely throws an undergraduate pitch. It's more like a student social club than a class. Nice enough but doesn't really teach grammar.", 
            "He's great - learning the language, the culture, the history and lots of other interesting stuff along the way. Really incorporates what is pertinent to current events and our lives to make the class very interesting. Definitely my favorite class ever.", 
            "Truly amazing teacher. Incorporates the culture, history, and literature of India with language learning. Listens to each student, facilitates just what is needed for comprehension (but lets you get there yourself), is unfailingly supportive, and has a great laugh too."
        ], 
        "tags": {
            "Respected ": "2", 
            "Amazing lectures ": "1", 
            "Caring ": "1", 
            "Participation matters ": "1", 
            "Inspirational ": "1"
        }
    }, 
    "691642": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=691642&showMyProfs=true", 
        "score": "4.3", 
        "name": "Justin Du Bois", 
        "comments": [
            "Du Bois is the best.", 
            "Awesome guy", 
            "he is obviously very smart but that does not make him the best teacher. he is way too fast. even the hwk is difficult without TA help. not that clear.", 
            "dubois is a good teacher, but he moves way too fast in this class; he skips over a lot. Part of the problem is that there are (college) seniors to 3rd+ year grad. students (who are taking the class the 2nd time_, so there's definitely a big range of background. Problem sets are hard; you will learn a lot, but it will be a lot of work!!", 
            "The best orgo chem professor I've had at Stanford!", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "825715": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=825715&showMyProfs=true", 
        "score": "3.1", 
        "name": "Dafna Elrad", 
        "comments": [
            "Pretty good. I went to office hours once.", 
            "I thought she was helpful and i learned a lot.", 
            "i don't know what they are talking about - i liked her,", 
            "A lot of work and Elrad is no help.", 
            "worst prof ever, and i really mean that. she's not even a professor, just a some plant biologist hired as a lecturer. she is completely inept as a lab manager and universally hated by the students. oh, and very not hot", 
            "Dafna Elrad is the worst teacher I've ever had. Her grading practices were blatantly unfair (she flunked a number of students on their decently-written lab reports), and she did not maintain the laboratory equipment, even after the supply manager warned her that the experiments wouldn't work if she did not do so. Don't take a class from her."
        ], 
        "tags": {
            "Accessible outside class ": "2", 
            "Gives good feedback ": "1", 
            "Group projects ": "1", 
            "Participation matters ": "1", 
            "Caring ": "1"
        }
    }, 
    "1832866": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1832866&showMyProfs=true", 
        "score": "5.0", 
        "name": "Chris Piech", 
        "comments": [
            "awesome teacher", 
            "No one is perfect. Chris Piech is.", 
            "A true blessing. A wonderful man and amazing instructor. Passionate about his work.", 
            "An engaging and inspiring teacher. His lectures are clear and he makes you understand why learning the material matters.", 
            "The most inspiring professor at Stanford. Brings in real material into every problem and is the most encouraging, approachable, funny lecturer - he encourages everyone to apply AI to benefit the world/social good.", 
            "Chris is a smart and inspirational teacher. His examples help bring the subject to life.", 
            "THE BEST PROFESSOR!!!", 
            "Chris Piech is doing amazing things with CS109. HE's so clear, interesting and helpful. The material is tough, but it's rewarding to do such interesting psets and have such great lectures. He's the BEST!", 
            "The mediocre teacher tells. The good teacher explains. The superior teacher demonstrates. The great teacher inspires. Chris absolutely inspires! His classes are phenomenal!", 
            "Chris Piech is everything! A natural teacher who loves his material and gets students to love it too. I want to be all that, do what he does, live that amazing life of being a great teacher at the world's greatest CS department.", 
            "Most humanistic lecturer in any science-- very charismatic, animates the material very well.", 
            "So genuine and kind, really enjoyed taking his class! Explains things very well and clearly. Is very accessible and approachable.", 
            "So lucky to have Chris Piech! I am not good at math, and never thought I could learn to program, but he makes the class so accessible and clear and is so helpful in office hours, I'm finally getting it, thank you, thank you!!", 
            "What a great teacher and role model for computer science majors. He's so dedicated and enthusiastic, he makes me want to do what he does.", 
            "A wonderful, natural, deep teacher, who really knows how to help students see the bigger picture of Computer Science concepts", 
            "Passionate lecturer, good use of microsoft paint. Loved his class.", 
            "Amazing and passionate Professor.", 
            "The most engaging lecturer I've ever had - Chris is bursting with energy and with awesome examples that make the material come to life. Never expected to say this, but CS106B was probably my favorite class I've taken at Stanford because of Chris. I really can't offer high enough praise.", 
            "Chris is clearly passionate about teaching. He is one of the best lecturers I have had at Stanford.", 
            "Awesome teacher."
        ], 
        "tags": {
            "Respected ": "9", 
            "Gives good feedback ": "2", 
            "Accessible outside class ": "2", 
            "Hilarious ": "4", 
            "Caring ": "5", 
            "Inspirational ": "14", 
            "Amazing lectures ": "14"
        }
    }, 
    "795607": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=795607&showMyProfs=true", 
        "score": "3.0", 
        "name": "Heather Hadlock", 
        "comments": [
            "Excellent professor and mentor.", 
            "Heather is an amazing professor with such joy and enthusiasm about her subject matter. One of the best prof's I've had in the music dept.", 
            "I agree. The article was very illuminating. I can't say it added to my knowledge of music but it certainly improved my sex life! And isn't that what college is for?", 
            "I can't comment on her lecturing, but I highly recommend everyone check out her seminal 1995 article published in the Journal of Sex Research. I know it made my quarter.", 
            "Boring. Harsh grader. It's an intro seminar for gosh sakes! (she's nice though)...", 
            "Boy, this lady is stupid. I can't believe she's a Stanford professor!"
        ], 
        "tags": {
            "Accessible outside class ": "1", 
            "Gives good feedback ": "1", 
            "Caring ": "1"
        }
    }, 
    "1786999": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1786999&showMyProfs=true", 
        "score": "5.0", 
        "name": "Charlie Cox", 
        "comments": [
            "Hands down one of the best professors I have ever taken. Organic chemistry with him is amazing. He knows the material, he knows how to best teach the material, and he is readily available. Very clear expectations, but the tests are very hard. It can cover so much in a 3-page test. I was extremely prepared for the next courses in the sequence.", 
            "Analytical chem is not them most interesting subject and with the writing in the major added on top of that, this course could have been a nightmare. Dr. Cox was very helpful and was easy to follow in lecture. I felt that the grading was extremely harsh but you get revisions. Compared to other chem courses this one is tough but has lots of support.", 
            "Incredible teacher. So dedicated. Really goes out of his way to help students.", 
            "Adv organic with Cox is the best course in the chemistry department! The assignments are meaningful and not a waste of time like in the other organic courses. We talked a lot about organometallic chemistry, and I truly learned a lot. He is the most dedicated professor in the department.", 
            "Dr. Cox was hands down one of the best teachers/professors I've ever had. He goes well out of his way to help students through the course, holding weekly outreach review sessions (go to those!), writing a course workbook (use this!), and holding office hours almost every day (go to those!). He is a very clear lecturer and very patient.", 
            "A competent and caring professor, Charlie loves his material and it shows. Work hard, don't be afraid to ask him any questions (and you will have questions, chemistry is full of complexities and exceptions) and you'll do great!", 
            "Not too bad. This year he was manageable but outreach and the workbook proved to be very valuable. In fact, it was almost required to go to the Friday outreach to get through the course--especially the first part. Cox taught the acid/base and inorganic stuff. Fair exams--similar to the workbook with some conceptual twists. I would take him again."
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "2", 
            "Tough grader ": "1", 
            "Skip class? You won't pass. ": "1", 
            "Participation matters ": "1", 
            "Inspirational ": "2"
        }
    }, 
    "544822": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=544822&showMyProfs=true", 
        "score": "4.4", 
        "name": "Paul Bator", 
        "comments": [
            "Bator is great. He is quirky but a great professor. He assigns shorter papers than most PWR1 professors and is not too tough of a grader. He likes meeting with his students 1 on 1 in the writing process. Ask him what he wants in paper and he will give you what you need. The only homework for the quarter is two 2000 word and one 4000 word papers.", 
            "Well, he's unusual, that's for sure. But once you get used to his style you see how helpful he is and how much he knows about writing. He's super nice and supportive too and expects a lot of you.", 
            "quirky and funny, but is very demanding in terms of what he requires on papers, and grades pretty harshly. very nice and easily approachable if you need help on anything.", 
            "Not only a great PWR 1 prof, but one of the best profs I've had at Stanford.", 
            "Bator is by far the best instructor I have had at Stanford. He is interesting, v. helpful, and knows what it is like to be a student. If you don't know what class to take when choosing PWR, just take whatever he's teaching.", 
            "Bator was a great teacher and turned out to be a great advisor even after I left his class. A very thoughtful and considerate prof. You can tell that he genuinely cares about students.", 
            "I loved Bator. He was really quirky and has his idiosyncracies, but that's what makes him so great. He was a harder grader at first than he came off to be, but overall works very hard to meet with everyone and help them along. Great class.", 
            "Bator is a very involved and helpful writing teacher who will work with you outside of class and answer all your e-mails. He has an interesting presentation style and often leaves the discussion group very open ended.", 
            "Bator did a really good job with making himself available for questions through e-mail or at the library/CoHo. He was also really cool about and flexible with any problems encountered during the quarter (comp/family problems, writer's block, whatever). Really attentive, quirky, and interesting guy", 
            "Bator's aloof-nutty professor quality promotes a comfortable atmosphere, nevertheless he is suprisingly attentive to his students and aware of the dynamics of the classroom. He gives his students respect and individual attention. Workload, in a nutshell: I basically wrote 3 papers for this class."
        ], 
        "tags": {
            "Hilarious ": "1", 
            "Gives good feedback ": "1", 
            "Participation matters ": "1"
        }
    }, 
    "291530": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=291530&showMyProfs=true", 
        "score": "2.5", 
        "name": "Priya Satia", 
        "comments": [
            "Priya Satia is not a great teacher. She is average. There are much better teachers in the department; unfortunately, she is the one teaching such a pivotal part of history. Also, her first assignment is pretty unclear. She doesn't teach you how to think about history; feels like a high school history class.", 
            "I took a graduate-level class with her and three other students. She's good at shepherding discussion along. I don't know that she always added too much to the discussion, but that was cool because it made us talk to each other instead of to her. She could have been a little clearer about assignments though.", 
            "No Comments", 
            "excellent course overall. the lectures were very clear and did a good job of unifying the (substantial) course readings. learnt a lot in the course, changed my view of the relationship between britain and its colonies. definitely recommended for anyone with an interest in britain or colonial history.", 
            "A most horrible course. I can't believe this counts for higher education."
        ], 
        "tags": {}
    }, 
    "291531": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=291531&showMyProfs=true", 
        "score": "3.4", 
        "name": "Aprajit Mahajan", 
        "comments": [
            "Despite the complaints about him, I thought he was extremely thorough, meticulous, and methodical in his teaching. The material isn't easy but he says everything at least 2 or 3 times. Some things like the OLS assumptions he went over almost every lecture. Loved the class, despite being frightened coming in.", 
            "Rocked my world", 
            "fantastic", 
            "Incomprehensible. The worst class I've been in.", 
            "He cares about his students, he wants us to learn...but I could not for the life of me understand anything he was teaching.", 
            "He's the coolest prof on campus--and the most brilliant man I've met. He's gentle, helpful, and very thorough. In response to the comments above: do we need a break for a class that meets for UNDER 2 hours?", 
            "Terribly boring. Class was from 11:00-12:50, and he never even gave a moments thought to ever letting us out early or giving us a break in the middle. Problem sets are long and not graded in any timely fashion. Anything I learned in this class I learned from the textbook."
        ], 
        "tags": {}
    }, 
    "419852": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=419852&showMyProfs=true", 
        "score": "2.5", 
        "name": "Liran Einav", 
        "comments": [
            "Useless feedback", 
            "HIST 101", 
            "Absolutely painful experience, it is so hard to understand him even though you know that he cares deeply about his students. Don't even bother asking him questions though, even though he cares about students, he thinks you should know it already, so he will dismiss your questions. The psets take forever, overshadow other class. Tests are hard", 
            "I disagree with the other ratings, I really liked Einav. Yes, he's foreign and the material can get tricky; he is also not the most dynamic lecturer. But he is very clear and methodical. The problem sets and exams are well chosen; they test knowledge while also challenging us to go above and beyond. I'd recommend this class.", 
            "No Comments", 
            "So uncomprehensible that I had to drop the class and take it later; so unpersonable that I didn't feel badly at all about doing it.", 
            "Don't take this class from Einav. Thick accent makes him hard to understand. Problem sets are very hard and graded very harshly."
        ], 
        "tags": {}
    }, 
    "136991": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136991&showMyProfs=true", 
        "score": "3.1", 
        "name": "Ken Fields", 
        "comments": [
            "Ken's negative reviews must be from students who only care about grades and don't feel safe in a class where tired scholarly analysis won't impress the professor. Ken's \"rambling lectures\" are not only captivatingly interesting, but also an inspiring example for how we ought to think- always tangentially, never linearly. LIFE CHANGINGLY FUN!", 
            "I had to drop the class because he graded my paper as failed only because it contradicted his opinion. I felt he wouldn't allow for a discussion of differing opinions to his. This was in 1984. It was so long ago, I've forgotten the class number, but it was professor Fields and his dog, Daisy.", 
            "Good poet with an amazing archive of quotations in his head. Lectures have little substance though, and facilitates discussion badly with \"Well, what do you think?\"", 
            "Ken is and incredible, one-of-a-kind professor who udnerstand the deeper implications of literary works. Anybody who thinks he is boring should probably be majoring in investment banking. Have fun.", 
            "i took the summer class. in one word: inspiring. as a professor he was kind of boring...i must admit i fell asleep EVERY class...no joke...only because of the lecture-tell all type of talker he is BUT he was a decent guy...had GREAT stories to tell..has a lot of life experience...great class and great teacher...", 
            "On the one hand, he's not a bad guy. Decent grader. On the other, he dwells rather incessantly on his former problems with the bottle, which he interrupts otherwise productive discussions to expound to the class. Also feels the need to share with us the writings of all his close friends.", 
            "One of the lamest professors I ever had. Every class he yammers on about his personal problems and how they related to whatever book we read. Also a tough grader. Steer clear."
        ], 
        "tags": {}
    }, 
    "137640": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=137640&showMyProfs=true", 
        "score": "4.8", 
        "name": "Joshua Landy", 
        "comments": [
            "Great lectures and material, great professor", 
            "Wonderful teacher and terrific class, I had only a vague notion about literature and the big questions it asks when I started this course and now I still see I'm only beginning, but my thinking is forever changed.", 
            "terrific, thoughtful teacher.", 
            "Brilliant. Articulate. Generous. Funny. Basically, Landy's everything good.", 
            "Wonderfully illuminating course. It changed the way I think about the world. After taking the course, everything aesthetic seemed more engaging, complex, and analyzeable. Landy and his co-teacher, Lanier Anderson, are lovely both individually and together.", 
            "Stimulating *intellectual* experience!", 
            "Joshua Landy is a wonderful professor. Unfortanetly, his recent praise has made him a wee bit arrogant, with a tendancy to swagger.", 
            "Landy is probably the most charismatic professor I've ever had. He's funny in a witty, self-deprecating kind of way, and seems genuinely interested in what students have to say. This makes him very approachable. He's also obviously very smart, and his views on the interaction of philosophy and literature are interesting.", 
            "Very clear. This class was required and I really am not interested in it but he made it much more bearable.", 
            "Very clear lecturer who has interesting things to say about all the texts. Highly recommended.", 
            "I love this man.", 
            "right on. i'm glad i'm not the only one. he has the most amazing blue eyes. i seriously want to bring him to a state of existential transcendence, if you know what i mean. oh, and the class is good too.", 
            "Where do I start?.. Prof. Landy is wonderful in so many ways, and I sincerely hope that, just because I find him extremely attractive, it won't minimize his professionalism, his excellent teaching, his great scholarship, or the fact that he's just a wonderful human being. Unfortunately, I have to stress again: he is HOT!", 
            "great guy, super smart, hot accent--a little pretentious, but what do you expect, he's british.", 
            "who else can motivate you to actually go to IHUM lecture? And he is a really great guy who actually cares about individual students", 
            "an awesome guy. extremely nice."
        ], 
        "tags": {
            "Respected ": "2", 
            "Amazing lectures ": "2", 
            "Inspirational ": "3"
        }
    }, 
    "661391": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=661391&showMyProfs=true", 
        "score": "3.3", 
        "name": "Abbas Milani", 
        "comments": [
            "Getting A is super easy. His class was a waste of time. He isn't an academic but a dilettante. He doesn't deserve to be in Stanford. He got here just with the help of his influencial friends. If you read his articles, you will see how he changes his opinions just on demand! He doesn't have an ingenious interest in research but in being seen", 
            "Dr. Milani is one the most knowledgeable professor in the country with lots of different experiences. His lecture is interesting and understandable! It can be an easy A.", 
            "If you want to raise your GPA then take his class, but don't expect to get a deep view on the subject. He is just a good storyteller.", 
            "His knowledge is not enough for an academics but a journalist.", 
            "he is not a good teacher his knowledge is poor just play with words", 
            "Very knowledgable. Was a political prisoner in Iran. Class attended by military and journalists. tells interesting stories. Very helpful & flexible. reading are from the national security archive. including declassified CIA documents and actual transcripts of diplomatic cables. 1 paper 1 grade. very easy. You can pick any topic any length", 
            "No Comments", 
            "Prof. Milani is one of the nation's leading experts on Iran, and a tremendous resource for all of us today. He balances the often biased views of the Middle-East (on both sides) and produces a very factual, interesting, and well-researched opinion. Also one of the rare professors with Hoover connections. All around a great class.", 
            "The best author in the world", 
            "No Comments", 
            "No Comments", 
            "Prof Milani is an excellent teacher; he both explains things clearly and makes them interesting with stories about his own - very illustrious - past. Overall definitely one of the best professors at Stanford University, and definitely recomended."
        ], 
        "tags": {
            "Respected ": "1", 
            "Gives good feedback ": "1", 
            "EXTRA CREDIT ": "1", 
            "Amazing lectures ": "1"
        }
    }, 
    "136843": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136843&showMyProfs=true", 
        "score": "4.3", 
        "name": "Terry Karl", 
        "comments": [
            "She teaches oil politics and a research seminar. I strongly recommend her because of how intelligent, informed, and articulate on a multitude of political issues. Her instruction was particularly helpful in helping me to state my ideas clearly. I admire her and I would tell anyone to take her class.", 
            "One of the best professors at Stanford. If you don't take a class with her you missed out.", 
            "Just an average instructor. Seems good just by comparison with the rest of the bunch", 
            "great!", 
            "No Comments", 
            "good, insightful lectures. awesome class. LOTS of reading. if you study hard and write papers well, you'll get an A."
        ], 
        "tags": {}
    }, 
    "155537": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=155537&showMyProfs=true", 
        "score": "3.7", 
        "name": "Momoyo Kubo", 
        "comments": [
            "FANTASTIC! A true teacher! She has a talent for teaching and makes learning fun! ???", 
            "Awesome professor who continued to teach well in the second quarter. She is both a teacher and friend in class.", 
            "Awesome professor who teaches well. She is both a teacher and friend in class.", 
            "By far the fastest Japanese speaker in the JLCC program. Lots of grammar points. Seems tough but is really willing to help out students who go to office hours.", 
            "enthusiastic prof. not too hard of a grader", 
            "No Comments", 
            "No Comments", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "651090": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=651090&showMyProfs=true", 
        "score": "3.8", 
        "name": "Laura Roman", 
        "comments": [
            "Dr. Roman's PWR2 was great! She taught me how classical rhetoric could improve my speaking and writing skills and in the process gave me a new appreciation for film music. No complaints.", 
            "Roman is one of the best professors I will ever have. Her course is hot, and she's hot. She taught from her research (including a 1-1 personal interview she conducted with Francis Coppola)and managed to combine that with Quintillian and classical Rhetoric. This is one of the best courses I've taken at Stanford.", 
            "Dr. Roman's class on rhetoric and film music is so far one of my favorite classes at Stanford. She is totally brilliant and passionate about the subject. She let us research what we wanted and gave us the appropriate guidance at the same time. She's a really fun person and also totally hot - I think I am in love with her . . . I highly recommend th", 
            "Dr. Roman's PWR 2 class on film music totally rocked. I learned so much about the subject and totally go over my fear of pubic speaking. Dr. Roman is energetic, brilliant and totally fun - her classes were always interesting snd her expectations realistc. I stronly recommend this class!", 
            "Roman is awesome. Her class activities were usually fun and always useful. My speaking and writing improved greatly in her class!", 
            "She's very strict with her rules. Not a fun person, but she feel very good about herself. The atmosphere in class is OK, which is mostly due to the students us who strive to make discussions more fun. On the other hand she will usually swirl us back to the serious discussions (Rome, Greek and oratory).", 
            "Roman went out of her way to help me improve.She graded my work based on where I am now in my learning process.She did not expect me to write like Shakespeare to get a good grade.She is an OUTSTANDING TEACHER.She represents the VERY BEST at Stanford!!!She is kind as a person and teacher.She wants her students to excel, learn, and have fun.", 
            "In our first meeting she told me how much her class would help me improve my writing and speaking. So far I have not learned one single thing in her class except that she's a mean, conceited person who doesn't know how to use quotation marks. I haven't learned anything about writing or speaking, or about film music (the subject of my pwr)", 
            "Dr Roman is a very accomplished woman and her PWR 1 class really improved my writing. We had some class jokes and, contrary to common conceptions about PWR 1, the two-hour sessions were very enjoyable.", 
            "Well, my expectations for PWR were low, but at first I found her teaching near intolerable. Her style of speech is very affected, as are her staged gestures and stiff lesson plans. As I got to know her, I realized that she was nice, and I bet as she continues teaching, she'll loosed up a bit... but overall, the class wasn't terribly fun..."
        ], 
        "tags": {}
    }, 
    "1474184": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=1474184&showMyProfs=true", 
        "score": "5.0", 
        "name": "Ruth Starkman", 
        "comments": [
            "This woman is like a reincarnation of a GOAT, she is literally an OG at everything. Hands down, one of the best profs I've ever had. The campus literally revolves around her. However, sometimes her class can get difficult, but it really do be like that sometimes. Either way, she helps you understand it; most importantly, she actually cares for you!", 
            "Ruth Starkman is TheGOAT, a very inspirational speaker and teacher, who helps you build intuition to solve hard problems and write about them like a philosopher and a programmer. She may be the only professor at Stanford who has truly crossed the fuzzy/techie divide.", 
            "Ruth Starkman was my teacher 20+ years ago at Cal. not only did she remember me when I contacted her recently, she remembered my work and our conversations, and wrote me a recommendation the same day. Amazing.", 
            "Energetic lectures on tech and ethics, clearly loves her subject. But be prepared. She'll walk up to you and ask a question about Kant or code or ?? Starkman is the OG.", 
            "BEST PROFESSOR EVER", 
            "Professor Starkman is a little intimdating. She's very welcoming in class and encouraging. Then she rips your work to shreds. Literally. Every. Word. But then she shows you how to improve and she makes you want to do better. In the end you do OK, make friends in class, and learn a lot.", 
            "Here's the thing with Professor Starkman. She's super smart and has zero patience for dogma of any kind. Don't just come in and spout off your private theory of ethics. You will just embarrass yourself. The reading is hard . You need to do it before class and be prepared. See her in her office hours, she's not that intimidating in person.", 
            "The stuff I learned with Professor Starkman has stayed with me for years, and when you go back to visit she remembers you perfectly like no time has gone by. Ask her for help on job apps and gradmed school, nobody goes the extra mile like she does.", 
            "The one professor who's taught me most in my Stanford career.", 
            "Starkman's lecture on ethical frameworks is the most interesting lecture I've heard at Stanford in all my four years. She's cool too, the only professor I know brave enough to take 106A", 
            "She rocks! Ruth helped me on all aspects of my work, from the writing to the ethics and integrating course readings. She totally kills it as an editor for all your school, professional and entrepreneurial writing too.", 
            "Great teacher. super clear and helpful, fair-minded, non-ideological, supportive and inclusive of everyone. Readings are super hard, so ask for help!", 
            "writing and ethics, this lady kills it best, see her in hume and see the light.", 
            "She's really good at helping you articulate your own ideas, but make sure you do all the writing assignments, esp the daily ones, these add up a lot and really affect your grade", 
            "brilliant, hilarious, and yes, totally in your face, she wants you to learn and do something in the world!", 
            "Rumored to be super chill, she even tells you it's easy to get an A if you revise and pay attention, but if you slack even the slightest, she's will let you know EXACTLY why your work was subpar and then some. BEWARE!", 
            "She's super smart, cultured, laid back. But intense too, makes you to revise, revise, revise until you do A work.", 
            "Awesome professor! Classes with her are always fun and inspiring!", 
            "Starkman the merciful, helpful, and awesome, unless bring doom on yourself", 
            "The best professor I have had, ever."
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "5", 
            "Hilarious ": "1", 
            "Caring ": "2", 
            "Inspirational ": "6", 
            "Get ready to read ": "2", 
            "Amazing lectures ": "6"
        }
    }, 
    "362964": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=362964&showMyProfs=true", 
        "score": "4.9", 
        "name": "Robert Sapolsky", 
        "comments": [
            "A brilliant teacher, being able to explain concepts clearly, but with a lot of details and examples", 
            "I've been watching his lectures online and it is extremely inspirational and mind-blowing.", 
            "I don't even go to Stanford, but some of his lectures are online and I've learned more from them than any of my actual classes.", 
            "Does an excellent job of explaining tough material.", 
            "Dr. Sapolsky's class is absolutely incredible. He's easily the most animated and engaging lecturer I've had. Each lecture is around two hours, but it almost never feels that long. I would highly recommend this class (and anything else taught by Sapolsky) to any person with the opportunity to take it.", 
            "Human Behavioral Biology, offered through youtube and iTunesU, is easily the best class I've ever taken. I highly recommend it to everyone. Sapolsky's passion and understanding of behavior will benefit everyone no matter what they are studying.", 
            "One of the best teachers in the world. Taking a Dr. Sapolsky class is one of the great experiences of a persons life.", 
            "best", 
            "Sapolsky is legendary.", 
            "Best teacher in the Biology department by far", 
            "Amazing prof.", 
            "Amazingly great teacher", 
            "Best teacher I've had --- hands down. And probably the best class I've taken at Stanford. There are simply no words to describe the experience. He is funny, animated, approchable, makes materal accessable for understanding, and just blows your mind by the connections he makes between different fields. You are literally on the edge of the seat..", 
            "The Best prof I've ever seen.", 
            "Best class. Period.", 
            "There should be a portal into Spolsky's head. Freakin. Great.", 
            "you must take the class before leaving Stanford. One of the best at Stanford.", 
            "One of the best classes I've taken at Stanford (no wonder it always has 500+ students). Sapolsky's amazing.", 
            "No Comments", 
            "Took this some years ago when I was on campus. Sapolsky managed to mix amygdalas, hormones, and stories from africa to make a class with 100s of students feel like it was a class of ten."
        ], 
        "tags": {
            "Respected ": "2", 
            "Gives good feedback ": "2", 
            "Hilarious ": "3", 
            "Caring ": "1", 
            "Inspirational ": "6", 
            "Get ready to read ": "1", 
            "Amazing lectures ": "6"
        }
    }, 
    "203922": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=203922&showMyProfs=true", 
        "score": "4.3", 
        "name": "Robert Plummer", 
        "comments": [
            "He's clear, enthusiastic and super likeable. I loved his course.", 
            "One of the best classes I took at Stanford. Bob was a great!", 
            "Great professor, extremely clear in presentation and very likable in person. However, it wouldn't hurt if he made his students break a sweat once in a while -- his classes are too easy.", 
            "I learned nothing from him. He went through a problem, explaining each step in clear detail & the reason behind each step so I remembered them, until getting to the final \"answer\". The next day after class, he said, \"by the way, the answer we got was wrong because the steps we took were wrong\". He wouldn't explain further. Not a good teacher.", 
            "i loved Bob he was awesome!!!", 
            "I really liked this class and Plummer is really good, however I got a bad grade. Make sure you do all the hw's . . .", 
            "Groovy guy, fun to watch.", 
            "He's called Easy Bob for a reason, but nevertheless, an excellent lecturer and very approachable.", 
            "No Comments", 
            "How could you not like Bob? He's awesome.", 
            "awful; puts you to sleep", 
            "Plummer is awesome, and his slides are so clear and concise."
        ], 
        "tags": {}
    }, 
    "203927": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=203927&showMyProfs=true", 
        "score": "4.9", 
        "name": "Mehran Sahami", 
        "comments": [
            "Be prepared to work very, very hard if you have had no significant experience with computing. This is an 'intro' class in the same way rocket science is child's play. The good news is that the professor happens to be just the one to make this class great. Professor Sahami and his teaching staff are brilliant, funny, accessible and fair.", 
            "He is clearly the best instructor I ever had.", 
            "Mehran is great in front of the class. Totally engaging. Wonderful, fun, clear lectures. In person, he has no time and expects you to talk to the TAs if you need anything.", 
            "He is AWESOME!", 
            "Awesome lectures can't explain with words", 
            "BEST PROFESSOR", 
            "Wow! such a clear, brilliant teacher. Every class makes you love the material as much as he does.", 
            "Having seen the 106a lectures online and liked them, I wasn't particularly expecting anything new. yeah some of the material was familiar but Mehran was so much more awesome in person and such a great teacher, who really prepared me for some of the more difficult computing concepts.", 
            "Awesome", 
            "I liked him.", 
            "One of my fav profs of all time. Textbook needed if you don't have any CS or Java experience but otherwise the class is generally pretty easy. Lectures are recorded.", 
            "Best Prof of all time", 
            "He shoves a bunch of html, Javascript, CSS, PHP, and forces down intensive computer knowledge down your throat. He spits sizzling apple juice from his puckered lips and does yoga throughout class.", 
            "Mehran is awesome. He is always fun to listen to and he explains everything so well. The lectures are also filmed and uploaded on the course website (same day) so you \"go to lecture\" on your own time (at double speed). He is very approachable and loves what he teaches.", 
            "He is simply great! ;)", 
            "His classes were the highlight of my week.", 
            "Mehran is the best. He makes CS approachable for beginners, and his lectures are awesome and are full of funny jokes and candies.", 
            "One of the most impressive lecture at Stanford. Well-organized lecture and tough course work (programming assignment.) Essential for CS student.", 
            "He's great", 
            "The best prof through whom I could learn online"
        ], 
        "tags": {
            "Respected ": "10", 
            "Gives good feedback ": "4", 
            "Tough grader ": "3", 
            "Lots of homework ": "4", 
            "Lecture heavy ": "2", 
            "Group projects ": "1", 
            "Hilarious ": "10", 
            "Amazing lectures ": "16", 
            "Inspirational ": "11"
        }
    }, 
    "2127": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=2127&showMyProfs=true", 
        "score": "5.0", 
        "name": "Doug McAdam", 
        "comments": [
            "gooooooooood", 
            "I love McAdams class. He's super funny but also makes you very interested in the subject. Great guy", 
            "McAdam is amazing! He's an extremely fair grader and also very engaging! Take his class you won't regret it.", 
            "McAdam is amazing! He is very engaging because he is totally devoted to the material. In Soc. 1 we actually got to read works that he'd written. How interesting to go to class and hear from the author himself about how and why he wrote the material!", 
            "SUPER SUPER SUPER GUY! Take his class, it's absolutely amazing. He is SO FUNNY. His grading is fair, and class is not too hard. SOC 1 is extremely interesting.", 
            "Great prof! Great class!"
        ], 
        "tags": {
            "Beware of pop quizzes ": "1", 
            "Gives good feedback ": "3", 
            "Graded by few things ": "1", 
            "Clear grading criteria ": "2", 
            "Caring ": "2"
        }
    }, 
    "132638": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=132638&showMyProfs=true", 
        "score": "3.4", 
        "name": "Chaitan Khosla", 
        "comments": [
            "Had him for E20 (intro to chemE) and it was just not a good class. I'm not sure how much of it was from Khosla's teaching, because it was a \"flipped\" classroom format. I feel if we actually learned the material in lecture, he might've explained it well. But based on the flipped format, he didn't really have anything useful to teach.", 
            "He doesn't teach well at all. Expects you to read most material out of the book, but goes at a snail's pace in class. That's not what a prof is supposed to do. Avoid him", 
            "this class sucked", 
            "The Nobel Prize will be his soon.", 
            "Jeez, his homework are tedious", 
            "I really enjoyed my time in the lecture. He's funny, and knows everything."
        ], 
        "tags": {}
    }, 
    "136982": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=136982&showMyProfs=true", 
        "score": "2.3", 
        "name": "John Felstiner", 
        "comments": [
            "Absolutely the worst professor I have ever had in my college career. Rude to students, offended by multi-tasking, which was difficult because listening to him was a waste of time anyway since he never spoke a coherent since during the entire course. Created stupid busy work and had a condescending attitude, on top of all of other short comings.", 
            "Prof. Felstiner's teaching was frustrating and incompetent. While he was amusing to listen to, the effort was almost too much. He had no logical order in his lectures, and what he taught was pointless and erratic. And yes, he shrieked in class. Like a banshee. (The rest of the course, Lit into Life, was quite enjoyable, however.)", 
            "This guy's lectures seem like they're on the verge of being brilliant, but never really quite make it. You feel like he could be the most interesting person in the world if he only wanted to be. Sings badly and often. Has focus issues. The material of the class holds its own, though, despite the strange lectures.", 
            "Prof. Felstiner made me laugh every single lecture. He always had really interesting things to say and he made lecture highly entertaining!", 
            "No Comments"
        ], 
        "tags": {}
    }, 
    "512926": {
        "url": "http://www.ratemyprofessors.com//ShowRatings.jsp?tid=512926&showMyProfs=true", 
        "score": "4.2", 
        "name": "Nancy Buffington", 
        "comments": [
            "Good teacher", 
            "not very helpful.", 
            "Very good professor! Makes PWR interesting and is very nice and helpful. I enjoyed PWR because of her class and was actually sad to be done with it at the end of the quarter. Try to get in her class if you can!", 
            "No Comments", 
            "No Comments", 
            "No Comments", 
            "She's the best! I'm not an English person, but I loved PWR b/c of her. Try to get in her pwr class if you can..."
        ], 
        "tags": {}
    }
}